{"case_id": "2023-012-135", "respondent": "피심인", "case_content": "피심인은 채용 평가 단계 중 온라인 시험 운영과 결과 산출을 수탁사에 위탁한다. 지원 접수 시 채용 진행에 필요한 최소 항목(성명, 연락수단, 지원 직무, 이력서 기본 정보)만 수집하며, 주민등록번호 등 고유식별정보와 불필요한 민감정보는 수집하지 않는다. 지원 접수 단계에서 개인정보 수집·이용 목적, 항목, 보유·이용 기간, 동의 거부권 및 거부에 따른 불이익을 알리고, 웹 체크박스 등 전자적 방법으로 동의를 받는다. 선택 항목은 동의하지 않아도 지원할 수 있음을 안내한다. 채용 절차의 진행을 위한 계약 체결 또는 이행 과정에서 필요한 경우에는 지원자가 요청한 조치를 이행하기 위해 필요한 범위에서 처리한다. 수탁사에는 응시자 식별을 위한 최소 식별자, 응시 토큰, 시험 로그, 평가 결과 등 평가 수행에 필요한 범위만 제공한다. 데이터 전송은 암호화 채널로 수행하고, 저장 데이터는 암호화한다. 수탁사 접근 권한은 평가 업무 담당자에 한해 개인별 계정으로 부여하고 다중 인증을 적용한다. 접근권한 부여·변경·말소 이력과 개인정보처리시스템 접속기록을 보관·점검하며, 위변조 방지 조치를 적용한다. 위탁자는 내부 관리계획을 수립·시행하여 접근권한 관리, 암호화, 접속기록 관리 등 안전조치를 정기 점검한다. 위탁자와 수탁사의 개인정보처리시스템에는 악성코드 탐지·치료 프로그램을 설치·운영하고 주기적으로 갱신·점검한다. 위탁 계약에는 처리 목적·범위, 보안 통제(암호화, 권한관리, 망분리 또는 접근통제, 악성코드 대응), 재위탁 제한 및 사전 승인, 사고 통지 및 대응, 접속기록 보관, 처리 현황 보고, 반환·파기 절차와 방법을 포함한다. 수탁사 사전 적격성 평가를 실시하고, 정기 점검과 샘플 점검을 통해 처리 현황과 파기 이행을 확인하며, 필요한 경우 현장 또는 원격 감사를 수행한다. 위탁자는 수탁사 임직원을 대상으로 개인정보 보호 및 정보보안 교육을 연 1회 이상 실시하고, 위탁자 준수사항을 정기적으로 전파한다. 평가 자료는 식별정보와 평가 결과를 분리 보관하고, 인쇄물이 발생하는 경우 잠금장치가 있는 장소에 보관 후 파쇄한다. 채용 종료 및 보존기간 만료 시 전자파일은 복구 불가능한 방식으로 자동 파기하고, 관련 파기·반환 이력을 기록한다. 개인정보 처리방침과 홈페이지에 위탁하는 업무의 내용과 수탁자를 지속적으로 공개하며, 변경 시 업데이트한다. 온라인 시험의 자동화된 평가 결과가 전형에 중대한 영향을 미치는 경우, 지원자는 자동화된 결정에 대한 설명 요구 및 이의 제기, 인적 개입에 의한 재처리를 요청할 수 있으며, 이를 위한 절차와 연락처를 제공한다. 평가 기준과 처리 절차는 홈페이지에 공개한다. 침해사고 대응 체계를 운영하여 사고 탐지, 원인 분석, 추가 유출 방지 조치를 수행하고, 정보주체 통지는 72시간 이내에, 보호위원회 또는 한국인터넷진흥원 신고는 해당되는 경우 72시간 이내에 진행한다. 정보주체의 열람·정정·삭제·처리정지 등 요구를 접수·처리하는 창구를 운영하며, 법령상 보존 의무가 있는 경우에는 별도 분리 보관한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "위탁 계약 필수 기재사항 중 ‘수탁자의 의무 위반 시 손해배상 등 책임’ 조항(시행령 제28조 제1항 제5호)이 명시되지 않음.", "fix": "위탁 계약 조항 열거 부분에 다음 문구를 추가: \"수탁자가 개인정보 보호 관련 의무를 위반한 경우의 손해배상 등 책임에 관한 사항을 포함한다.\" 또는 기존 문장에 붙여 \"... 반환·파기 절차와 방법, 수탁자의 의무 위반 시 손해배상 등 책임\"으로 수정."}, {"aspect": "legality", "issue": "동의 외의 법적 근거(계약 이행 필요, 법 제15조 제1항 제4호)를 병행하여 처리할 수 있음을 언급하면서도, 법 제22조 제3항에 따른 ‘동의 없이 처리하는 항목과 법적 근거’의 구분 고지 의무가 명시되지 않음.", "fix": "동의 안내 단락 뒤에 다음 문구 추가: \"동의 없이 처리할 수 있는 개인정보의 항목과 그 법적 근거(예: 계약 이행 필요, 개인정보 보호법 제15조 제1항 제4호)는 동의를 받아 처리하는 항목과 구분하여 개인정보 처리방침 및 안내문에 명시하고, 변경 시 전자우편 등으로 고지한다.\""}]}}
{"case_id": "2023-012-132", "respondent": "피심인(회사명 비공개)", "case_content": "피심인(회사명 비공개)은 채용 단계의 평가를 수탁사의 온라인 평가시스템으로 수행한다. 지원자 식별 및 연락, 지원 직무, 평가에 필요한 과제 제출물과 평가 결과 등 최소 항목만 수집·전송하며, 주민등록번호나 민감정보는 수집하지 않는다. 업로드 문서에서 고유식별정보나 민감정보 패턴이 탐지되면 접수를 차단하고 가림 후 재제출을 안내한다.\n\n개인정보는 암호화된 통신구간으로 전송되며, 수탁사 시스템 및 내부 저장소에 저장 시 암호화된다. 접근 권한은 평가 담당자로 최소화하고 개인별 계정을 발급하며, 다단계 인증과 IP 제한을 적용한다. 개인정보처리시스템의 접속기록을 보관·점검하고 위변조 방지 조치를 적용한다. 악성코드 방지, 취약점 점검 및 백업·복구 절차를 운영한다.\n\n위탁 계약은 문서로 체결하며 처리 목적·범위, 재위탁 제한, 접근권한 관리, 암호화 등 안전조치, 접속기록 관리, 사고 통지·보고, 반환·파기 절차, 책임 및 손해배상, 감독 방법을 포함한다. 수탁사가 재위탁이 필요한 경우 사전 동의를 받도록 하고, 범위를 초과한 이용·제공을 금지한다. 위탁하는 업무의 내용과 수탁자 명칭은 홈페이지에 상시 공개하고 변경 시 업데이트한다.\n\n수탁자 감독을 위해 정기 점검과 교육을 실시한다. 점검은 계정·권한, 로그·암호화 현황, 파기 이행 등을 확인하며, 결과보고서와 개선 이력을 보관한다. 내부적으로 개인정보취급자 범위를 최소화하고 정기 교육을 실시한다.\n\n보존기간은 채용 절차 진행 및 분쟁 대비에 필요한 기간으로 설정하며, 기간 경과 또는 목적 달성 시 지체 없이 파기한다. 전자파일은 복구 불가능한 방식으로 삭제하고, 서면은 파쇄 또는 소각한다. 다른 법령에 따른 보존이 필요한 경우에는 분리보관하고 권한을 분리한다.\n\n정보주체 권리 행사를 위해 열람·정정·삭제·처리정지 및 동의 철회 창구를 운영하며, 요청 시 정해진 기한 내 처리한다. 유출 등이 발생할 경우 법정 기한과 방법에 따라 정보주체 통지 및 관계기관 신고를 하고, 피해 확산 방지 조치를 즉시 수행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "수집·이용의 법적 근거(동의 등)와 동의 고지사항/방법(법 제15조제1항, 제15조제2항, 제22조; 영 제17조)이 명시되지 않아 동의 요건 충족 여부가 불명확함. 또한 권리행사 처리기한(10일)과 유출 통지·신고 기한(72시간)이 구체적으로 기재되지 않아 영 제41·43·44조, 제39·40조 준수 여부 확인이 곤란함.", "fix": "case_content의 첫 단락 끝에 다음 문장을 추가: \"지원서 제출 시 법 제15조제1항제1호에 따른 동의를 각각 구분하여(필수/선택 항목 구분) 받으며, 동의 요청 시 수집·이용 목적, 항목, 보유·이용 기간, 동의 거부 권리 및 거부에 따른 불이익을 명확히 고지하고(법 제15조제2항, 영 제17조), 선택 항목 미동의로 인한 서비스 제공 거부가 없음을 안내한다(법 제16조제2항·제3항). 동의는 홈페이지 지원서의 구분 동의 체크박스로 수령한다.\" 권리행사 단락에 다음을 보완: \"열람·정정·삭제·처리정지 및 동의 철회 요구에 대하여 접수일로부터 10일 이내 처리 및 결과 통지한다(영 제41조·제43조·제44조).\" 유출 대응 문장에 다음을 보완: \"유출 등을 알게 된 때부터 72시간 이내 정보주체 통지 및 관계기관 신고를 실시한다(영 제39조·제40조).\""}, {"aspect": "minimal_change", "issue": "원문에는 수탁사 처리 과정에서의 개인정보 유출 사실과 이후 시정조치·보고가 포함되어 있으나, 재작성본에서는 해당 사실 언급이 누락되어 사건 시나리오의 결과 부분이 불필요하게 변경됨.", "fix": "case_content의 마지막 단락 바로 앞에 다음 문장을 추가: \"과거 수탁사 처리 과정에서 응시자 개인정보가 외부로 유출된 사실을 확인하여, 재발 방지 대책을 수립·이행하고 그 결과를 관계 기관에 보고하였다.\""}]}}
{"case_id": "2023-012-127", "respondent": "피심인(회사명 비공개)", "case_content": "피심인(회사명 비공개)은 채용 단계의 평가 업무를 수탁사에 위탁하여 운영한다. 채용 평가는 지원서 기본정보(성명, 연락수단, 학력·경력 요약)와 평가에 필요한 과제 제출물만 수집하며, 불필요한 민감정보와 주민등록번호 등 고유식별정보는 수집하지 않는다. 첨부자료 업로드 시 주민등록번호, 계좌·카드번호 등 패턴을 서버에서 검사하여 포함된 경우 접수를 차단하고, 사전 마스킹 안내를 제공한다. 수집 시 수집·이용 목적, 수집 항목, 보유·이용 기간, 동의 거부 권리 및 불이익을 안내하고, 서면, 전자우편 또는 홈페이지 동의 화면 등으로 동의를 받는다. 동의 없이 처리할 수 있는 법적 근거를 적용하는 항목이 있는 경우 그 근거와 항목을 처리방침 및 안내 화면에 구분하여 공개한다.\n수탁사에는 평가 수행에 필요한 최소 항목만 제공하며, 전송 시 TLS 등 암호화 채널을 사용하고 저장 데이터는 암호화한다. 암호화 키는 분리 보관한다. 수탁사 사용자 계정은 개인별로 발급하고 역할 기반 최소권한과 다중인증을 적용한다. 원격 접속은 지정 IP로 제한하며, 개인정보처리시스템의 접속기록(접속 일시, 처리 내역 등)을 위변조 방지 기능과 함께 보관·점검한다. 악성코드 방지 프로그램을 설치·갱신하고 정기 취약점 점검 및 백업·복구 절차를 운영한다.\n운영 계약(위탁 계약서)에는 처리 목적·범위, 위탁업무 외 이용 금지, 재위탁 제한, 접근통제·암호화·로그관리 등 안전조치, 유사시 통지, 관리 현황 점검·감사 권한, 반환·파기 기준 및 방법, 교육 의무 및 수탁자의 의무 위반 시 책임에 관한 사항을 포함한다. 위탁 전 보안 적격성 평가를 실시하고, 위탁 기간 중 분기별 문서·원격 점검을 통해 권한 부여·변경 이력, 접속기록 관리, 파기 이행, 백업 관리 등을 확인하며, 개선사항은 기한을 부여해 이행 여부를 검증한다.\n채용 종료 후 합격자 외 지원자 정보는 정해진 기간(채용 종료 6개월) 보관 후 지체 없이 복구 불가능한 방식으로 파기하며, 전자파일은 영구 삭제, 서면 자료는 파쇄로 파기하고 파기 일시·방법·책임자를 기록한다. 합격자 정보는 인사자료와 분리 보관하고, 근로계약 체결 시 필요한 항목만 이관한다.\n정보주체 권리 행사를 위해 열람·정정·삭제·처리정지 및 동의 철회 창구를 제공하고, 신청·처리 절차를 홈페이지에 안내한다. 위탁하는 업무의 내용과 수탁자 명칭은 홈페이지에 상시 공개하고 변경 시 지체 없이 갱신한다. 개인정보 처리방침에는 수집 목적, 항목, 보유기간, 위탁 내역, 안전조치 및 권리 행사 방법을 명시하고 정기적으로 점검·갱신한다.\n과거 운영 계약에는 개인정보의 안전조치 및 보유·관리 현황 점검 등 감독 관련 조항이 구체적으로 포함되지 않았고, 교육·점검 절차 기준도 계약 단계에서 명시되지 않았다. 위탁 수행 과정에서 응시자의 개인정보가 외부로 유출된 사실이 확인되었고, 유출 사실 인지 즉시 접속경로 차단, 취약점 보완 및 유출 정보 회수·삭제 등 긴급 조치를 시행하고, 72시간 이내 정보주체에게 유출 항목, 시점·경위, 피해 최소화 방법, 대응조치, 문의처를 통지하며, 같은 기한 내 보호위원회 또는 한국인터넷진흥원에 신고한다. 이후 피심인은 통지에 따라 운영 계약(위탁 계약서)을 개정하여 상기 안전조치 조항과 수탁자 교육 및 처리 현황 점검 절차를 마련해 시행하고 있다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "개인정보의 안전성 확보조치 중 내부관리계획 수립·시행 및 물리적 보호조치(보관시설 잠금장치 등)에 대한 명시가 없어 시행령 제30조 제1항 제1호 및 제7호 충족 여부가 불분명함.", "fix": "case_content에 다음 문구를 추가: \"내부관리계획을 수립·시행·점검하고, 서류 및 저장매체는 잠금장치가 있는 보관시설에 보관하는 등 물리적 보호조치를 적용한다.\""}, {"aspect": "legality", "issue": "개인정보 처리방침 기재사항 중 법 제30조 제1항 제6호(개인정보 보호책임자의 성명 또는 관련 부서 및 연락처)에 대한 명시가 없음.", "fix": "case_content의 처리방침 항목 설명에 다음을 보강: \"개인정보 처리방침에는 개인정보 보호책임자의 성명(또는 개인정보 보호업무 부서 명칭)과 연락처를 포함한다.\""}, {"aspect": "legality", "issue": "유출 신고 부분이 모든 유출에 대해 일률적으로 72시간 이내 신고하는 것으로 표현되어 시행령 제40조의 신고 요건(1천명 이상, 민감/고유식별정보, 불법적 접근)에 대한 조건부 신고 원칙이 불명확함.", "fix": "해당 문장을 다음과 같이 구체화: \"유출 사실 인지 시 즉시 긴급 조치를 시행하고, 법령상 신고 대상 요건(1천명 이상, 민감정보·고유식별정보, 불법적 접근 등)에 해당하는 경우 72시간 이내 보호위원회 또는 한국인터넷진흥원에 신고한다.\""}]}}
{"case_id": "2023-012-120", "respondent": "피심인", "case_content": "채용 평가 업무를 위해 지원자 식별 최소 항목과 평가 자료만 수탁사의 전용 시스템에서 처리한다. 제공 항목은 성명, 연락처, 지원 직무, 경력·학력 요약, 제출 과제 및 평가 결과로 한정하며, 주민등록번호 등 고유식별정보와 민감정보는 수집하지 않는다. 파일 업로드 단계에서 고유식별정보 패턴을 탐지하여 포함 시 접수를 차단하고, 가림 처리 방법을 사전에 안내한다.\n데이터는 암호화된 채널로 전송하며 저장 시에도 암호화한다. 원본 서류와 평가 결과는 논리적으로 분리 저장하고, 암호키는 별도 영역에 분리 보관한다. 접근 권한은 평가 수행에 필요한 담당자로 최소화하며, 개인별 계정을 발급하고 강한 인증(예: 2단계 인증)을 적용한다. 권한 부여·변경·말소는 승인 절차로 관리하고, 업무 종료나 인사 변동 시 즉시 회수한다.\n접속기록(접속 일시, 사용자, 처리 내역, IP 등)은 위·변조 방지 방식으로 보관·점검한다. 개인정보처리시스템은 접근통제, 악성코드 방지, 취약점 점검을 주기적으로 수행하고, 보관 시설에 대한 잠금장치 등 물리적 통제를 적용한다.\n위탁은 서면 계약으로 체결하며 처리 목적·범위, 재위탁 제한, 안전조치, 사고 통지, 관리 현황 점검 및 교육, 반환·파기 기준을 포함한다. 수탁자의 처리 현황은 정기 점검과 증적 확보(점검보고서, 삭제 확인서 등)로 감독한다. 위탁하는 업무의 내용과 수탁자는 홈페이지에 상시 공개하고, 변경 시 갱신한다.\n보존기간은 채용 절차 종료 후 내부 기준에 따라 최소 기간으로 설정하며, 기간 도래 시 자동 파기한다. 전자파일은 복구 불가능한 방식으로 삭제하고, 서면은 파쇄 또는 소각한다. 법령에 따라 보존이 필요한 경우에는 해당 자료를 다른 개인정보와 분리하여 저장·관리하고 접근을 제한한다. 파기 이력과 결과는 기록하며, 백업본에도 동일한 기준을 적용한다.\n지원자는 열람·정정·삭제·처리정지 등의 요구를 전용 창구로 신청할 수 있으며, 본인 확인 후 정해진 절차와 기한에 따라 처리 결과를 통지한다. 채용 확정자의 경우 인사관리 목적에 필요한 항목만 별도 분리 이관하여 관리하고, 이용 목적과 보유기간 변경 사항을 안내한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "개인정보 수집·이용의 법적 근거 및 동의 고지 사항(법 제15조, 제22조; 시행령 제17조)이 명시되어 있지 않아 법·시행령 준수 여부를 텍스트만으로 확인하기 어렵습니다.", "fix": "첫 문단 1문장 뒤에 다음 문장을 추가하세요: \"지원서 접수 단계에서 개인정보의 수집·이용 목적, 항목, 보유·이용 기간, 동의 거부 권리 및 불이익을 포함한 사항을 안내하고 동의를 받는다.\""}, {"aspect": "legality", "issue": "시행령 제30조 제1항 제1호에 따른 '내부관리계획의 수립·시행 및 점검' 조치가 명시되어 있지 않습니다.", "fix": "세 번째 문단(접속기록 및 보안조치 문단) 맨 앞 또는 끝에 다음 문장을 추가하세요: \"개인정보의 안전한 처리를 위한 내부관리계획을 수립·시행하고 정기적으로 점검한다.\""}, {"aspect": "minimal_change", "issue": "원문은 채용 지원자 위탁 처리에 국한되어 있는데, REWRITTEN에는 채용 확정자 인사관리 이관 내용이 추가되어 업무 범위가 불필요하게 확장되었습니다.", "fix": "마지막 문단의 \"채용 확정자의 경우 인사관리 목적에 필요한 항목만 별도 분리 이관하여 관리하고, 이용 목적과 보유기간 변경 사항을 안내한다.\" 문장을 삭제하세요."}]}}
{"case_id": "2023-012-121", "respondent": "피심인", "case_content": "피심인은 채용 단계의 평가 업무 일부를 수탁사에 위탁한다. 지원자 정보는 평가에 필요한 최소 항목(성명, 연락수단, 지원자ID/지원분야, 이력서·경력, 과제·평가결과)만 수집·이용하며, 주민등록번호 등 고유식별정보와 민감정보는 수집하지 않는다. 제출 파일에 해당 정보가 포함되지 않도록 사전 안내하고, 서버에서 패턴 검사를 통해 검출 시 접수를 차단한다.\n수탁사에는 평가 수행에 필요한 데이터만 제공하며, 전송은 암호화 채널(TLS/SFTP/VPN)을 사용한다. 수탁사 시스템 저장 데이터는 암호화되며, 접근 권한은 평가 담당자에 한해 개인별 계정으로 최소권한으로 부여하고 다중인증, IP/시간대 제한, 권한 부여·변경·말소 절차를 운영한다. 개인정보처리시스템의 접속기록(접속일시, 처리내역 등)은 위·변조 방지 조치 하에 보관·점검한다. 악성코드 방지, 취약점 점검, 물리적 출입통제 등 기술·관리·물리적 보호조치를 적용한다.\n위탁은 문서로 체결하며, 처리 목적·범위, 접근 권한과 제한, 재위탁 제한(사전 서면승인), 보안 통제(암호화·접근통제·로그·악성코드 대응), 사고 통지·신고, 관리현황 점검·감사 권한, 반환·파기 방법·기한, 책임·손해배상 등을 포함한다. 수탁자에 대한 보안·개인정보보호 교육을 정기 실시하고, 분기별 권한 점검, 정기(또는 필요 시 수시) 원격/현장 점검과 취약점 점검 결과 확인 및 개선 이행을 관리한다. 위탁업무의 내용과 수탁자 현황은 홈페이지에 상시 공개한다.\n지원자 정보는 채용 절차 진행 및 결과 통지 목적 범위 내에서만 이용한다. 채용 종료 후 정해진 기간이 도래하면 전자파일은 복구 불가능한 방식으로 삭제하고, 종이 서류는 파쇄·소각한다. 법령상 보존이 필요한 자료는 다른 개인정보와 분리하여 접근을 제한하고 보존한다. 인재풀 보관은 별도 선택 동의를 받은 경우에 한해 별도 저장소에 분리 보관하며, 미동의에 따른 불이익이 없고, 동의는 언제든 철회할 수 있다. 파기·분리보관 및 권한 변경·말소 이력은 기록한다.\n정보주체 권리(열람, 정정·삭제, 처리정지, 동의 철회) 행사를 위한 전용 창구를 운영하며, 전자적 방법으로 접수·처리한다. 추가 이용·제공이 필요한 경우에는 목적 관련성, 정보주체 영향, 암호화 등 안전조치 가능성 등을 내부 기준에 따라 검토·기록하고 필요한 경우 별도 동의를 받아 진행한다. 유출 징후 모니터링, 이상 탐지 시 차단·원인 분석·재발 방지 조치와 함께 정보주체 통지 및 전문기관 신고 절차를 운영한다. 국외 이전은 하지 않으며, 불가피한 경우 이전 항목, 국가, 이용 목적·기간 등 필요한 사항을 사전 안내하고 보호조치를 이행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "개인정보 수집·이용의 법적 근거와 동의 고지사항(목적, 항목, 보유기간, 거부권 및 불이익)이 명시되어 있지 않아 법 제15조제1항 및 제15조제2항 충족 여부가 불명확함.", "fix": "첫 단락 말미 또는 별도 문장으로 다음을 추가: \"지원자 개인정보의 수집·이용은 법 제15조제1항제1호(동의) 또는 제15조제1항제4호(계약 체결 과정에서 정보주체 요청에 따른 조치 이행)에 근거하여 수행한다. 동의를 받는 경우 수집·이용 목적, 수집 항목, 보유·이용 기간, 동의 거부 권리 및 거부 시 불이익 유무를 사전에 알리고 동의를 받는다.\""}, {"aspect": "legality", "issue": "법 제29조 및 시행령 제30조의 요구사항 중 '내부관리계획 수립·시행·점검'이 명시적으로 나타나지 않음.", "fix": "보안통제 기술·관리조치 서술 부분에 다음을 추가: \"법 제29조 및 시행령 제30조에 따른 내부관리계획을 수립·시행·정기 점검하며, 개인정보취급자 관리·감독 및 교육, 권한부여·변경·말소 기준, 접근통제·암호화·접속기록 관리 등 세부 절차를 운영한다.\""}, {"aspect": "legality", "issue": "유출 통지·신고의 기한 및 신고기관이 특정되지 않아 시행령 제39조(72시간 통지) 및 제40조(72시간 신고) 충족이 불명확함.", "fix": "유출 대응 문단에 다음을 추가: \"개인정보 유출 등 사실을 알게 된 때에는 72시간 이내에 정보주체에게 통지하고, 1천명 이상 유출, 민감/고유식별정보 유출 또는 불법접근에 의한 유출의 경우 72시간 이내 보호위원회 또는 한국인터넷진흥원(KISA)에 신고한다.\""}, {"aspect": "legality", "issue": "국외 이전은 원칙적으로 미실시라고 하나, 불가피한 경우의 사전 안내 항목이 법 제28조의8제2항 및 시행령 제29조의7·제29조의10의 구체 요건을 모두 포괄하지 않음.", "fix": "국외 이전 관련 문장를 다음과 같이 구체화: \"국외 이전은 하지 않으며, 불가피한 경우에는 이전 전 다음 사항을 서면 또는 전자우편 등으로 사전 안내하고 필요 보호조치를 이행한다: (1) 이전되는 개인정보 항목, (2) 이전 국가, 시기 및 방법, (3) 이전받는 자의 명칭 및 연락처, (4) 이용 목적 및 보유·이용 기간, (5) 이전 거부 방법·절차 및 거부의 효과. 또한 법 제28조의8제4항 및 시행령 제29조의10에 따른 안전조치, 고충처리·분쟁해결 조치를 계약에 반영한다.\""}]}}
{"case_id": "2023-012-126", "respondent": "피심인", "case_content": "피심인은 채용 단계의 평가 업무 일부를 수탁사에 위탁하여 수행한다. 지원자 식별 및 평가 진행에 필요한 최소 항목(지원자 ID, 성명, 연락수단, 지원 직무, 평가 결과 요약 등)만 수탁사에 제공하며, 주민등록번호·금융정보 등 불필요한 정보는 수집하지 않는다. 제출 문서에 고유식별정보가 포함되지 않도록 사전 안내하고, 업로드 파일에 해당 패턴이 탐지되면 접수를 차단한다.\n전송은 암호화 채널로 수행하고, 저장 데이터는 암호화한다. 수탁사 접근 권한은 평가 담당자로 최소화하며, 개인별 계정과 다단계 인증을 사용한다. 개인정보처리시스템의 접속기록(접속일시, 처리내역 등)을 보관하고 위조·변조 방지조치를 적용한다. 악성코드 예방 프로그램을 운영·갱신하고, 물리적 보관구역에는 잠금장치를 설치한다.\n위탁 계약은 처리 목적과 범위, 재위탁 제한, 접근권한 관리, 암호화 등 안전조치, 사고 통지, 접속기록 보관, 점검·교육, 반환·파기 절차 및 책임을 포함한 문서로 체결한다. 수탁사에 대한 정기 교육과 처리현황 점검을 실시하고, 점검 결과에 따른 개선 이행 여부를 확인한다. 위탁하는 업무 내용과 수탁자 명칭은 홈페이지에 상시 공개하고, 변경 시 고지한다.\n채용 절차가 종료되면 정한 보존기간 내에서 필요한 범위로만 보관하고, 기간 만료 시 지체 없이 복구 불가능한 방법으로 파기한다. 법령에 따라 보존이 필요한 경우에는 다른 정보와 분리 보관한다. 사고 대응 절차를 마련하여 유출 인지 시 통지·신고 및 피해 최소화 조치를 수행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "위탁 계약 조항에서 법 제26조제1항제1호(위탁업무 목적 외 처리 금지)가 문구로 명시되지 않았습니다. 현재는 '처리 목적과 범위'만 적시되어 있어 목적 외 이용 금지 의무가 계약상 명확하지 않습니다.", "fix": "다음 문구를 위탁 계약 조항 문장에 추가하십시오: '위탁업무 수행 목적 외 개인정보 처리 금지, 수탁자의 제3자 제공 금지, 재위탁 시 위탁자 사전 동의'. 예: '위탁 계약은 처리 목적과 범위, 위탁업무 수행 목적 외 개인정보 처리 금지, 재위탁 제한(재위탁 시 위탁자 사전 동의), 수탁자의 제3자 제공 금지, 접근권한 관리, 암호화 등 안전조치, 사고 통지, 접속기록 보관, 점검·교육, 반환·파기 절차 및 책임을 포함한 문서로 체결한다.'"}, {"aspect": "minimal_change", "issue": "원문에는 채용 과정에서 개인정보 유출 사실이 확인되었다는 사실관계가 포함되어 있으나, REWRITTEN에서는 해당 사실이 삭제되었습니다. 또한 '평가 업무 일부를'로 표현을 바꾸어 원문의 업무 범위(평가 업무 전반 위탁)와 다르게 보일 수 있습니다.", "fix": "불필요한 의미 변경을 줄이기 위해 다음과 같이 수정하십시오. 1) 첫 문장을 '피심인은 채용 단계의 평가 업무를 수탁사에 위탁하여 수행한다.'로 변경(‘일부’를 삭제). 2) 원문 사실관계를 객관적으로 유지하는 문장을 말미에 추가: '과거 채용 과정에서 응시자 개인정보 유출 사실이 확인된 바 있다.'"}]}}
{"case_id": "2023-012-133", "respondent": "피심인", "case_content": "피심인은 채용 단계의 평가 일부를 수탁사에 위탁한다. 지원 접수 단계에서 평가에 필요한 최소 항목(성명, 연락수단, 지원 직무, 경력·이력 요약, 평가 결과)만 수집·전송하며, 주민등록번호 등 고유식별정보와 민감정보는 수집하지 않는다. 데이터는 전송 구간을 암호화하고, 수탁사 시스템 저장 시에도 암호화한다. 접근 권한은 평가 담당자에게만 개인별 계정으로 부여하고 다중인증을 적용하며, 권한은 단계별로 부여·만료한다. 수탁사 시스템의 접속기록을 보관하고 위변조 방지 조치를 적용한다. 악성코드 방지 프로그램을 운영하고, 물리적 출입 통제를 시행한다.\n위탁 계약에는 처리 목적·범위, 재위탁 제한, 접근통제·암호화 등 안전조치, 접속기록 관리, 사고 통지 및 대응, 교육, 정기 점검과 현장 감사 권한, 데이터 반환·파기 절차와 검증, 책임 및 손해배상 조건을 포함한다. 재위탁이 필요한 경우 사전 동의를 받으며 동일한 보안수준을 준수하도록 한다. 위탁하는 업무 내용과 수탁자 명칭·연락처는 홈페이지와 개인정보 처리방침에 지속 공개한다. 수탁사 감독은 보안점검표 제출, 로그·취약점 조치 결과 확인 등으로 정기 수행하고, 결과를 기록한다.\n보존기간은 채용 종료 후 내부 기준에 따라 최소 기간으로 설정하고, 기간 도래 시 자동 파기하며 파기 이력을 남긴다. 법령상 보존 사유가 있는 경우에는 다른 정보와 분리 보관한다. 향후 채용 안내 등 추가 이용은 별도 선택 동의를 받아 별도 저장소에 분리 보관하며, 미동의 시 기본 서비스 이용에 영향이 없도록 한다. 정보주체의 열람·정정·삭제·처리정지 및 동의 철회 요청을 위한 창구를 운영하고, 내부관리계획에 따라 권한관리, 접속통제, 암호화, 로그 점검 등 안전조치를 주기적으로 점검한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 3}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "업무 범위를 원 사례의 ‘평가 업무 위탁’에서 ‘평가 일부 위탁’으로 불필요하게 변경하여 시나리오가 축소됨.", "fix": "문장 교체: “피심인은 채용 단계의 평가 일부를 수탁사에 위탁한다.”를 “피심인은 채용 단계의 평가 업무를 수탁사에 위탁한다.”로 수정."}, {"aspect": "minimal_change", "issue": "원 사례에 없던 추가 목적(‘향후 채용 안내 등 추가 이용’)을 도입하여 불필요하게 사업 범위를 확장함.", "fix": "해당 문장 전체 삭제: “향후 채용 안내 등 추가 이용은 별도 선택 동의를 받아 별도 저장소에 분리 보관하며, 미동의 시 기본 서비스 이용에 영향이 없도록 한다.”를 삭제."}, {"aspect": "minimal_change", "issue": "‘지원 접수 단계에서 … 평가 결과’를 수집·전송한다고 기재하여, 평가 결과가 접수 단계에서 생성·수집되는 것으로 업무 흐름이 변경됨.", "fix": "문장 분리·수정: “지원 접수 단계에서 평가에 필요한 최소 항목(성명, 연락수단, 지원 직무, 경력·이력 요약, 평가 결과)만 수집·전송하며,”를 “지원 접수 단계에서는 평가에 필요한 최소 항목(성명, 연락수단, 지원 직무, 경력·이력 요약)만 수집·전송한다. 평가 결과는 평가 수행 과정에서 수탁사 시스템에서 생성·처리되어 위탁자에게 제공된다.”로 수정."}]}}
{"case_id": "2023-012-134", "respondent": "피심인(기업명 비공개)", "case_content": "피심인(기업명 비공개)은 채용 단계의 평가 업무를 외부 수탁사에 위탁한다. 지원 접수 시 평가에 필요한 최소 항목(성명, 연락수단, 지원 직무, 경력 요약, 과제·시험 결과)만 수집하며, 주민등록번호 등 고유식별정보와 민감정보는 수집하지 않도록 안내하고, 업로드 자료에 해당 정보가 포함될 경우 접수를 차단한다. 수탁사 제공 데이터는 전송 시 암호화 채널을 사용하고, 제공 목록을 사전 검토하여 불필요 항목을 제외하며, 식별정보와 평가자료는 분리된 저장소에 보관한다. 저장 데이터는 암호화하고, 접근 권한은 평가 수행에 필요한 인원으로 최소화하며 개인별 계정을 사용한다. 개인정보처리시스템 접근은 권한부여·변경·말소 절차에 따라 관리하고, 접속기록을 보관·점검하며 위변조 방지 조치를 적용한다. 악성코드 방지 프로그램을 운영·갱신하고, 문서·매체는 잠금장치가 있는 장소에 보관한다. 위탁 계약에는 처리 목적·범위, 재위탁 제한, 접근권한 관리, 암호화·접근통제·로그관리 등 안전조치, 관리 현황 점검·감독, 사고 통지, 반환·파기, 보유·이용기간, 손해배상 책임을 포함하며, 재위탁은 사전 승인 절차를 따른다. 수탁자 교육을 정기 실시하고, 서면 점검과 시스템 점검을 포함한 감독을 수행하며 개선 요청과 이행 확인을 기록한다. 위탁하는 업무 내용과 수탁자 현황은 홈페이지에 상시 공개한다. 채용 절차 종료 후 내부 기준이 도래하면 목적 달성 자료는 지체 없이 파기하며, 전자파일은 복구 불가능한 방식으로 삭제하고, 서면은 파쇄 또는 소각한다. 다른 법령에 따라 보존이 필요한 경우에는 해당 정보만 분리 보관하고, 보존 사유 해소 시 파기한다. 유출 통지·신고 및 피해 최소화 조치 등 대응 절차를 마련하고, 열람·정정·삭제·처리정지 등 권리행사 창구를 운영한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "위탁 계약 조항에 법 제26조 제1항 제1호의 핵심 요소(위탁업무 목적 외 개인정보 처리 금지)가 명시적으로 기재되어 있지 않음.", "fix": "case_content의 위탁 계약 항목 나열 부분에 다음 문구를 추가: \"위탁업무 수행 목적 외 개인정보의 처리 금지\" 또는 문장 예: \"수탁자는 위탁업무 수행 목적 외로 개인정보를 처리하지 않는다.\""}, {"aspect": "legality", "issue": "개인정보 수집의 법적 근거 및 동의 고지사항(목적, 항목, 보유·이용기간, 동의 거부권 및 불이익 안내 등)에 대한 명시가 없어 법 제15조 제1항, 제2항 및 제22조 제1항·제2항 준수 여부가 불명확함.", "fix": "case_content의 \"지원 접수 시\" 문단 초반에 다음 문장을 추가: \"지원 접수 시 개인정보 수집·이용 목적, 수집 항목, 보유·이용기간, 동의 거부권 및 거부에 따른 불이익을 알리고 전자적 방식으로 동의를 받는다.\""}]}}
{"case_id": "2023-012-117", "respondent": "㈜비에스씨", "case_content": "㈜비에스씨는 채용 인적성 검사를 위해 자체 개발 시스템을 운영한다. 지원자 식별 최소 항목(성명, 지원 ID, 연락수단)과 시험 일정, 응시 이력, 평가 결과만 수집하며, 주민등록번호 등 고유식별정보와 불필요한 민감정보는 수집하지 않는다. 수집·전송 구간은 TLS로 암호화하고, 데이터는 데이터베이스에 저장 시 암호화한다. 식별정보와 평가 결과는 논리적으로 분리 보관하며, 매핑 키는 별도 저장소에 분리하여 관리한다.\n관리자페이지는 외부에서 직접 접근할 수 없도록 VPN 및 허용 IP 기반으로 제한하고, 개인별 계정·다단계 인증·역할 기반 권한으로 최소권한을 부여한다. 세션 타임아웃과 비정상 접속 차단을 적용한다. 크롤러 노출 방지를 위해 인증 없는 경로는 제공하지 않고, noindex 헤더 및 robots 차단을 적용한다. 개인정보처리시스템과 관리자페이지 접속기록(계정, 일시, 원격 IP, 조회·변경·다운로드 내역)은 위변조 방지 저장소에 보관·점검한다.\n파일 다운로드는 기본 차단하며, 불가피한 경우에만 사전 승인 후 암호화된 파일로 제한한다. 다운로드 파일에는 워터마크·만료 설정을 적용하고, 반출 사유·대상을 기록한다. 악성코드 방지 프로그램 운영, 정기 취약점 점검·패치 관리, 웹 방화벽 및 접근통제 정책을 적용한다.\n보유기간은 채용 종료 후 정해진 기간으로 설정하고, 기간 도래 시 운영 DB와 로그, 백업본에서 일괄·자동 파기한다. 전자 데이터는 복구 불가능한 방식으로 삭제하고, 백업은 순차 삭제한다. 다른 근거로 보존이 필요한 경우에는 본 데이터와 분리 저장하고 접근을 제한한다. 파기 계획·결과는 기록한다.\n외부 클라우드 등 인프라를 이용하는 경우 처리 범위, 재위탁 제한, 암호화·권한관리·접속기록 보관, 사고 통지, 반환·파기 절차를 포함한 위탁계약을 체결하고, 정기 점검으로 이행 여부를 확인한다.\n지원자 권리 행사(열람, 정정·삭제, 처리정지, 동의 철회)를 위한 채널을 운영하고 본인 확인 후 기한 내 처리한다. 개인정보 노출 등 사고에 대비해 통지·신고, 차단·회수 및 재발 방지 절차를 마련한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 2}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "핵심 운영 시나리오(관리자페이지에서 엑셀 파일 형태로 저장·관리)가 DB 중심 저장 및 다운로드 기본 차단으로 변경되어 원 사안의 업무 흐름이 불필요하게 달라졌습니다.", "fix": "case_content에 엑셀 기반 관리 방식을 유지하면서 보안 통제를 추가하도록 문구를 조정하세요. 예시 수정: 1) 첫 문단 두 번째 문장 뒤에 다음을 추가: \"또한 관리자페이지에서 엑셀 파일 형태로 생성·저장하여 관리한다.\" 2) \"데이터는 데이터베이스에 저장 시 암호화한다. 식별정보와 평가 결과는 논리적으로 분리 보관하며, 매핑 키는 별도 저장소에 분리하여 관리한다.\"를 다음으로 교체: \"데이터는 데이터베이스에 저장 시 암호화하고, 관리자페이지에서 생성·저장되는 엑셀 파일은 AES-256으로 암호화하여 내부 스토리지에 저장한다. 식별정보와 평가 결과는 엑셀 내 분리 시트로 관리하며, 매핑 키는 별도 저장소에 분리하여 관리한다.\" 3) \"파일 다운로드는 기본 차단하며, 불가피한 경우에만 사전 승인 후 암호화된 파일로 제한한다.\"를 다음으로 교체: \"엑셀 파일 다운로드 기능은 유지하되, 사전 승인 후 암호화된 파일로만 다운로드하도록 제한하고, 다운로드 사유·대상자를 기록한다.\""}, {"aspect": "minimal_change", "issue": "violated_articles를 공란([])으로 변경하여 원 사안의 법령 조항 정보가 불필요하게 삭제되었습니다.", "fix": "violated_articles를 원본과 동일하게 복원하세요. 예시: \"violated_articles\": [\"개인정보 보호법 제21조\", \"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제30조\"]"}]}}
{"case_id": "2023-012-124", "respondent": "피심인", "case_content": "채용 단계의 평가 업무는 수탁사에 위탁하여 처리한다. 지원서 접수 시 채용 심사 목적, 보유 기간, 위탁 사실(업무 범위·수탁자)을 고지하고 동의를 받는다. 수집 항목은 최소화하여 성명 또는 지원자 ID, 연락수단, 지원 직무 관련 경력·학력 요약, 과제 제출물, 포트폴리오 링크 등으로 한정하며, 주민등록번호 등 고유식별정보와 민감정보는 원칙적으로 수집하지 않는다. 수탁사에는 평가에 필요한 항목만 제공하며, 전송은 암호화 채널(TLS)로, 저장은 데이터베이스·파일 수준 암호화로 보호한다. 접근 권한은 평가 담당자에게 최소한으로 부여하고, 개인별 계정을 발급하여 다단계 인증을 적용한다. 개인정보처리시스템의 접속기록을 생성·보관하고 위변조 방지 조치를 적용하며, 악성코드 방지와 취약점 점검을 주기적으로 수행한다. 위탁 계약은 문서로 체결하고 처리 목적·범위, 목적 외 이용 금지, 재위탁 제한과 사전 승인, 암호화·접근통제 등 안전조치, 사고 통지, 점검·보고, 반환·파기 절차, 손해배상 책임을 포함한다. 수탁사가 재위탁이 필요한 경우 사전 동의를 받도록 하며, 위탁 범위나 수탁자 변경 시 사전 안내한다. 위탁하는 업무의 내용과 수탁자 명칭은 홈페이지 등에 상시 공개한다. 수탁사에 대한 보안·개인정보 보호 교육을 실시하고, 정기 점검으로 처리 현황과 통제를 확인한다. 권한 부여·변경·말소 이력과 점검 결과는 기록·보관하며, 이상 징후 발견 시 즉시 조치하고 통지 절차에 따른다. 평가 데이터는 채용 종료 후 사전에 고지한 기간에 따라 자동 삭제하고, 삭제 이력은 보관한다. 최종 합격자의 필수 인사정보만 별도 승인 절차를 거쳐 인사 시스템으로 이관하며, 채용 목적 외 이용·제공은 차단한다. 법령에 따른 보존 사유가 있는 경우에는 그 기간 동안 다른 정보와 분리하여 저장·관리한다. 서면자료는 잠금구역에 보관하고 보존기간 만료 시 파쇄 또는 소각한다. 정보주체 권리행사(열람, 정정, 삭제, 처리정지) 창구를 운영하며, 요청 접수 시 정해진 기한 내 처리한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "동의 고지 항목 중 법 제15조제2항 및 시행령 제17조에서 요구하는 ‘동의를 거부할 권리’와 ‘거부 시 불이익’ 안내가 명시되어 있지 않음.", "fix": "case_content의 동의 고지 문장에 다음을 명시적으로 추가: \"동의는 거부할 수 있으며, 필수 정보에 대한 동의를 하지 않는 경우 지원 절차 진행이 제한될 수 있고, 선택 정보 미동의에 따른 불이익은 없습니다.\" 예시 수정: \"지원서 접수 시 채용 심사 목적, 보유 기간, 위탁 사실(업무 범위·수탁자), 수집 항목, 동의를 거부할 권리 및 거부 시 불이익 유무를 고지하고 동의를 받는다.\""}, {"aspect": "legality", "issue": "전자적 파일 파기 방법이 시행령 제16조의 ‘복원이 불가능한 방법으로 영구 삭제’ 수준으로 명시되지 않음.", "fix": "case_content의 파기 부분을 다음과 같이 보완: \"평가 데이터는 채용 종료 후 사전에 고지한 기간에 따라 자동 삭제하고, 전자적 파일은 복원이 불가능한 방법으로 영구 삭제하며(기술적 특성상 곤란한 경우 법 제58조의2 해당 정보로 처리), 삭제 이력은 보관한다.\""}]}}
{"case_id": "2023-012-123", "respondent": "피심인", "case_content": "피심인은 채용 단계의 평가 업무를 수탁사에 위탁하고, 채용 평가를 위해 접수된 지원서 등의 개인정보를 수탁사에 제공한다. 처리 항목은 최소 범위(성명, 연락수단, 지원분야, 지원서 및 과제 파일)로 한정하며, 주민등록번호 등 고유식별정보와 민감정보는 수집하지 않는다. 수탁사는 위탁 범위 내에서 제공받은 정보를 보관·처리한다. 지원자에게 수집·이용 목적, 수집 항목, 보유 및 이용 기간, 동의 거부권과 불이익을 알리고 동의를 받으며, 계약 체결을 위한 사전 절차 등 필요한 사유가 있는 경우에는 해당 사유에 따라 처리한다. 위탁 수행 과정에서 주고받는 전자적 자료는 암호화된 채널을 사용한다. 수탁사 시스템에 저장되는 데이터는 암호화하고, 접근 권한은 평가 담당자에게만 개인별 계정으로 부여하며 다중인증과 권한 분리를 적용한다. 접속기록은 위변조 방지 조치와 함께 보관·점검한다. 악성코드 방지 프로그램을 설치·갱신하고 취약점 점검을 수행하며, 보관시설 출입 통제 등 물리적 보호조치를 적용한다. 위탁 계약서에는 처리 목적·범위, 재위탁 제한, 접근 제한 및 암호화 등 안전조치, 사고 통지, 교육, 관리 현황 점검, 반환·파기 절차 및 책임을 포함한다. 위탁 개시 전 보안 적합성 평가를 실시하고, 수행 중 정기 점검과 교육을 진행하며, 결과 보고서와 개선 이력을 관리한다. 위탁하는 업무와 수탁자 목록은 개인정보 처리방침과 홈페이지에 상시 공개한다. 채용 목적 달성 또는 보유기간 경과 시 지체 없이 해당 항목을 자동 삭제하고, 다른 규정에 따라 보존이 필요한 정보는 분리 보관한다. 전자파일은 복구 불가능한 방법으로 삭제하고, 종이 문서는 파쇄한다. 담당자 이동·퇴직 시 권한을 즉시 변경·말소하며, 재위탁은 사전 승인 절차를 거친다. 목적 외 이용·제공은 금지하며, 예외적으로 정보주체의 별도 동의 또는 관련 규정상 허용 사유가 있는 경우에 한하여 내부 심사·기록 후 처리한다. 지원자는 전용 창구를 통해 열람·정정·삭제·동의 철회 등을 신청할 수 있다. 사고 발생 시에는 정해진 기한과 방법으로 통지·신고하고 원인 분석 및 재발 방지 조치를 수행한다. 과거 위탁 수행 중 수탁사 측에서 개인정보 유출이 발생하여 통지·신고 및 조사와 자료 제출을 완료하였다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "원문은 유출 관련 조치가 ‘신고되어 조사와 자료 제출이 진행되었다’고 서술했으나, 재작성본은 ‘통지·신고 및 조사와 자료 제출을 완료하였다’로 시점을 변경하여 불필요한 시나리오 변화가 발생함.", "fix": "재작성본 말미 문장을 다음과 같이 수정: \"과거 위탁 수행 중 수탁사 측에서 개인정보 유출이 발생하여 통지·신고되었고, 조사와 자료 제출이 진행되었다.\""}, {"aspect": "minimal_change", "issue": "원문은 수탁사가 채용 단계에서 개인정보를 ‘수집·보관·처리’한다고 했으나, 재작성본은 ‘보관·처리’로 축소되어 수탁사의 수집 가능성 서술이 불필요하게 변경됨.", "fix": "수탁사 처리 범위 문장을 다음과 같이 수정: \"수탁사는 위탁 범위 내에서 제공받은 정보 또는 지원자 포털을 통해 수집한 정보를 보관·처리한다.\""}]}}
{"case_id": "2023-012-136", "respondent": "피심인(회사명 비공개)", "case_content": "채용 평가 업무를 ㈜(수탁사명 비공개)에 위탁하고, 지원자 식별 최소 항목(성명, 연락처, 지원 직무)과 제출 서류, 평가 결과만 수탁사 전용 시스템에서 처리한다. 전송은 암호화 채널을 사용하고 저장 데이터는 암호화한다. 주민등록번호 등 불필요한 고유식별정보는 수집하지 않으며, 첨부파일 업로드 시 패턴 검사를 통해 해당 정보가 포함되면 접수를 차단한다. 수탁사 환경에서는 평가 담당자에게만 최소 권한으로 개별 계정을 부여하고, 권한 부여·변경·말소 절차를 운영한다. 접근기록을 보관·점검하고 위변조 방지 조치를 적용한다. 평가자료와 식별정보는 논리적으로 분리 보관하며, 악성코드 방지 등 보안 프로그램을 운영한다.\n\n위탁 계약은 문서로 체결하며 위탁 범위·목적, 재위탁 제한, 접근통제·암호화·접속기록 등 안전조치, 사고 통지, 관리현황 점검 및 교육, 반환·파기 절차, 손해배상 책임을 포함한다. 수탁사의 재위탁은 사전 서면 동의를 받도록 하고, 계약 이행과 보안 통제는 정기 점검한다. 위탁하는 업무의 내용과 수탁자 정보는 회사 홈페이지에 상시 공개한다.\n\n채용 절차 운영에 필요한 기간 동안만 데이터를 보관하며, 보존기간이 경과하거나 목적이 달성되면 전자파일은 복구 불가능한 방식으로 영구 삭제하고 서면은 파쇄한다. 삭제 이력과 위탁 종료 시 반출·반환·파기 결과를 기록한다. 내부관리 절차에 따라 계정 발급·회수, 권한 검토, 접속기록 점검을 수행한다. 지원자는 열람, 정정, 삭제, 처리정지 요구 등 권리를 행사할 수 있으며, 별도 동의가 있는 경우에 한해 향후 채용을 위한 인재풀 보관을 선택할 수 있고 이 경우 정보는 분리 보관된다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "위탁 계약 조항에 법 제26조 제1항 제1호의 ‘위탁업무 수행 목적 외 처리 금지’가 명시적으로 기재되어 있지 않음.", "fix": "다음 문구를 명시적으로 포함하도록 수정: 기존 문장 “위탁 계약은 문서로 체결하며 위탁 범위·목적, 재위탁 제한, 접근통제·암호화·접속기록 등 안전조치, 사고 통지, 관리현황 점검 및 교육, 반환·파기 절차, 손해배상 책임을 포함한다.”를 “위탁 계약은 문서로 체결하며 위탁 범위·목적 및 목적 외 처리 금지, 재위탁 제한, 접근통제·암호화·접속기록 등 안전조치, 사고 통지, 관리현황 점검 및 교육, 반환·파기 절차, 손해배상 책임을 포함한다.”로 변경."}, {"aspect": "legality", "issue": "재위탁 동의 주체가 불명확하여 법 제26조 제6항(위탁자의 동의 필요)의 취지를 명확히 담지 못함.", "fix": "해당 구절을 다음과 같이 명확화: “수탁사의 재위탁은 사전 서면 동의를 받도록 하고”를 “수탁사의 재위탁은 위탁자의 사전 서면 동의를 받도록 하고”로 변경."}, {"aspect": "minimal_change", "issue": "인재풀(향후 채용 목적의 별도 보관) 항목이 원래 시나리오에 없던 새로운 처리 목적을 추가하여 불필요한 범위 확장을 초래함.", "fix": "해당 문장을 삭제하여 원 시나리오 범위로 환원: “지원자는 열람, 정정, 삭제, 처리정지 요구 등 권리를 행사할 수 있으며, 별도 동의가 있는 경우에 한해 향후 채용을 위한 인재풀 보관을 선택할 수 있고 이 경우 정보는 분리 보관된다.” 중 ‘별도 동의가 있는 경우에 한해 향후 채용을 위한 인재풀 보관을 선택할 수 있고 이 경우 정보는 분리 보관된다.’ 부분을 삭제. 대안으로, 범위 외임을 명시하려면 “인재풀 보관 등 별도 목적 처리는 본 위탁 범위에 포함하지 않는다.”로 교체."}]}}
{"case_id": "2023-012-136", "respondent": "피심인(회사명 비공개)", "case_content": "채용 평가 업무를 수탁사에 위탁하여 운영한다. 지원 접수 시 평가에 필요한 최소 항목(지원자 식별자, 연락수단, 경력·자격 요약, 평가 자료)을 수집하며, 주민등록번호 및 민감정보는 수집하지 않는다. 지원 접수 시 수집·이용 목적, 항목, 보유기간, 동의 거부권 및 거부에 따른 불이익을 알리고 동의를 받거나, 계약 체결·이행에 필요한 범위에서 처리한다. 제출 파일에는 고유식별정보가 포함되지 않도록 안내하고, 서버 측 패턴 검사를 통해 해당 정보가 탐지되면 접수를 차단한다. 수집 정보는 암호화된 채널로 수탁사 전용 평가시스템에 전송되며 저장 시 암호화되고, 암호키는 분리 보관한다. 접근 권한은 역할 기반으로 평가 담당자 등 최소 인원에게만 부여하고, 개인별 계정과 다중인증을 적용한다. 접속기록(접속일시, 처리내역 등)은 무결성 보호와 함께 보관·점검하며, 외부 반출은 사전 승인 및 기록을 거친다. 악성코드 예방 프로그램을 설치·운영하고 주기적으로 패치 및 취약점 점검을 수행한다. 개발·운영·평가 데이터는 분리 저장하며, 시험·운영 환경 간 데이터 반출은 승인 절차를 따른다. 위탁 계약에는 처리 목적·범위, 재위탁 제한 및 사전 동의, 안전조치 기준, 접근 권한 관리, 사고 통지 및 협력, 반환·파기 절차, 감독 및 손해배상 책임을 포함한다. 유출 등이 확인되면 72시간 이내 정보주체 통지 및 보호위원회(또는 전문기관) 신고를 포함한 대응 절차를 이행하고, 추가 확인 사항은 지체 없이 통지·신고한다. 위탁 사실과 수탁자 현황은 홈페이지에 상시 공개하고, 수탁사에 대한 정기 점검·감사를 실시하여 이행 여부를 확인하며 결과와 개선조치를 기록·보관한다. 위탁자와 수탁사의 개인정보취급자에 대해 정기적으로 필요한 교육을 실시하고 교육 이력을 관리한다. 평가 종료 후 정해진 보존기간 경과 시 본 시스템과 백업에서 복구 불가능한 방식으로 파기하고, 법령상 보존이 필요한 경우에는 해당 항목을 별도 분리보관 후 기한 만료 시 파기한다. 파기 이력과 위탁 종료 시 반환·파기 확인서를 보관한다. 지원자는 전용 창구를 통해 열람, 정정, 삭제, 처리정지, 동의 철회 요청을 할 수 있도록 하며, 자동화된 평가를 사용하는 경우 설명 요구 및 인적 개입 요청 경로를 제공한다. 개인정보 처리방침에 처리 목적, 항목, 보유기간, 위탁 및(해당 시) 국외 이전, 안전조치, 권리행사 방법을 공개하고 변경 시 고지한다. 처리 과정에서 응시자의 개인정보 일부가 외부로 노출된 사실이 확인되어, 72시간 이내 정보주체 통지 및 개인정보보호위원회 신고를 진행하였고, 시정조치 이행 결과를 제출하였다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 3}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "The violated_articles field was removed (set to an empty list), altering the original case outcome beyond handling/controls.", "fix": "Restore the original violated_articles array exactly as in ORIGINAL: \"violated_articles\": [\"개인정보 보호법 제26조\", \"개인정보 보호법 시행령 제28조\"]."}, {"aspect": "minimal_change", "issue": "The breach narrative was changed to assert specific 72-hour notifications and reporting, which introduces new facts not present in the original record.", "fix": "Replace the final breach sentence in case_content with the original neutral phrasing: \"처리 과정에서 응시자의 개인정보 일부가 외부로 노출된 사실이 유출신고를 통해 확인되었고, 개인정보보호위원회에 시정조치 이행 결과를 제출하였다.\""}, {"aspect": "minimal_change", "issue": "Added an unrelated feature about automated decision rights (자동화된 평가) that was not part of the original scenario.", "fix": "Delete the clause from case_content: \"자동화된 평가를 사용하는 경우 설명 요구 및 인적 개입 요청 경로를 제공한다.\""}]}}
{"case_id": "2023-012-131", "respondent": "피심인", "case_content": "피심인은 채용 단계의 평가 업무 일부를 수탁사에 위탁한다. 위탁을 위해 지원자 식별 최소 항목(성명 또는 지원자 ID, 연락수단)과 직무 적합성 판단에 필요한 평가 자료·결과만 제공하며, 주민등록번호 등 고유식별정보와 불필요한 첨부는 수집·전달하지 않는다. 파일 업로드 시 고유식별정보 패턴 검사를 통해 해당 정보가 포함된 자료는 접수를 차단하고, 가림 처리 안내를 제공한다. 데이터 전송은 암호화 채널을 사용하고 저장 데이터는 암호화한다. 접근 권한은 평가 담당자에게만 역할 기반으로 부여하며, 개인별 계정과 다단계 인증을 적용한다. 접속기록을 보관하고 위·변조 방지 조치를 적용하여 정기 점검한다. 악성코드 방지 프로그램을 운영하고 보안 패치를 주기적으로 적용한다. 종이 자료와 출력물은 잠금장치가 있는 장소에 보관하고 출입을 통제한다. 위탁 계약은 문서로 체결하며 처리 목적·범위, 재위탁 제한 및 사전 승인 절차, 접근권한 관리, 암호화·접속통제·로그관리 등 안전조치, 사고 통지 및 협력, 반환·파기 기준과 방법, 비밀유지, 교육 및 점검 권한, 손해배상 책임을 포함한다. 위탁 현황(업무 내용, 수탁자)은 홈페이지에 지속적으로 공개하고 변경 시 업데이트한다. 수탁자 감독은 사전 보안 적격성 평가, 정기 교육, 분기별 운영 점검 및 연 1회 이상 현장 또는 원격 감사를 통해 수행하며, 삭제 이행, 접근권한 부여·변경·말소, 재위탁 여부 등 핵심 통제 준수 증적을 제출받아 확인한다. 보관 기간은 채용 절차 진행 및 분쟁 대응에 필요한 최소 기간으로 설정하고, 기간 만료 또는 목적 달성 시 전자 파일은 복구 불가능한 방법으로 삭제하며 종이 자료는 파쇄 또는 소각한다. 다른 법령에 따른 보존이 필요한 경우에는 본 데이터와 분리하여 저장·관리하고, 삭제 및 분리보관 이력은 기록한다. 개인정보 침해가 의심되거나 확인될 경우 즉시 추가 유출 차단, 회수·삭제 등 긴급 조치를 시행하고, 정해진 기준에 해당하면 정보주체에게 신속히 통지하며 관계 기관에 신고한다. 통지에는 항목, 시점·경위, 피해 최소화 방법, 대응 및 연락처를 포함한다. 정보주체는 마련된 창구를 통해 열람, 정정·삭제, 처리정지 또는 동의 철회를 요청할 수 있으며, 본인 확인 후 정해진 기한 내 처리한다. 채용 목적과 무관한 목적 외 이용·제공은 하지 않으며, 목적과 합리적으로 관련된 범위를 벗어나는 경우에는 별도 동의를 받는다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "위탁 계약 조항에 법 제26조제1항제1호가 요구하는 ‘위탁업무 수행 목적 외 개인정보 처리 금지’ 문구가 계약 항목으로 명시되어 있지 않아, 법 및 시행령(제28조제1항)의 필수 기재사항 충족이 불명확함.", "fix": "다음 문장을 교체하여 ‘목적 외 처리 금지’를 계약 항목에 명시하십시오.\n- 기존: \"위탁 계약은 문서로 체결하며 처리 목적·범위, 재위탁 제한 및 사전 승인 절차, 접근권한 관리, 암호화·접속통제·로그관리 등 안전조치, 사고 통지 및 협력, 반환·파기 기준과 방법, 비밀유지, 교육 및 점검 권한, 손해배상 책임을 포함한다.\"\n- 수정: \"위탁 계약은 문서로 체결하며 위탁업무 수행 목적 외 개인정보 처리 금지, 처리 목적·범위, 재위탁 제한 및 사전 승인 절차, 접근권한 관리, 암호화·접속통제·로그관리 등 안전조치, 사고 통지 및 협력, 반환·파기 기준과 방법, 비밀유지, 교육 및 점검 권한, 손해배상 책임을 포함한다.\""}, {"aspect": "minimal_change", "issue": "원문에는 수탁사에서 응시자 개인정보 유출 사건이 있었음이 포함되어 있으나, 재작성본에서는 해당 사실이 삭제되어 시나리오의 핵심 맥락(과거 사고의 존재)이 불필요하게 변경됨.", "fix": "원문의 사실관계를 간단히 반영하는 문장을 초기 부분에 추가하십시오. 예: \"과거 수탁사 측에서 응시자 개인정보가 외부로 유출된 사건이 있었으며, 이를 계기로 아래의 감독 및 안전조치를 보강하여 적용한다.\""}]}}
{"case_id": "2023-012-130", "respondent": "피심인", "case_content": "채용 평가 일부를 수탁사(온라인 평가 플랫폼)에 위탁하여 운영한다. 응시자 식별 최소 항목(성명, 지원 ID, 연락처)과 평가 진행ㆍ결과에 필요한 정보만 수집하며, 업로드 서류에 주민등록번호 등 고유식별정보가 포함된 경우 패턴 검출로 접수를 차단하고 가림을 안내한다. 수탁사에는 사전에 정의한 범위의 데이터만 제공하며, 전송 구간은 암호화 통신을 사용하고 저장 데이터는 암호화한다. 접근 권한은 평가 업무 담당자로 최소화하고 개인별 계정과 다단계 인증을 적용하며, 권한 부여ㆍ변경ㆍ말소 절차와 주기적 점검을 운영한다. 수탁사 시스템의 접속기록(접속일시, 처리내역 등)은 보관ㆍ정기 점검하고 위변조 방지 조치를 한다. 위탁 계약서에는 처리 목적 및 범위, 재위탁 제한, 접근 제한 등 안전조치, 사고 통지와 대응, 관리 현황 점검ㆍ감독, 반환ㆍ파기 절차 및 책임을 포함한다. 위탁 개시 전 보안 적격성 평가를 실시하고, 계약 기간 동안 정기 점검과 개선 조치를 수행하며 교육을 요구한다. 채용 절차 종료 및 보존기간 만료 시 전자파일은 복구 불가능한 방식으로 삭제하고, 서면은 파쇄하며, 백업본도 동일 기준으로 삭제한다. 다른 법령에 따라 보존이 필요한 경우에는 본 데이터와 분리 보관하고 접근을 제한한다. 위탁 업무 내용과 수탁자 현황은 홈페이지에 상시 공개하고 변경 시 갱신한다. 악성코드 방지 프로그램을 운영ㆍ갱신하고, 물리적 보호구역 및 출입통제를 적용한다. 사고 징후 모니터링 체계를 유지하고, 사고 발생 시 내부 절차에 따라 통지ㆍ신고 및 추가 피해 방지 조치를 수행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "위탁 계약서 조항에 법 제26조 제1항 제1호가 요구하는 ‘위탁업무 수행 목적 외 개인정보 처리 금지’ 문구가 명시적으로 나타나지 않는다. 시행령 제28조의 항목들은 포함되어 있으나, 본 법 조항의 금지 항목이 계약서 내용으로 분명히 기재되어야 한다.", "fix": "다음 문장을 수정 또는 추가해 명시적으로 목적 외 처리 금지를 포함하세요. 수정안: \"위탁 계약서에는 처리 목적 및 범위, 위탁업무 수행 목적 외 개인정보 처리 금지, 재위탁 제한, 접근 제한 등 안전조치, 사고 통지와 대응, 관리 현황 점검ㆍ감독, 반환ㆍ파기 절차 및 책임을 포함한다.\" 추가 문장(선택): \"수탁사는 위탁받은 업무 범위를 초과하여 개인정보를 이용하거나 제3자에게 제공하지 않는다.\""}]}}
{"case_id": "2023-012-130", "respondent": "피심인", "case_content": "피심인은 채용 평가 업무의 일부를 수탁사에 위탁한다. 지원서 접수 단계에서 채용에 필요한 최소 항목(성명, 연락수단, 학력·경력, 평가 과제물)만 수집하며, 주민등록번호·계좌정보·건강정보 등 불필요한 민감·고유식별정보는 수집하지 않는다. 첨부파일 제출 시 고유식별정보가 포함되지 않도록 안내하고, 서버에서 패턴 검사를 통해 해당 정보가 탐지되면 접수를 차단한다. 수집 정보는 내부 채용 시스템에 저장되며, 평가 수행에 필요한 항목만 암호화 통신으로 수탁사 시스템에 전송된다. 수집 시에는 법 제15조 및 제22조에 따라 개인정보의 수집·이용 목적, 항목, 보유·이용 기간, 동의 거부권 및 불이익을 고지하고, 전자적 방법으로 명확한 동의를 받는다. 계약 이행에 필요한 처리에 해당하는 경우에는 해당 법적 근거를 표시한다. 제3자 제공·국외 이전이 수반되는 경우에는 각 항목을 별도로 알리고 동의를 받는다.\n수탁사는 저장 데이터베이스 및 파일을 암호화하고, 개인별 계정 기반의 최소권한을 적용한다. 평가위원에게는 가명처리된 지원자 ID와 평가 항목만 제공하며, 실명 매핑 정보는 피심인이 별도 저장소에 분리 보관한다. 개인정보처리시스템 접근은 역할기반 권한과 다중인증으로 통제하고, 침입 탐지·차단, 악성코드 방지 프로그램의 설치·갱신을 운영한다. 전송 구간은 TLS 등 암호화 채널을 사용하고, 비밀번호 등 인증정보는 일방향 암호화로 보관한다. 접속기록(접속일시, 처리내역 등)은 안전하게 보관하고 위·변조 방지 조치를 적용하며, 정기 점검을 수행한다. 종이 문서는 잠금장치가 있는 보관시설에 보관한다.\n위탁 계약서에는 목적·범위, 재위탁 제한, 접근권한 관리, 암호화와 접속기록 보관 등 안전조치, 사고 통지 및 대응, 점검·감독, 처리 종료 시 반환·파기 절차와 책임을 포함한다. 수탁사 재위탁은 사전 동의가 있는 경우에만 가능하며, 사고 발생 시 통지·대응 절차를 따른다. 피심인은 수탁사에 대한 정기 교육을 실시하고, 계정·권한 점검, 취약점 점검, 현장 또는 원격 점검과 결과 보고서를 통해 감독한다. 위탁하는 업무의 내용과 수탁자 목록은 홈페이지에 상시 공개하고 변경 시 갱신한다.\n운영 과정에서 응시자의 개인정보가 수탁사 단계에서 외부로 유출된 사실이 확인되었다. 해당 데이터는 수탁사 시스템에 보관되는 형태로 처리되고 있었다. 이후 피심인은 수탁자 교육과 감독 절차를 정비하고, 이행 결과를 제출받아 위탁 업무 전반의 관리 체계를 문서화하여 운용하였다.\n보존·파기는 채용 종료 및 이의제기 기간 종료 후 정해진 기간 경과 시 자동으로 수행한다. 전자파일은 복구 불가능한 방법으로 삭제하고, 서면은 파쇄 또는 소각한다. 다른 법령에 따라 보존이 필요한 경우에는 해당 항목을 별도 저장소에 분리 보관하며, 파기·분리보관 이력은 기록한다.\n정보주체 권리 행사를 위해 열람·정정·삭제·처리정지 및 동의 철회 창구를 운영하고, 본인 확인 후 정해진 절차와 기한 내 처리한다. 유출 통지·신고 및 대응을 포함한 사고 대응 절차를 마련하여 운영한다. 유출 사실을 인지한 때부터 72시간 이내에 정보주체에게 통지하고, 규모·유형 등에 따라 보호위원회 또는 한국인터넷진흥원에 신고한다. 열람·정정·삭제·처리정지 및 동의 철회 요구는 접수 후 10일 이내에 처리하거나 처리 결과를 통지한다.\n당초 목적과 합리적으로 관련된 범위에서 내부 통계 등 추가 이용이 필요한 경우에는 가명처리 후 이용하며, 가명정보 처리 목적, 가명처리된 개인정보 항목, 이용 내역, 제3자 제공 시 제공받는 자, 처리 기간 등을 기록·보관한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 4, "minimal_change": 2}, "pass": false, "problems": [{"aspect": "objectivity", "issue": "case_content includes legality claims and explicit article citations (e.g., '법 제15조 및 제22조에 따라', '법적 근거를 표시한다'), which go beyond neutral business description and factual handling steps.", "fix": "Edit the first paragraph to remove legal citations and normative phrasing. For example, replace: '수집 시에는 법 제15조 및 제22조에 따라 개인정보의 수집·이용 목적, 항목, 보유·이용 기간, 동의 거부권 및 불이익을 고지하고, 전자적 방법으로 명확한 동의를 받는다.' with: '수집 시에는 개인정보의 수집·이용 목적, 항목, 보유·이용 기간, 동의 거부권 및 불이익을 고지하고, 전자적 방법으로 명확한 동의를 받는다.' Also replace: '계약 이행에 필요한 처리에 해당하는 경우에는 해당 법적 근거를 표시한다.' with: '계약 이행에 필요한 처리에 해당하는 경우에는 그 사실을 명확히 안내한다.'"}, {"aspect": "minimal_change", "issue": "The rewritten record adds extensive new scope (data subject rights procedures, detailed retention/erasure regimes, pseudonymized analytics, cross-border and third-party consent handling) and removes the original violated_articles, altering the original scenario beyond handling/controls.", "fix": "1) Restore the original violation list by setting violated_articles to ['개인정보 보호법 제26조', '개인정보 보호법 시행령 제28조']. 2) Trim case_content to focus on the entrusted processing, storage in the 수탁사 시스템, the incident, and management/supervision controls. Specifically, delete the paragraphs beginning with '보존·파기는', '정보주체 권리 행사를 위해', and '당초 목적과 합리적으로 관련된 범위에서'. 3) In the first paragraph, delete the sentence: '수집 시에는 법 제15조 및 제22조에 따라 ... 동의를 받는다. 계약 이행에 필요한 처리에 해당하는 경우에는 해당 법적 근거를 표시한다. 제3자 제공·국외 이전이 수반되는 경우에는 각 항목을 별도로 알리고 동의를 받는다.' Keep the security and 위탁 계약서/감독 관련 단락 as handling controls aligned to the original scenario."}]}}
{"case_id": "2023-012-122", "respondent": "피심인(비공개 기업)", "case_content": "피심인(비공개 기업)은 채용 전형의 평가 업무를 수탁사에 맡기면서 입사 지원자의 개인정보를 수탁사에 제공하여 처리하게 하였다. 피심인은 위탁 시 문서에 법정 필수사항을 모두 포함하여 체결하지 않았고, 수탁자 교육과 처리현황 점검 등 관리·감독 절차를 별도로 운영하지 않은 상태에서 업무를 수행하였다. 이 과정에서 수탁사가 처리하던 응시자의 개인정보가 외부로 유출되었으며, 관련 경위는 개인정보보호위원회 신고와 조사자료 제출을 통해 확인되었다.\n이후 개선조치로 현재는 다음과 같이 운영한다. 지원자로부터 채용 진행에 필요한 최소 항목(성명, 연락수단, 지원서 ID, 지원 분야)과 평가 수행에 필요한 제출자료 및 평가 결과만 수집·이용한다. 주민등록번호 등 고유식별정보와 민감정보는 수집하지 않으며, 제출자료 업로드 시 해당 정보가 포함되면 접수가 차단되도록 안내와 서버측 패턴 검사를 적용한다. 수집 단계에서 수집·이용 목적, 수집 항목, 보유·이용 기간, 동의 거부권 및 그에 따른 영향 등을 알리고 동의를 받으며, 동의 없이 처리가 가능한 항목이 있는 경우에는 그 항목과 처리 근거를 구분하여 안내한다.\n위탁 시에는 문서에 위탁업무의 목적과 범위, 위탁업무 수행 목적 외 처리 금지, 재위탁 제한 및 재위탁 시 위탁자의 사전 동의, 개인정보에 대한 접근 제한 등 안전조치, 전송·저장 암호화, 접속기록 보관·점검, 물리적 통제, 사고 인지 시 통지, 개인정보의 반환·파기 절차, 점검 및 교육 등 감독, 수탁자의 의무 위반 시 책임에 관한 사항을 포함하여 체결한다. 수탁자는 개인별 계정과 다단계 인증으로 접속하며 최소권한 원칙을 적용하고, 직무 변경·퇴직 시 권한을 즉시 말소한다. 전송 구간은 암호화 채널을 사용하고 저장 데이터는 암호화한다. 평가 결과는 채용관리시스템과 분리된 저장소에 보관하며 다운로드 제한과 반출 승인 절차를 운영한다. 개인정보처리시스템의 접속기록은 위·변조 방지 조치와 함께 보관·정기 점검하며, 악성코드 방지 및 취약점 점검 등 기술적 보호조치를 주기적으로 수행한다.\n피심인은 홈페이지에 위탁 업무의 내용과 수탁자를 상시 공개하고 변경 시 지체 없이 갱신한다. 채용 종료 또는 보존기간 도래 시 지체 없이 파기하며, 다른 법령에 따른 보존이 필요한 경우에는 다른 정보와 분리하여 저장·관리한다. 파기는 복구 불가능한 방식으로 수행하고 파기 이력을 기록한다. 유출 등 사고 인지 시 피해 최소화 조치를 시행하고 정보주체 통지 및 관계기관 신고 절차에 따라 처리한다. 이때 유출 사실을 알게 된 때부터 72시간 이내 정보주체에게 통지하고, 1천명 이상 규모 유출이거나 민감정보·고유식별정보 유출 또는 외부 불법접근에 해당하는 경우 72시간 이내 보호위원회 또는 한국인터넷진흥원에 신고한다. 지원자는 정해진 창구를 통해 열람·정정·삭제(또는 동의 철회)·처리정지 등을 요청할 수 있고, 피심인은 처리 절차와 결과를 안내한다. 수탁사에 대한 정기 교육과 현장·비대면 점검을 실시하고, 점검 결과 및 개선 이력을 보관한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 4, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "objectivity", "issue": "case_content에 \"법정 필수사항\"이라는 표현이 포함되어 있어 법적 평가(위법성 암시)가 개입된 서술로 해석될 수 있음.", "fix": "해당 문구를 중립적 사실 서술로 교체. 예: 기존 문장\n- \"피심인은 위탁 시 문서에 법정 필수사항을 모두 포함하여 체결하지 않았고, ...\"\n대체 문장\n- \"피심인은 위탁 시 작성한 문서에 목적·범위, 재위탁 제한, 안전조치, 감독 및 책임 조항 등 포함 항목 일부가 누락되어 있었고, ...\""}, {"aspect": "minimal_change", "issue": "원문에 존재하던 violated_articles 목록이 REWRITTEN에서 빈 배열로 변경됨. 이는 시나리오의 불필요한 구조적 변경에 해당.", "fix": "violated_articles 값을 원문과 동일하게 복원. 예:\n\"violated_articles\": [\n  \"개인정보 보호법 제26조제1항\",\n  \"개인정보 보호법 제26조제4항\",\n  \"개인정보 보호법 시행령 제28조제1항\",\n  \"개인정보 보호법 시행령 제28조제6항\"\n]"}]}}
{"case_id": "2023-012-125", "respondent": "피심인", "case_content": "채용 단계의 평가 업무를 수탁사에 위탁한다. 위탁 시 지원자 식별 최소 항목(지원자ID 또는 성명, 연락수단)과 평가에 필요한 이력 요약, 전형 단계별 평가 결과만 제공하며, 불필요한 첨부파일과 민감정보·주민등록번호는 수집하지 않는다. 업로드 단계에서 주민등록번호·계좌·건강정보 등 민감한 패턴을 자동 검사하여 포함 시 접수를 차단하고, 가림 안내를 제공한다. 데이터 전송은 암호화 채널을 사용하고, 수탁사 저장 데이터는 암호화한다. 수탁사 접근 권한은 평가 담당자에게 최소한으로 부여하며 개인별 계정과 다중인증을 적용한다. 접근·처리 내역은 접속기록으로 보관하고 위변조 방지 조치를 적용한다. 평가 심사용 데이터와 연락처 매핑 정보는 분리 보관하며, 매핑 정보는 위탁자 측에서만 관리한다. 위탁 계약서에 처리 목적·범위, 재위탁 제한 및 사전 승인, 암호화·접근통제·취약점 관리 등 안전조치, 접속기록 관리, 사고 통지, 반환·파기 기준, 감독 및 손해배상 책임을 포함한다. 재위탁 시 사전 동의와 동일 수준의 보호조치를 적용한다. 위탁 업무 내용과 수탁자 현황은 홈페이지에 지속적으로 공개한다. 수탁자 교육을 정기 실시하고, 점검 계획에 따라 권한관리, 로그, 파기 이행 등을 원격·현장 점검한다. 채용 종료 또는 보존기간 만료 시 수탁사 시스템과 백업에서 복구 불가능한 방식으로 파기하고, 파기 대상·방법·일자를 기록한다. 장기 보존이 필요한 경우에는 다른 개인정보와 분리하여 저장·관리한다. 내부 관리계획을 운영하고 개인정보 보호책임자 지정, 권한관리, 악성코드 방지, 침입 차단 등 기술·관리·물리적 안전조치를 적용한다. 개인정보 처리방침과 권리행사 절차(열람·정정·삭제·처리정지·동의철회)를 안내하며, 보안 사고 대응 프로세스를 마련하고 필요한 경우 정보주체 통지 및 관계 기관 신고 절차를 운영한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "재위탁 동의 주체가 모호합니다. 법 제26조 제6항에 따라 재위탁 시에는 '위탁자의 사전 동의'가 명시되어야 합니다.", "fix": "문구를 다음과 같이 수정하세요: \"재위탁 시 사전 동의와 동일 수준의 보호조치를 적용한다.\"를 \"수탁자가 재위탁을 하려는 경우 위탁자의 사전 동의를 받고, 동일 수준의 보호조치를 적용한다.\"로 변경"}, {"aspect": "legality", "issue": "유출 통지 및 신고의 기한과 대상 기관이 명확하지 않습니다. 시행령 제39조, 제40조는 72시간 이내 통지/신고와 보호위원회 또는 한국인터넷진흥원 신고를 요구합니다.", "fix": "해당 문장을 다음과 같이 보완하세요: \"보안 사고 대응 프로세스를 마련하고 필요한 경우 정보주체 통지 및 관계 기관 신고 절차를 운영한다.\"를 \"개인정보 유출 시 72시간 이내 정보주체에게 통지하고, 유출 규모·유형에 따라 보호위원회 또는 한국인터넷진흥원에 72시간 이내 신고하는 절차를 운영한다.\"로 변경"}]}}
{"case_id": "2023-012-119", "respondent": "피심인(기업명 비공개)", "case_content": "채용 평가 업무를 전문 수탁사에 위탁한다. 지원자 접수 단계에서는 평가에 필요한 최소 항목(성명, 연락수단, 경력·학력, 자격 확인 정보)만 수집하며, 주민등록번호 및 민감정보는 수집하지 않는다. 자료 업로드 시 고유식별정보·민감정보 패턴을 검사하여 포함된 경우 접수를 차단하거나 마스킹하도록 안내한다. 수집 정보는 채용 시스템에 저장되며, 평가 결과 데이터는 식별정보와 분리하여 보관한다. 수탁사 제공 데이터는 위탁 목적 달성에 필요한 범위로 한정하며, 전송 시 암호화 채널을 사용하고 저장 데이터는 암호화한다. 당사 및 수탁사 모두 개인정보처리시스템 접근 권한을 평가 담당자로 최소화하고 개인별 계정과 인증수단을 적용한다. 접속기록(접속일시, 처리내역)을 보관하고 위변조 방지 조치를 적용하며, 악성코드 방지와 네트워크 접근통제, 물리적 접근통제를 운영한다. 위탁 계약은 문서로 체결하며 처리 범위, 목적 외 처리 금지, 재위탁 제한 및 사전 승인, 접근권한 관리, 기술·관리적 보호조치, 사고 통지, 관리 현황 점검, 반환·파기 방법 및 기한, 손해배상 책임을 명시한다. 위탁 현황(업무 내용, 수탁자)은 홈페이지의 개인정보 처리방침에 지속적으로 공개한다. 수탁자 교육과 처리 현황 점검을 정기적으로 실시하고, 점검 계획·결과 및 개선 조치 이력을 문서로 보관한다. 채용 절차 종료 후 정해진 보존기간 도래 시 전자파일은 복구 불가능한 방식으로 영구 삭제하고, 서면은 파쇄 또는 소각한다. 다른 법령에 따라 보존이 필요한 경우에는 해당 정보만 분리 보관한다. 정보주체는 열람, 정정·삭제, 처리정지 등 권리를 행사할 수 있으며, 수탁사는 이에 필요한 협조를 제공한다. 목적 외 이용·제공은 하지 않는다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "개인정보 수집 및 위탁 제공의 법적 근거와 동의 고지 절차가 명시되어 있지 않아 법 제15조 제1항·제2항 및 시행령 제17조의 고지 요건 충족 여부가 불명확함.", "fix": "case_content에 다음 문장을 추가: \"지원서 제출 시 개인정보의 수집·이용 및 위탁에 관한 사항을 명확히 고지하고 동의를 받는다. 고지 내용에는 수집·이용 목적, 수집 항목, 보유·이용 기간, 동의 거부권 및 거부 시 불이익(있는 경우)을 포함한다.\""}, {"aspect": "legality", "issue": "보유기간이 \"정해진 보존기간\"으로만 서술되어 구체성이 부족하여 법 제15조 제2항(보유 및 이용 기간 고지) 및 제21조·시행령 제16조(파기)의 예측가능성 요건이 약함.", "fix": "case_content의 보유·파기 문단을 구체화: \"보유기간은 미채용 시 지원 종료일로부터 6개월, 채용 시 인사기록으로 편입되어 관련 법령에 따른 기간 동안 보존한다. 보유기간 경과 또는 목적 달성 시 전자파일은 복구 불가능한 방식으로 영구 삭제하고, 서면은 파쇄 또는 소각한다.\""}]}}
{"case_id": "2023-012-128", "respondent": "피심인", "case_content": "채용 단계의 평가 업무 일부를 수탁사에 위탁하여 처리한다. 지원자 평가에 필요한 최소 항목(성명, 연락수단, 이력 요약, 포트폴리오 링크, 평가 결과)만 수탁사 시스템에서 처리하며, 목적 외 이용을 금지한다. 데이터 전송은 암호화 채널을 사용하고, 수탁사 시스템과 백업 본은 암호화 저장한다. 접근 권한은 평가 담당자로 최소화하고 개인별 계정과 2단계 인증으로 관리한다. 대량 다운로드·스크린 캡처·외부 반출은 기본 차단하며, 업무상 필요한 경우에는 사전 승인 절차를 거쳐 지정 양식으로 가명처리 또는 마스킹 후 제공한다. 개인정보처리시스템 접속기록을 보관·점검하고 위·변조 방지 조치를 적용한다. 위탁 계약은 문서로 체결하며 처리 목적·범위, 재위탁 제한 및 사전 동의, 안전성 확보조치, 관리 현황 점검·감독, 사고 통지, 반환·파기 절차와 손해배상 책임을 포함한다. 위탁하는 업무 내용과 수탁자 목록은 홈페이지에 상시 공개·갱신한다. 수탁사에는 정기 교육을 실시하고 기술·관리적 보호조치 이행 여부를 점검한다. 고유식별정보와 민감정보는 원칙적으로 수집하지 않으며 불가피한 경우에는 별도 동의 후 분리 보관·암호화한다. 채용 종료 후 합격자 관리에 필요한 범위를 제외한 자료는 정해진 보존기간 경과 시 복구 불가능한 방법으로 자동 파기하고, 법령상 보존이 필요한 경우에는 분리 보관하며 파기·반환 이력을 기록한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "외부 반출에 관한 문구만으로는 제3자 제공 시 법 제17조·제18조 및 시행령상 고지·동의 요건 충족 여부가 명확하지 않음.", "fix": "다음 문장을 외부 반출 관련 문장 바로 뒤에 추가: \"제3자에게 제공이 필요한 경우에는 법 제17조 및 제18조에 따라 제공받는 자, 이용 목적, 제공 항목, 보유·이용 기간, 거부권 및 거부 시 불이익을 정보주체에게 알리고 별도 동의를 받은 후에만 제공한다.\""}, {"aspect": "legality", "issue": "재위탁 동의의 주체 및 방식이 불명확하여 법 제26조제6항 및 시행령 제28조와의 정합성이 떨어짐.", "fix": "위탁 계약 관련 문구 중 \"재위탁 제한 및 사전 동의\"를 다음과 같이 교체: \"재위탁은 위탁자의 사전 서면 동의가 있는 경우에 한한다.\""}, {"aspect": "legality", "issue": "‘사고 통지’ 항목이 있으나 법·시행령상 72시간 내 통지·신고 등 구체 요건이 명시되지 않음(법 제34조, 시행령 제39조·제40조).", "fix": "위탁 계약 조항 설명에 다음 문장을 보완: \"개인정보 유출 등을 알게 된 경우 72시간 이내에 정보주체에게 통지하고, 요건에 해당하면 보호위원회 또는 한국인터넷진흥원에 신고한다.\""}]}}
{"case_id": "2023-012-118", "respondent": "피심인(기업명 비공개)", "case_content": "채용 단계의 평가 업무는 제3의 수탁사 평가 플랫폼을 통해 수행한다. 지원자 동의 화면에서 수집 목적, 항목, 보유기간, 동의 거부권을 안내하고, 평가에 필요한 최소 항목(성명, 연락처, 지원 직무, 이력 요약, 과제 제출물, 평가 결과)만 수집·제공한다. 주민등록번호 등 고유식별정보와 민감정보는 처리하지 않는다.\n\n위탁은 문서로 체결하며, 처리 목적·범위, 접근 권한 및 재위탁 제한, 암호화·권한관리·접속기록 등 안전조치, 사고 통지, 점검·감독, 종료 시 반환·파기 절차를 명시한다. 위탁하는 업무의 내용과 수탁자는 홈페이지에 상시 공개한다.\n\n지원자 데이터는 암호화 채널로 수탁사 시스템에 전송되고 저장 시에도 암호화된다. 회사와 수탁사는 개인별 계정과 역할 기반 최소권한, 다중인증을 적용하며, 계정 발급·변경·말소를 기록·관리한다. 접속기록은 위·변조 방지 조치와 함께 보관·점검하고, 악성코드 탐지 및 취약점 점검 등 기술 조치를 주기적으로 수행한다.\n\n평가 종료 및 보존기간 만료 시 지체 없이 파기하며, 전자파일은 복구 불가능한 방식으로 삭제하고, 법령상 보존이 필요한 정보는 분리 보관 후 기간 경과 시 파기한다. 파기·반환 이력은 기록한다.\n\n수탁사의 재위탁은 사전 승인 절차를 거치며, 회사는 정기 교육과 원격·현장 점검으로 처리 현황과 보안 통제를 확인한다. 사고 발생 시 지체 없이 통지·신고하고 피해 최소화 조치를 수행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "위탁 계약에 필수 기재사항인 '의무 위반 시 손해배상 등 책임' 조항이 명시되어 있지 않아 법 제26조 및 시행령 제28조(1)5 요건이 문구상 충족되지 않음.", "fix": "case_content의 위탁 계약 문구를 다음과 같이 수정하여 손해배상 책임을 포함하세요.\n- 기존: \"위탁은 문서로 체결하며, 처리 목적·범위, 접근 권한 및 재위탁 제한, 암호화·권한관리·접속기록 등 안전조치, 사고 통지, 점검·감독, 종료 시 반환·파기 절차를 명시한다.\"\n- 수정: \"위탁은 문서로 체결하며, 처리 목적·범위, 접근 권한 및 재위탁 제한, 암호화·권한관리·접속기록 등 안전조치, 사고 통지, 점검·감독, 종료 시 반환·파기 절차, 수탁자의 의무 위반 시 손해배상 등 책임을 명시한다.\""}]}}
{"case_id": "2023-012-129", "respondent": "비공개 법인(피심인)", "case_content": "채용 과정의 일부 평가 업무를 수탁사에 위탁하되, 입사 지원자 식별 최소 항목과 평가 응답·점수 등 평가 수행에 필요한 정보만 제공한다. 제공 시 지원자 고유 식별 값은 회사가 발급한 평가용 식별자로 대체하고, 일정 안내가 필요한 경우에 한해 연락수단을 추가로 제공한다. 데이터는 암호화 채널로 전송하고 저장 시 암호화하며, 수탁사 시스템 내 별도 영역에 분리 보관한다. 접근 권한은 평가 담당자에 한해 개인별 계정과 다단계 인증으로 부여하고, 권한 변경·말소 이력을 포함한 접속기록을 보관하여 위조·변조 방지 조치를 적용한다. 위탁 계약서에는 처리 목적·범위, 재위탁 제한, 접근통제·암호화 등 안전조치, 사고 통지, 관리 현황 점검·감독, 반환·파기 절차를 포함하고, 위탁하는 업무 내용과 수탁자 명칭을 홈페이지에 지속 공개한다. 회사는 수탁사 선정 시 보안 적격성 평가를 실시하고, 정기 권한 검토·접속기록 점검·취약점 보완과 개인정보 취급 교육을 수행한다. 외부 반출은 기본 차단하고, 업무상 필요한 경우 승인 절차와 파일 암호화·워터마킹을 적용하며, 업로드 자료에는 주민등록번호 등 고유식별정보가 포함되지 않도록 사전 안내와 서버 측 패턴 검사로 접수를 차단한다. 평가 결과와 의사결정 이력은 회사 내부 시스템으로 회수·통합하고, 수탁사에는 과제 처리에 필요한 기간 동안만 임시 보관한다. 채용 종료 후 정해진 보존기간이 지나면 수탁사 보관분을 포함한 개인정보는 복구 불가능한 방식으로 삭제하고 결과를 기록하며, 다른 법령에 따른 보존이 필요한 경우에는 본체와 분리하여 저장·관리한다. 유출 인지 시에는 신속 통지·신고, 원인 분석 및 재발 방지 조치를 시행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "시행령 제28조 제1항 제5호가 요구하는 ‘수탁자의 의무 위반 시 손해배상 등 책임’ 조항이 위탁 계약서 항목에 명시되어 있지 않음.", "fix": "REWRITTEN의 case_content 중 “위탁 계약서에는 처리 목적·범위, 재위탁 제한, 접근통제·암호화 등 안전조치, 사고 통지, 관리 현황 점검·감독, 반환·파기 절차를 포함하고” 문장을 다음과 같이 교체: “위탁 계약서에는 처리 목적·범위, 재위탁 제한 및 재위탁 시 위탁자의 사전 서면 동의 절차, 접근통제·암호화 등 안전조치, 사고 통지, 관리 현황 점검·감독, 수탁자의 의무 위반 시 손해배상 등 책임, 반환·파기 절차를 포함한다.”"}, {"aspect": "legality", "issue": "법 제26조 제6항(재위탁 시 위탁자의 동의) 요건이 ‘재위탁 제한’으로만 암시되어 있어 준수 여부가 불명확함.", "fix": "REWRITTEN의 case_content 적절한 위치(위탁 계약서 설명 직후)에 다음 문장을 추가: “수탁자가 위탁받은 개인정보 처리 업무를 제3자에게 다시 위탁하려는 경우, 수탁자는 위탁자의 사전 서면 동의를 받아야 한다.”"}]}}
{"case_id": "2024-017-240", "respondent": "㈜일학", "case_content": "피심인 ㈜일학은 온라인 쇼핑몰 ilhak.co.kr(군계일학)을 운영하면서 회원의 이름, 아이디, 비밀번호, 생년월일, 휴대전화번호, 주소, 이메일을 회원 DB에 저장·관리하였다. 이 중 비밀번호는 평문 형태로 보관되었고, 관리자 페이지는 외부에서도 아이디·비밀번호만으로 접속 가능했으며 IP 기반 접근 제한을 적용하지 않았고, DB 및 관리자 페이지 등 개인정보처리시스템의 접속기록은 별도로 보관되지 않았다. 2023년 12월 17~18일 신원 미상의 자가 SQL 인젝션과 관리자 로그인으로 DB에서 회원정보를 조회하여 일부를 쇼핑몰 Q&A 게시판에 게시하였다.\n사고 후 ㈜일학은 다음과 같이 조치하였다. 회원관리, 주문·결제·배송, 고객문의 대응에 필요한 최소 항목만 수집하고(선택 항목은 분리 동의), 모든 입력·전송 구간에 TLS를 적용하였다. 비밀번호는 고유 솔트를 적용한 단방향 해시(bcrypt/Argon2 등)로 저장하고, 그 외 개인정보는 저장 시 암호화하며 암호키는 분리 보관한다. 개인정보처리시스템 접근 권한은 최소 권한 원칙에 따라 개인별 계정을 부여·변경·말소하고 정기 점검한다. 관리자 페이지는 승인된 IP/VPN에서만 접속 가능하도록 하고, 2단계 인증, 로그인 실패 잠금, 세션 타임아웃을 적용하였다. 데이터베이스는 서비스용·운영자용 계정을 분리하고 쿼리 권한을 제한하였다. 애플리케이션은 입력값 검증과 준비된 쿼리로 SQL 인젝션을 차단하고, 웹방화벽과 침입탐지, 악성코드 방지 프로그램을 운영하며 취약점 점검과 패치를 주기적으로 수행한다. 개인정보처리시스템과 데이터베이스의 접속기록(계정, 일시, 원격지 IP, 처리내역)을 생성·보관하고 위·변조 방지조치를 적용하며 이상 행위 모니터링을 실시한다. 공개 게시판·문의 영역에는 전화번호·이메일 등 식별정보 게시를 자동 탐지·차단하는 필터를 적용한다. 보유기간은 목적·업무별로 설정하여 운영하고, 기간 만료 또는 회원 탈퇴 시 전자파일은 복구 불가능한 방법으로 삭제한다. 법령에 따른 보존 대상은 별도 저장소에 분리 보관하고 접근을 제한한다. 개인정보 유출 등 사고 발생 시 72시간 이내 정보주체 통지 및 보호위원회 또는 한국인터넷진흥원 신고 절차를 수행하도록 담당 부서를 지정하고 정기적으로 모의훈련을 실시한다. 또한 법령에 따른 내부관리계획을 수립·시행하고 개인정보취급자에 대한 정기 교육을 실시하며, 서버실·자료보관실 등에는 출입통제장치와 잠금장치 등 물리적 보호조치를 적용한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 3}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "사후 조치로 저장한 비밀번호 알고리즘이 원문에서는 SHA-256로 기재되어 있으나, 재작성본에서는 bcrypt/Argon2 등으로 변경되어 사실관계가 불필요하게 수정됨.", "fix": "case_content 내 해당 문구를 원문 사실에 맞게 수정. 예: \"비밀번호는 고유 솔트를 적용한 단방향 해시(bcrypt/Argon2 등)로 저장하고\"를 \"비밀번호는 SHA-256으로 일방향 암호화하여 저장하고\"로 교체. 또는 원문을 보존하면서 추가 개선을 병기: \"사고 직후 비밀번호를 SHA-256으로 일방향 암호화하여 저장하고, 이후 단계적으로 bcrypt/Argon2 기반으로 전환한다.\""}, {"aspect": "minimal_change", "issue": "violated_articles 항목이 원문에는 특정 조항(법 제29조, 영 제30조)으로 기재되어 있었으나 재작성본에서 빈 배열로 변경됨.", "fix": "violated_articles를 원문과 동일하게 복원. 예: \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제30조\"]"}]}}
{"case_id": "2024-017-239", "respondent": "㈜네오팜", "case_content": "㈜네오팜은 화장품 등 제품 판매 쇼핑몰 ‘네오팜샵(neopharmshop.co.kr)’을 운영하며 회원 가입, 주문, 결제, 배송, 고객상담을 위해 필요한 최소 항목만 수집한다. 필수 항목은 아이디, 성명, 연락수단(휴대전화 또는 이메일), 배송지 주소이며, 성별과 생년월일, 마케팅 정보 수신은 선택 항목으로 별도 동의를 받아 분리한다. 선택 동의를 하지 않아도 서비스 이용에 제한이 없다. 주민등록번호 등 고유식별정보는 수집하지 않는다.\n수집은 홈페이지 및 고객센터를 통해 이루어지며, 전송 구간에는 TLS를 적용한다. 비밀번호는 일방향 암호화로 저장하고, 개인정보는 저장 시 암호화하며 암호키는 별도 저장소에 분리 관리한다. 목적에 따른 최소 이용 원칙을 적용하고, 마케팅 목적 처리는 수신 동의 범위 내에서만 수행한다.\n관리자 페이지는 개인별 계정과 역할 기반 권한으로 운영하며, 공동 계정은 사용하지 않는다. 권한은 업무별 최소 범위로 부여하고 정기적으로 점검·말소한다. 외부 접속은 VPN 또는 사전 등록된 IP와 2차 인증을 함께 적용하여 허용한다. 개인정보처리시스템 접속기록(접속 일시, 조회·수정·다운로드 내역)은 위조·변조 방지 조치와 함께 보관·점검한다.\n대량 조회·다운로드는 기본 차단하고, 승인된 업무에 한해 최소 항목으로 일시 발급한다. 내보내기 파일은 암호화하고 만료시간·워터마크를 적용하며, 발급·열람·삭제 이력을 기록한다. 화면 조회는 페이지당 건수 제한과 연락처·주소 일부 마스킹을 적용한다.\n개인정보는 이용 목적별로 논리적으로 분리 저장하며, 마케팅 저장소는 수신 동의자 정보만 분리 보관한다. 처리 위탁이 필요한 경우 위탁 계약서에 처리 범위, 접근통제, 암호화, 재위탁 제한, 사고 통지, 반환·파기 절차, 점검·교육을 포함하고, 정기적으로 이행 여부를 점검한다.\n보유 기간은 목적 달성 또는 법정 보존기간 경과 시까지로 설정하고, 미이용 계정은 별도 분리 보관 후 파기한다. 기간 도래 시 자동 파기하며, 전자파일은 복구 불가능하게 삭제하고 서면은 파쇄·소각한다. 파기 결과와 이력을 기록한다.\n개인정보처리시스템에는 접근통제, 침입 탐지·차단, 악성코드 예방 프로그램 설치·갱신 및 정기 취약점 점검과 보안 패치를 시행한다. 서버실 등은 출입 통제로 물리적 접근을 관리한다.\n정보주체 권리 행사 창구를 운영하여 열람, 정정·삭제, 처리정지 및 동의 철회 요청을 접수·처리한다. 유출 등에 대비해 통지·신고, 피해 최소화, 재발 방지 절차를 포함한 내부관리계획을 수립·운영한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 1}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "핵심 사실이 변경됨. 원문에는 2023-08-05~17 관리자 페이지 비인가 접속, 759회 조회, 226,260건 엑셀 다운로드, 8/18 확인 및 신고/공지, 8/29 이메일 통지, 이후 보완조치 등의 사건 경과가 포함되어 있으나 REWRITTEN에서는 사건이 삭제되고 이상적인 운영정책으로 대체됨.", "fix": "사건 경과와 수치, 통지 일자 등 원문 사실을 복원하십시오. 예: \"2023년 8월 5일부터 17일까지 사전에 확보된 계정으로 관리자 페이지에 로그인한 접속이 있었고, 회원정보 조회 페이지에서 500건 단위로 총 759회 화면 조회가 이루어졌으며, ‘엑셀 내보내기’ 기능을 통해 유효회원 226,260명의 개인정보가 엑셀 파일로 다운로드되었다. ㈜네오팜은 2023년 8월 18일 관련 사실을 확인한 뒤 포털 신고와 홈페이지 팝업 안내를 실시하고, 8월 29일 이메일로 이용자에게 통지했다.\"를 본문에 포함하세요."}, {"aspect": "minimal_change", "issue": "원문 수집 항목과 필수/선택 구분이 변경됨. 원문은 회원 아이디, 성명, 성별, 생년월일, 휴대전화번호, 주소, 이메일을 수집한 사실을 서술하나, REWRITTEN은 성별·생년월일을 선택으로 바꾸고 필수 항목도 재구성함.", "fix": "원문과 동일한 수집 항목을 사실대로 기술하고, 선택/필수 구분 변경은 하지 마십시오. 예: \"회원 아이디, 성명, 성별, 생년월일, 휴대전화번호, 주소, 이메일을 수집·보관하였다.\"로 복원하세요. 선택/필수 구분은 사건 이후 개선조치로 분리하여 기술할 수 있습니다. 예: \"이후 선택 항목 분리 동의를 적용하였다.\""}, {"aspect": "minimal_change", "issue": "관리자 계정 운영 및 접근통제 현황이 원문과 다르게 변경됨. 원문은 부서별 1개 계정 공유, 모든 권한 사용, 외부에서 ID/비밀번호만으로 접속, IP제어·2차인증·접속기록 미적용이었으나, REWRITTEN은 개인별 계정, RBAC, VPN/IP제한+2차인증, 로그보관 등으로 대체됨.", "fix": "사건 당시의 운영 실태를 원문대로 명시하고, 강화된 통제는 '이후 조치'로 분리해 기술하십시오. 예: \"당시 관리자 계정은 부서별로 1개 계정을 공유해 모든 권한을 사용했고, 외부 접속은 아이디·비밀번호로 가능했으며 IP 기반 접근제어, 2차 인증 및 접속기록 보관은 적용되지 않았다.\" 이후에 \"이후 SMS 기반 2차 인증 적용, 계정 분리, IP 제한 및 접속기록 보관을 시행하였다.\"를 덧붙이세요."}, {"aspect": "minimal_change", "issue": "대량 조회/다운로드 차단, 내보내기 파일 암호화·만료·워터마크, 화면 마스킹 등은 원문 사건 전에 존재하지 않았던 통제로 보이나 REWRITTEN은 이를 상시 운영으로 서술함.", "fix": "이 조치들은 '사건 이후 개선'으로 이동하여 시점을 명확히 하십시오. 예: \"사건 이후 대량 조회·다운로드 기본 차단, 승인 기반 일시 권한 부여, 내보내기 파일 암호화·만료·워터마크, 화면 마스킹을 도입하였다.\""}, {"aspect": "minimal_change", "issue": "유출 통지/신고의 사실과 일정(8/18 확인 후 신고/안내, 8/29 이메일 통지)이 삭제됨.", "fix": "원문 통지·신고 사실 및 일정을 복원하십시오. 예: \"㈜네오팜은 2023년 8월 18일 관련 사실을 확인한 뒤 포털 신고와 홈페이지 팝업 안내를 실시하고, 8월 29일 이메일로 이용자에게 통지하였다.\""}, {"aspect": "minimal_change", "issue": "violated_articles가 원문에서 제시된 조항(개인정보 보호법 제29조, 시행령 제48조의2, 개인정보 보호법 제39조의4)에서 빈 배열로 변경됨.", "fix": "원문과 동일하게 복원하십시오. 예: \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제48조의2\", \"개인정보 보호법 제39조의4\"]"}]}}
{"case_id": "2023-011-114", "respondent": "피심인", "case_content": "과거 DB 교체 과정에서 CI 필드가 공백으로 저장되는 설정 오류로 만 14세 미만 이용자 260개 계정의 이름·생년월일이 2020.3.8.~4.6. 사이 일부 신규 가입자의 값으로 갱신되었고, 최소 26명이 ‘내 개인정보’ 화면에서 타인의 이름과 생년월일을 조회한 사실이 있었다. 이후 아래 통제를 도입·강화하였다.\n피심인은 회원 계정 기반의 웹 서비스를 운영하며, 계정 식별과 본인 확인을 위해 최소 항목(CI, 이름, 생년월일)만 수집한다. 만 14세 미만 이용자는 법정대리인 동의 확인 후 가입을 허용하며, 동의 증빙은 일반 정보와 분리된 저장소에 별도 권한으로 보관한다. 개인정보는 관계형 DB 내 계정 테이블에 저장 시 암호화하고, 서비스와 DB 간 통신은 암호화 채널을 사용한다. DB와 애플리케이션 접근 권한은 역할 기반으로 최소화하고 개인별 계정을 사용하며, 접속기록과 처리내역을 보관·점검한다.\n가입 단계에서 수집·이용 목적, 수집 항목, 보유·이용 기간, 동의 거부권 및 거부 시 불이익을 명확히 안내하고, 서면, 전자문서, 홈페이지 상 동의 절차, 전자우편 회신, 전화 확인 등 확인 가능한 방법으로 동의를 받는다. 만 14세 미만의 경우 법정대리인의 동의를 서면, 휴대전화 본인확인, 공동/전자서명 등으로 확인하며, 아동에게는 이해하기 쉬운 양식으로 안내한다. 정보주체가 열람, 정정, 삭제, 처리정지, 동의철회를 요청할 수 있는 창구와 절차를 마련하여 쉽게 신청할 수 있도록 하고, 요청 접수 후 정해진 기한 내 처리 결과를 통지한다. 개인정보 처리방침에는 처리 목적, 보유 기간, 제3자 제공 및 처리위탁 현황(해당 시), 안전조치, 권리행사 방법, 담당 부서 및 연락처 등을 포함하여 홈페이지에 상시 공개하고 변경 이력을 관리한다.\n‘내 개인정보’ 화면은 로그인 후 재인증(비밀번호 또는 2단계 인증) 완료 시에만 접근되며, 서버는 세션의 사용자 식별자와 DB의 기본키를 매칭하여 해당 이용자 행(row)만 조회한다. 이름과 생년월일은 화면에서 일부 마스킹하여 표시하고, 브라우저 캐시 방지 헤더를 적용한다. 조회·수정 요청은 파라미터 검증과 준비된 쿼리로 처리하고, 예외 시 기본값 출력이나 타인 정보 노출이 발생하지 않도록 오류 처리를 표준화한다.\nDB 교체 및 마이그레이션 시 스테이징 환경에서 리허설을 실시하고, 이중 기록 잠금 및 트랜잭션 기반 일괄 이행 후 무결성 검증(레코드 수·해시 비교·샘플 대조)을 완료할 때까지 전환하지 않는다. CI 컬럼에는 NOT NULL·UNIQUE·CHECK 제약을 적용해 공백·NULL·형식 오류 입력을 차단하고, 마이그레이션 스크립트에 필드별 매핑 검증과 실패 시 자동 롤백 로직을 포함한다. 미성년 계정 플래그와 법정대리인 동의 연계값은 별도 검증 쿼리로 보정 여부를 확인한다. 마이그레이션 전·후 변경 이력과 검증 결과, 실행 계정·시각은 감사로그로 분리 보관한다.\n정보 정확성을 위해 생년월일·이름 변경 시 증빙 확인 절차를 두고, 중복·형식 오류를 서버에서 검증한다. 보존기간이 경과하거나 목적이 달성된 정보는 자동 파기하며, 전자파일은 복구 불가능한 방식으로 삭제하고(기술적으로 곤란한 경우 복원 불가능하도록 비식별 조치), 서면은 파쇄 또는 소각한다. 파기 이력은 기록하고, 법정 보존 대상은 본문 데이터와 분리해 보관한다.\n취약점 진단과 모의훈련을 정기 수행하며, 이상 징후가 탐지되면 즉시 접근을 차단하고 영향 범위를 파악하여 대응 절차에 따른 후속 조치를 진행한다. 유출 등 사고가 확인될 경우에는 정보주체 통지와 관계기관 신고가 필요한 범위를 검토하여 지체 없이 진행하고, 재발 방지를 위한 조치 내역을 기록·관리한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "법과 시행령의 명시적 기한(유출 통지/신고 72시간, 권리요구 처리 10일)이 텍스트에 드러나지 않아 시행령 요건 충족이 불명확함.", "fix": "다음과 같이 시한을 명시하세요.\n- 기존 문구: \"유출 등 사고가 확인될 경우에는 정보주체 통지와 관계기관 신고가 필요한 범위를 검토하여 지체 없이 진행하고, 재발 방지를 위한 조치 내역을 기록·관리한다.\"\n- 수정 문구: \"유출 등 사고가 확인될 경우에는 법 제34조 및 시행령 제39조·제40조에 따라 72시간 이내 정보주체 통지 및(해당하는 경우) 보호위원회/한국인터넷진흥원 신고를 실시하고, 재발 방지를 위한 조치 내역을 기록·관리한다.\"\n또한 권리요구 처리 기한을 명시하세요.\n- 기존 문구: \"요청 접수 후 정해진 기한 내 처리 결과를 통지한다.\"\n- 수정 문구: \"요청 접수 후 시행령 제41조·제43조·제44조에 따라 10일 이내 처리 결과를 통지한다.\""}, {"aspect": "minimal_change", "issue": "사실관계의 불필요한 수식어 추가로 원사례의 의미가 변동될 소지(\"일부 신규 가입자의 값\").", "fix": "원문 사실과 일치하도록 문구를 되돌리세요.\n- 기존 문구: \"... 2020.3.8.~4.6. 사이 일부 신규 가입자의 값으로 갱신되었고 ...\"\n- 수정 문구: \"... 2020.3.8.~4.6. 사이 신규 가입자의 값으로 갱신되었고 ...\""}, {"aspect": "minimal_change", "issue": "사건 배경 표현이 축약되어(\"과거 DB 교체 과정\") 원문(서비스 운영 중 DB 교체 과정)과 뉘앙스 차이가 있음.", "fix": "원문 맥락을 유지하도록 수정하세요.\n- 기존 문구: \"과거 DB 교체 과정에서 CI 필드가 공백으로 저장되는 설정 오류로 ...\"\n- 수정 문구: \"서비스 운영 중 DB 교체 과정에서 CI 필드가 공백으로 저장되는 설정 오류로 ...\""}]}}
{"case_id": "2023-011-114", "respondent": "피심인", "case_content": "피심인은 계정 기반 사진·동영상 보관·열람 서비스를 운영한다. 현재 로그인은 단일 인증 흐름으로 제공되며, 모든 경로에서 ID(이메일 또는 휴대전화번호)+비밀번호+휴대전화 기반 2차 인증을 필수로 적용한다. 과거에는 일부 기존 접속 경로에서 ID(이메일 또는 휴대전화번호)+비밀번호만으로 로그인할 수 있었다.\n\n2020.2.15.~5.11. 동안 신원미상의 자가 해당 기존 경로로 로그인하여 일부 계정의 사진·동영상 파일을 웹 화면에서 조회하고 클라이언트로 다운로드했다. 4.29. 이후에는 234개 계정의 2차 인증 수단에 자신의 휴대전화번호를 등록하고 71개 계정에 접속하였다. 해당 미디어 데이터는 피심인의 서비스 서버에 저장되어 인증된 세션에 제공되었고, 당시 접속 기록과 IP 정보를 기반으로 차단 및 비밀번호 초기화 조치를 수행하였다. 유출등 사실 인지 시 72시간 이내에 해당 정보주체에게 유출 사실, 시점·경위, 피해 최소화 방법, 대응조치, 신고 접수처를 통지하고, 신고 기준에 해당하는 경우 보호위원회 또는 한국인터넷진흥원에 신고하였다.\n\n이후 모든 경로에 2차 인증을 필수 적용하고 관련 보안 통제를 강화하였다. 비밀번호는 솔트를 포함한 단방향으로 저장하고, 2차 인증 수단(휴대전화번호·OTP 토큰 등)은 별도 영역에 분리하여 암호화 저장한다. 2차 인증의 등록·변경·복구는 기존 등록 수단을 통한 추가 확인과 신분 확인 절차를 거쳐 처리하며, 변경 시 기존 연락처로 사전 알림과 승인 절차를 적용한다.\n\n서비스 서버 및 백업 저장소에는 미디어 파일을 암호화하여 저장하고, 전송 구간은 암호화 채널을 사용한다. 파일 조회·다운로드는 본인 계정의 인증된 세션에서만 가능하도록 하고, 대량 다운로드에는 속도 제한과 재인증을 적용한다. 개인정보 및 콘텐츠 접근 권한은 최소 권한 원칙으로 부여하며, 관리 기능 접근에는 다단계 인증을 요구한다.\n\n보안 운영을 위해 로그인·2차 인증·설정 변경·콘텐츠 열람·다운로드에 대한 접속기록(일시, IP, 사용자·단말 식별 등)을 위변조 방지 조치와 함께 보관·점검한다. 비정상 위치·장치, 반복 실패, 비정상 다운로드 등 이상 징후 탐지 시 자동 차단, 추가 인증, 세션 만료, 비밀번호 초기화 등 대응을 수행한다. 새로운 기기에서의 로그인 또는 2차 인증 변경 시 이용자에게 즉시 알림을 제공한다.\n\n수집 항목은 서비스 제공 및 보안에 필요한 최소 정보(계정 식별 정보, 인증 수단, 접속기록, 일부 장치 정보)로 한정하며, 목적 외 이용·제공은 하지 않는다. 필요한 경우에는 별도 동의를 받아 처리한다.\n\n개인정보는 보존기간 만료 또는 목적 달성 시 지체 없이 복구 불가능한 방법으로 파기하고, 보존 기간이 정해진 항목은 다른 개인정보와 분리하여 보관한다. 내부관리계획에 따라 권한관리, 악성코드 방지, 취약점 점검, 임직원 교육을 정기적으로 시행한다. 개인정보 침해 우려가 확인되는 경우에는 이용자 통지 및 관계기관 신고 등 필요한 조치를 진행한다.\n\n위 처리 목적, 수집 항목, 보유·이용 기간, 제3자 제공 여부, 국외 이전 여부, 안전조치, 정보주체 권리 및 행사방법 등을 포함한 개인정보 처리방침을 수립·공개하고, 변경 시에도 동일한 방법으로 공개한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": []}}
{"case_id": "2023-011-114", "respondent": "피심인", "case_content": "온라인 스토어 기능 수정(2021.3.23.) 과정에서 ‘주문 배송지 리스트’ 페이지의 세션 확인 로직이 누락되어, 세션 만료 시 내부 회원 식별번호가 ‘0’으로 초기화되는 상태에서 동일 식별번호(0)로 65건의 배송지 레코드가 생성·관리되었다. 그 결과 2021.5.4. 한 이용자가 로그인 후 배송지 변경 화면에서 타인의 배송지 정보(이름, 주소, 휴대전화번호) 19건을 조회했으며, 관련 오류는 2021.5.6.에 수정되었다. 배송지 정보는 계정 식별자와 함께 온라인 스토어 데이터베이스에 저장되고, 웹 애플리케이션 세션 값에 따라 조회 권한이 결정되는 구조였다.\n사후 개선 조치 및 운영 통제\n- 조회 권한은 서버 측에서 검증된 세션 정보와 계정 식별자를 기준으로 매 요청 시 소유자 일치 여부를 확인하여 부여한다. 기본값·NULL·비정상 식별자 사용을 차단하고, 쿼리 단계에서 행 단위 접근제어를 적용한다. 화면에는 휴대전화번호 일부를 마스킹해 표시한다.\n- 세션 토큰은 난수화·서명하여 발급하고 유효기간을 관리하며, 만료 시 재인증을 요구한다. 로그아웃·비활동·기기 변경 시 세션을 무효화하고, 다중 로그인 정책을 관리한다.\n- 저장 시에는 개인정보를 암호화하고, 전송 구간은 암호화 채널을 사용한다. 비밀번호 등 인증정보는 일방향 암호화로 저장한다. 데이터베이스 접근 권한은 최소한의 운영 인력으로 제한하고, 권한 부여·변경·말소 기준을 적용한다.\n- 개인정보처리시스템에 대한 침입 탐지·차단 등 접근통제 체계를 운영한다. 접속기록에는 접속 일시, 사용자 식별값, 처리 내역, 실패 이력을 남기고, 위변조 방지 조치를 적용하여 보관·점검한다. 악성코드 대응 프로그램을 운영하고 주기적으로 갱신한다.\n- 개발·변경 시 보안 요구사항을 반영하고, 세션 만료·권한 검증·소유자 검증 등에 대한 자동화 테스트와 코드 리뷰를 거쳐 배포한다. 운영 반영 전 분리된 검증 환경에서 기능 점검 및 취약점 점검을 수행한다.\n- 내부관리계획을 수립·시행하고 정기 점검을 실시한다(접근권한 부여·변경·말소, 인증수단 관리, 정기 교육 포함). 개인정보 보호책임자를 지정한다. 서버실 등 보관 시설 출입통제 및 잠금장치, 문서 보관 캐비닛 잠금 등 물리적 안전조치를 적용한다.\n- 주문 배송 수행을 위해 택배사 등에게 개인정보 처리업무를 위탁하며, 위탁 범위는 운송장 생성·집화·배송 조회 등으로 한정한다. 수탁자(예: OO택배, △△로지스)의 명칭과 연락처, 위탁 범위는 개인정보 처리방침과 홈페이지에 공개한다. 위탁 계약에는 접근통제, 암호화, 사고 통지, 반환·파기, 재위탁 제한, 감독 등 안전조치를 포함하고, 처리 현황을 점검한다. 호스팅·메시지 발송 시스템 등 관련 처리 업무도 동일한 기준으로 위탁 관리한다.\n- 보관기간은 계정 보유 및 주소록 유지 목적 범위 내에서 설정하며, 이용자가 삭제하거나 계정이 탈퇴되면 지체 없이 파기한다. 주문 관련 분쟁 대응 또는 관련 법령에 따른 보존이 필요한 경우에는 해당 정보를 분리 보관하고, 보존기간 종료 시 복구 불가능한 방법으로 삭제한다. 전자파일은 복구가 불가능하도록 영구 삭제하고, 서면 등은 파쇄 또는 소각한다. 삭제 이력은 기록한다.\n- 개인정보 처리방침에 수집 목적, 항목, 보관기간, 위탁 현황, 안전조치, 권리행사 방법 등을 공개한다. 무단 접근 또는 오남용 징후 탐지 시 접속 차단, 취약점 보완, 정보주체 안내 및 관계 기관 신고 기준에 따른 조치를 수행한다. 개인정보 유출 등이 발생한 경우 72시간 이내 정보주체 통지 및 보호위원회/한국인터넷진흥원 신고 절차를 적용하며, 확인되지 않은 내용은 선 통지·신고 후 추가 내용 확정 시 지체 없이 추가 통지·신고한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "The violated_articles field was removed (set to an empty list), which alters the record’s original legal characterization without necessity and goes beyond handling/controls.", "fix": "Restore the original violated_articles field. Replace: \"violated_articles\": [] with \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제48조의2\"]."}, {"aspect": "minimal_change", "issue": "New business-scope details were added about outsourcing to couriers and hosting/messaging vendors (including example vendor names), which were not in the original and are not strictly necessary to describe the incident or the post-incident controls.", "fix": "Qualify the outsourcing content as management of existing outsourcing and remove vendor examples to avoid expanding the business scenario. Edit the bullet as follows: replace \"- 주문 배송 수행을 위해 택배사 등에게 개인정보 처리업무를 위탁하며, ... 수탁자(예: OO택배, △△로지스)의 명칭과 연락처, ... 호스팅·메시지 발송 시스템 등 관련 처리 업무도 동일한 기준으로 위탁 관리한다.\" with \"- 주문 배송 수행을 위해 기존에 운영 중인 택배사 등 위탁에 대하여 다음과 같이 관리한다: 위탁 범위는 운송장 생성·집화·배송 조회 등으로 한정한다. 수탁자의 명칭과 연락처, 위탁 범위는 개인정보 처리방침과 홈페이지에 공개한다. 위탁 계약에는 접근통제, 암호화, 사고 통지, 반환·파기, 재위탁 제한, 감독 등 안전조치를 포함하고, 처리 현황을 점검한다. 호스팅·메시지 발송 시스템 등 기존 위탁에도 동일한 기준으로 관리한다.\""}]}}
{"case_id": "2024-016-234", "respondent": "피심인", "case_content": "피심인은 가상자산 지갑 앱 가입 및 이용 과정에서 전용 기기로 이용자의 생체 이미지를 일시 캡처해 기기 내에서 일방향 함수와 솔트를 적용한 생체인식 특징값(템플릿)을 생성한다. 원본 이미지는 기본 정책상 서버로 전송하거나 저장하지 않으며, 생성 즉시 기기 메모리에서 영구 삭제한다. 다만, 과거 선택적 데이터 수탁 동의가 있는 경우에 한해 원본 이미지를 내부 보관한 이력이 있으며, 해당 보관 데이터는 2024년 3월 22일 기준 일괄 파기하였다. 서버로 전송되는 항목은 특징값, 앱 설치 시 생성되는 지갑 ID, 오류 대응에 필요한 최소 단말 정보로 한정한다.\n생체정보 처리에 대해서는 목적, 항목, 보유기간, 거부권 및 거부에 따른 영향(대체 인증 수단 제공)을 분리 고지하고 다른 동의와 구분된 별도 동의를 받는다. 동의하지 않아도 PIN/비생체 인증 등 대체 방법으로 서비스 이용이 가능하도록 제공한다.\n특징값은 중복 가입 여부 확인을 위해 서버에서 동일한 일방향 처리값끼리만 대조하며, 재식별이 가능하지 않도록 설계한다. 특징값 저장소와 지갑 ID 저장소는 물리·논리적으로 분리하고, 연계에 필요한 인증키는 이용자 기기에만 보관한다. 데이터 전송은 TLS 기반으로 암호화하고, 저장 데이터는 별도 키관리시스템(KMS)으로 관리되는 키로 암호화한다.\n접근 권한은 업무상 필요한 최소 범위로 부여하며, 개인별 계정과 다단계 인증을 적용한다. 수탁사와 내부 담당자 접근은 역할 기반으로 분리하고, 권한 부여·변경·말소 이력을 관리한다. 개인정보처리시스템 접속기록(접속일시, 처리내역 등)은 위·변조 방지 저장소에 보관·점검한다. 침입차단/탐지, 악성코드 방지, 취약점 점검을 주기적으로 수행한다.\n보관·파기 정책은 다음과 같다. 원본 이미지는 생성 즉시 파기한다. 특징값과 지갑 ID는 계정 삭제 또는 동의 철회 시 지체 없이 복구 불가능한 방식으로 파기하고, 파기 결과를 기록한다. 재가입 방지를 위해 사전 고지 및 동의한 이용자의 경우, 해당 특징값과 지갑 ID를 최대 6개월간 분리 보관하며 다른 정보와 결합하거나 인증 용도로 사용하지 않고 기간 만료 즉시 파기한다. 앱 내 특징값 및 지갑 ID 삭제 요청 기능은 2024년 4월 30일부터 제공한다. 법령에 따른 보존이 필요한 경우에는 다른 개인정보와 분리하여 저장·관리한다.\n국외 인프라를 이용하여 처리위탁·보관이 필요한 경우, 이전 항목, 이전 국가, 이전 시기·방법, 이전받는 자의 명칭·연락처, 이용 목적 및 보유·이용 기간, 이전 거부 방법·효과를 앱 화면과 처리방침에 사전 고지하고 국외 이전에 관한 별도 동의를 받은 후에만 이전을 수행한다. 동의 거부 시에는 국내 리전 저장 또는 국외 이전이 수반되지 않는 대체 경로로 처리한다. 국외 이전과 관련하여 이전받는 자와는 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 점검·감사, 반환·파기 등을 포함한 계약을 체결하고, 정기적으로 이행 여부를 점검한다. 과거 국외 이전이 선행된 경우에는 해당 내역을 개별 통지하고 국외 이전에 관한 별도 동의를 추가로 수령하였으며, 동의 거부 시에는 즉시 국외 이전을 중단하고 국내 리전 저장 또는 국외 이전이 수반되지 않는 대체 경로로 전환하였다.\n정보주체 권리는 앱 내에서 열람, 정정, 삭제, 처리정지, 동의 철회 및 국외 이전 거부를 신청할 수 있도록 제공하며, 본인확인 후 정해진 기한 내 처리하고 결과를 통지한다. 이용·제공 내역 또는 확인 방법을 주기적으로 안내한다. 개인정보 처리방침에는 처리 목적, 항목, 보유기간, 제3자 제공 현황(해당 시), 위탁 및 국외 이전 사항, 안전조치, 권리 행사 방법 등을 상시 공개하고, 변경 시 이용자가 쉽게 인지할 수 있도록 공지한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "REWRITTEN introduces new data items not mentioned in ORIGINAL (e.g., collecting minimal device information for error handling), which slightly expands the scenario beyond the original facts.", "fix": "Revise the sentence to make such collection optional and narrowly scoped without altering the core scenario. Replace: \"서버로 전송되는 항목은 특징값, 앱 설치 시 생성되는 지갑 ID, 오류 대응에 필요한 최소 단말 정보로 한정한다.\" With: \"서버로 전송되는 항목은 특징값과 앱 설치 시 생성되는 지갑 ID로 한정한다. 오류 대응이 필요한 경우에 한하여 단말 OS 버전 등 비식별 기술정보를 추가로 수집할 수 있으며, 수집 시 항목과 목적을 고지한다.\""}, {"aspect": "minimal_change", "issue": "REWRITTEN asserts a historical action not stated in ORIGINAL (retroactive collection of separate consent for past cross-border transfers), which changes historical facts rather than just controls.", "fix": "Rephrase to describe procedural remediation without asserting that past consents were already collected. Replace: \"과거 국외 이전이 선행된 경우에는 해당 내역을 개별 통지하고 국외 이전에 관한 별도 동의를 추가로 수령하였으며, 동의 거부 시에는 즉시 국외 이전을 중단하고 국내 리전 저장 또는 국외 이전이 수반되지 않는 대체 경로로 전환하였다.\" With: \"과거 국외 이전이 선행된 경우에는 해당 내역을 개별 통지하고, 국외 이전에 관한 별도 동의 절차를 마련하였다. 동의 거부 시 즉시 국외 이전을 중단하고 국내 리전 저장 또는 국외 이전이 수반되지 않는 대체 경로로 전환한다.\""}]}}
{"case_id": "2024-016-235", "respondent": "피심인", "case_content": "피심인은 가상자산 지갑 앱을 개발·운영하면서 서비스 제공 및 보안에 필요한 최소 항목만 수집한다. 필수 항목은 계정 식별용 연락수단(이메일 또는 휴대전화 중 택1), 이름(고객지원·본인확인이 필요한 경우), 기기 정보(모델, OS, 앱 버전), 지갑 주소 및 거래 관련 로그이며, 선택 항목(마케팅 수신 등)은 별도 동의로 분리한다. 수집 전 화면에서 목적, 항목, 보유·이용기간, 동의 거부권 및 거부 시 영향, 국외 이전 관련 사항(이전 항목, 국가·시기·방법, 이전받는 자의 명칭·연락처, 이용목적·보유기간, 거부 방법·효과)을 명확히 알리고 각각 동의를 받는다. 해당 내용과 변경 시 재동의가 필요한 사항은 전자우편 또는 앱 공지로 개별 안내하고, 개인정보 처리방침에도 구체적으로 공개한다.\n\n가입 단계에서는 이동통신사 본인확인 등으로 성인 여부를 확인하며, 검증 이전에는 계정 생성에 불필요한 개인정보를 저장하지 않는다. 성인 인증이 실패하거나 만 14세 미만으로 확인되는 경우 입력된 정보는 즉시 파기 또는 접수를 차단한다. 만 14세 미만 아동의 개인정보 처리가 필요한 별도 서비스가 있는 경우에는 법정대리인 동의 및 동의 확인 절차를 마련하여 운영한다.\n\n앱 설치 시 자동 생성되는 ID, 기기로 촬영·생성된 이미지 등 타사로부터 위탁받아 처리하는 데이터는 위탁 범위 내에서만 분리 영역에서 처리한다. 위탁 계약에는 처리 범위, 재위탁 제한, 기술·관리적 보호조치, 사고 통지, 점검·감독, 반환·파기 절차를 포함한다. 위탁 데이터는 전송·저장 시 암호화하고, 업무상 필요한 최소 인원에게만 개인별 계정을 통해 접근권한을 부여하며, 접속기록을 보관·점검한다. 위탁 종료 시 지체 없이 반환 또는 복구 불가능한 방식으로 삭제하고 이력을 기록한다.\n\n데이터는 해외 클라우드 및 해외 자회사에 처리를 위탁하거나 보관할 수 있으며, 국외 이전은 사전에 별도 동의를 받아 진행한다. 동의 화면과 처리방침에 이전 항목, 이전 국가·시기·방법, 이전받는 자의 명칭·연락처, 이용목적·보유기간, 거부 방법·효과를 구체적으로 표시한다. 이전 시 전송 구간은 암호화 채널을 사용하고 저장 데이터는 암호화하며, 키는 분리 관리한다. 해외 수탁자·자회사와는 안전조치, 권리행사 지원, 침해사고 통지, 분쟁 해결, 재이전 제한 등 보호조치를 계약에 반영한다. 이전 관련 사항이 변경될 때에는 사전 통지 후 재동의를 받는다.\n\n보유기간은 계정 관리 및 거래 기록 등 목적별로 최소 기간을 설정하여 운영하며, 법령에 따라 보존이 필요한 정보는 별도 분리 보관한다. 보유기간 경과 또는 목적 달성 시 전자정보는 복구 불가능한 방식으로 영구 삭제하고, 서면·이미지는 파쇄 또는 소각한다. 파기 대상·방법·이력은 기록·관리한다.\n\n안전조치를 위해 내부관리계획 수립·교육, 접근권한 최소화·정기 점검, 인증수단 적용, 침입탐지·차단 및 방화벽 운영, 전송·저장 암호화, 비밀번호 일방향 암호화, 접속기록 생성·보관 및 위변조 방지, 악성코드 탐지·갱신, 백업 데이터 암호화, 물리적 접근 통제 등을 실시한다. 정보주체는 열람, 정정·삭제, 처리정지, 동의 철회 및 국외 이전 관련 문의를 앱 내 채널·전자우편을 통해 신청할 수 있도록 절차를 제공하며, 변경·이용내역 통지가 필요한 경우 주기적 통지 방법을 안내한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "업무 위탁 관련 공개 의무가 명시되어 있지 않아 법 제26조제2항 및 시행령 제28조제2~3항의 ‘위탁하는 업무의 내용과 수탁자 공개’ 요건 충족이 불명확함.", "fix": "위탁 단락에 다음 문장을 추가: \"위탁하는 업무의 내용과 수탁자(명칭·연락처)는 인터넷 홈페이지 및 앱 내 공지에 지속적으로 공개하고, 변경 시 30일 이상 게시하거나 서면등의 방법으로 개별 통지한다.\""}, {"aspect": "legality", "issue": "개인정보 처리방침에 필수 기재사항 중 개인정보 보호책임자(또는 담당부서) 연락처 공개에 대한 언급이 없음(법 제30조제1항제6호, 시행령 제31조).", "fix": "처리방침 관련 문단에 다음 문장을 추가: \"개인정보 처리방침에는 개인정보 보호책임자 또는 개인정보 보호업무 담당 부서의 명칭과 전화번호·전자우편 등 연락처를 포함하여 공개한다.\""}, {"aspect": "legality", "issue": "개인정보 이용·제공 내역의 주기적 통지 의무(법 제20조의2) 이행 표현이 ‘필요한 경우 안내’로 모호함.", "fix": "마지막 문단의 해당 문장을 다음과 같이 교체: \"대통령령 기준에 해당하는 경우, 이 법에 따른 개인정보의 이용·제공 내역 또는 이를 확인할 수 있는 정보시스템의 접속 방법을 전자우편 등 서면등의 방법으로 주기적으로 통지한다.\""}]}}
{"case_id": "2025-201-22", "respondent": "인천관광공사", "case_content": "인천관광공사는 채용, 급여 지급, 4대 보험 신고 등 인사관리 목적을 명확히 하여 목적별 최소 항목만 수집·이용한다. 채용 단계에서는 신원 확인과 자격 검증에 필요한 최소 정보만 받으며, 입사 후 급여·세무·사회보험 처리를 위해 성명, 사번, 주소, 연락처, 급여계좌, 납세·사회보험 정보와 법령상 요구되는 경우에 한해 주민등록번호를 처리한다. 경력증명서 발급에는 성명, 생년월일, 재직기간, 부서·직위 등 필수 항목만 사용하며, 기념일·가족관계 등 부가 항목은 기본적으로 수집하지 않는다. 복지 안내 등 별도 목적이 있는 경우에 한해 선택 동의를 받아 분리 보관하고, 미동의 시 서비스 제공에 불이익이 없으며 언제든 철회할 수 있도록 한다.\n\n주민등록번호와 계좌정보 등 중요 정보는 저장 시 강한 암호화로 보관하고, 전송 시 암호화 채널을 사용한다. 개인정보 접근 권한은 인사·급여 처리 담당자에게만 최소한으로 부여하며, 개인별 계정과 인증수단을 적용한다. 대량 조회·반출은 승인 절차를 거치고, 개인정보처리시스템의 접속기록(접속일시, 처리내역 등)을 보관·점검하며 위·변조 방지 조치를 적용한다. 악성코드 대응 프로그램을 운영·갱신하고, 문서·매체는 잠금장치가 있는 구역에 보관한다.\n\n보유·파기는 목적 달성 또는 보유기간 경과 시 지체 없이 실시한다. 재직자는 재직 기간 동안 운영 DB에 보관하고, 퇴직 시 급여·세무·4대 보험 등 법정 보존 대상은 내부 기준(예: 3년 또는 5년)에 따라 암호화 상태로 분리 보관한다. 법정 보존 대상 외 항목은 즉시 파기하며, 보존기간 만료 시 전자 파일은 복구 불가능하게 영구 삭제하고, 종이 문서는 파쇄 또는 소각한다. 분리 보관 및 파기 이력은 기록·관리한다.\n\n2023. 9. 21. 퇴직자 A의 미지급 임금 지급 시에는 기존 급여계좌 정보를 임금지급 목적 범위에서만 사용하여 이체하고, 회계 증빙을 제외한 계좌정보는 보존 사유가 소멸되면 지체 없이 파기한다. 이후 임금채무 이행을 위한 공탁은 필요한 범위의 항목만 사용하여 진행한다. 공탁 실무는 외부 법률대리인에게 해당 업무로 한정하여 위탁하며, 위탁계약서에 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 반환·파기, 감독을 포함한다. 수탁자에게는 공탁 업무 수행에 필요한 성명, 주소, 주민등록번호 등 법원 요구 항목만 제공하고, 전송은 암호화된 방식으로 수행한다. 법원 제출 서류에는 필수 항목만 기재하며, 제공 내역(제공받는 자, 목적, 항목, 일시, 보유·이용 기간)을 기록·보관한다. 수탁자 계정은 개인별로 발급하고 접속기록을 점검하며, 정기적으로 관리·감독한다. 위탁 사실과 수탁자는 홈페이지에 공개한다.\n\n주민등록번호는 법령 등으로 불가피한 경우에 한해 수집하며, 저장 시 암호화한다. 제출 문서·이미지에 주민등록번호가 포함되지 않도록 사전 안내하고, 시스템에서 패턴 검사를 통해 포함 시 접수를 차단하거나 마스킹을 요구한다. 내부 처리에서는 주민등록번호 대신 사번 등 대체키를 사용한다.\n\n정보주체 권리 행사 창구를 통해 열람, 정정·삭제, 처리정지, 선택 동의 철회를 받을 수 있도록 절차를 운영한다. 개인정보 처리방침을 공개하고, 안전조치, 보유기간, 제3자 제공·위탁 현황 등을 주기적으로 갱신한다. 유출 등 사고 발생 시에는 통지·신고, 피해 최소화 조치, 재발 방지 대책 수립 절차에 따라 대응한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "선택(옵트인) 정보 수집에 대한 동의 고지 항목(목적, 항목, 보유·이용 기간, 동의거부권 및 불이익)이 법 및 시행령(법 제15조제2항, 영 제17조) 수준으로 명시되지 않음.", "fix": "다음 문장을 ‘복지 안내 등 별도 목적…’ 문장 직후에 추가: \"선택 동의를 받는 경우 동의서에 수집·이용 목적, 수집 항목, 보유·이용 기간, 동의를 거부할 권리 및 거부에 따른 불이익을 명확히 고지한다.\""}, {"aspect": "legality", "issue": "법원의 재판업무 수행을 위한 목적 외 제공(법 제18조제2항제8호)에 대하여 공공기관 해당 시 공개 의무(법 제18조제4항) 반영이 누락됨.", "fix": "다음 문장을 ‘법원 제출 서류에는 필수 항목만 기재하며… 기록·보관한다.’ 문장 뒤에 추가: \"공공기관에 해당하는 경우에는 법 제18조제4항에 따라 목적 외 이용·제공의 법적 근거, 목적 및 범위를 인터넷 홈페이지 등에 게재한다.\""}, {"aspect": "legality", "issue": "퇴직자 보존기간이 ‘내부 기준(예: 3년 또는 5년)’로만 기재되어 법정 보존 근거 및 기간 고지가 불명확함(법 제21조, 영 제16조).", "fix": "해당 문장을 다음과 같이 교체: \"퇴직 시 급여·세무·4대 보험 등 법정 보존 대상은 관련 법령(예: 상법·국세기본법 등)에 따른 보존기간(예: 5년)을 명시하여 암호화 상태로 분리 보관한다. 보존기간 경과 또는 보존사유 소멸 시 지체 없이 파기한다.\""}, {"aspect": "minimal_change", "issue": "원문에는 퇴직자 정보 중 생일·기념일·가족관계 등을 일부 보관한다고 되어 있으나, 재작성본은 ‘부가 항목은 기본적으로 수집하지 않는다’고 하여 원 시나리오의 정보 항목을 불필요하게 제거함.", "fix": "해당 문장을 다음과 같이 교체하여 원 시나리오를 유지하되 통제만 강화: \"경력증명서 발급에는 성명, 생년월일, 재직기간, 부서·직위 등 필수 항목만 사용하며, 기념일·가족관계 등 부가 항목은 기본 수집 대상이 아니나, 해당 항목이 필요한 서비스 제공 시에 한해 선택 동의 후 수집·이용하고 분리 보관한다.\""}, {"aspect": "minimal_change", "issue": "‘복지 안내 등 별도 목적’이라는 새로운 처리 목적을 추가하여 원 시나리오 범위를 불필요하게 확장함.", "fix": "해당 구절을 원 시나리오에 부합하도록 축소 또는 맥락 연결: \"(수정) 복지 안내 등 별도 목적 표현을 삭제하거나, ‘경력증명서 발급 등 정보주체 요청 처리’ 맥락으로 한정한다.\" 예: 기존 문장에서 ‘복지 안내 등 별도 목적이 있는 경우’ 부분을 ‘정보주체 요청에 따른 증명서 발급 등 특정 목적이 있는 경우’로 교체."}]}}
{"case_id": "2025-201-25", "respondent": "서산경찰서", "case_content": "서산경찰서는 범죄예방 및 수사 업무 수행을 위해 경찰청이 수집한 개인정보 중 사건 처리에 필요한 최소 항목(사건 식별번호, 관계자 성명, 연락수단, 사건 이력 등)만 열람·이용한다. 주민등록번호와 주소 등 고유식별정보·민감도가 높은 항목은 사건 처리에 불가피한 경우에 한해 접근을 허용한다. 개인정보는 경찰 내부 전산망의 전용 시스템에 저장 시 암호화하고, 주민등록번호 등은 별도 암호화 저장소에 분리 보관한다. 접근 권한은 역할 기반으로 최소화하며 개인별 계정과 다단계 인증을 적용하고, 조회·제공 이력과 접속기록을 1년 이상 보관·점검한다. 내부 부서 또는 타 기관 제공은 공식 공문, 보안 메일, 전용 시스템 등 암호화된 경로를 통해서만 수행하며, 제공받는 자의 소속·직무·사건번호를 확인하고 제공 목적·항목·보유기간을 문서로 명시한다. 유선 협조 요청은 즉시 제공하지 않고 기관 대표번호 재통화, 사전 등록 연락처 대조, 사건 담당자 확인 등 신원·권한 확인 절차를 거친 후 최소 정보만 안내하며, 주민등록번호 등 고유식별정보는 전화로 제공하지 않는다. 긴급한 생명·신체 보호 상황에서는 확인 가능한 범위에서 필요한 최소 정보만 공용 녹취 회선을 통해 제공하고, 제공 사유·항목·시간·담당자를 기록하여 사후 문서화 및 관리자 승인을 받는다. 위탁 시에는 처리 범위, 재위탁 제한, 보안 통제, 사고 통지, 반환·파기 절차 등을 포함한 계약을 체결하고 수행 점검과 교육을 실시한다. 보유기간 경과 또는 목적 달성 시에는 복구 불가능한 방식으로 파기하고, 다른 법령에 따른 보존 대상은 분리 보관한다. 유출 징후가 탐지되면 즉시 차단·조사하고, 정보주체 통지와 관계기관 신고를 정해진 기한 내에 수행한다. 내부관리계획에는 개인정보취급자의 역할·책임, 전화·대면 협조 요청 확인 절차, 권한 부여·회수, 점검·교육 주기 등이 문서화되어 있으며, 정기 교육과 자체 점검을 통해 운영한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "시행령 제30조의 필수 기술적/물리적 보호조치(침입 탐지·차단, 악성코드 방지, 물리적 보호, 접속기록 위·변조 방지)가 명시되지 않았고, 유출 통지·신고의 72시간 법정 기한과 신고 기준(1천명 이상, 민감/고유식별정보 유출, 외부 불법접근)이 구체적으로 표현되지 않았습니다.", "fix": "다음 문구를 관련 문장 뒤에 추가하거나 교체하십시오.\n- 접속기록 관련 문장 뒤에 추가: \"접속기록의 위·변조 방지 및 안전한 보관 조치를 적용한다.\"\n- 접근통제/보안 통제 단락에 추가: \"개인정보처리시스템에 대한 침입 탐지·차단 시스템을 운영하고, 악성코드 방지 프로그램을 설치·운영하며 주기적으로 갱신·점검한다. 개인정보의 안전한 보관을 위해 보관시설 마련 또는 잠금장치 등 물리적 보호조치를 적용한다.\"\n- 유출 대응 문장 교체: 기존 \"유출 징후가 탐지되면 즉시 차단·조사하고, 정보주체 통지와 관계기관 신고를 정해진 기한 내에 수행한다.\"를 다음으로 교체: \"유출 징후가 탐지되면 즉시 차단·조사하고, 법정 기한인 72시간 이내에 정보주체 통지(법 제34조) 및 한국인터넷진흥원/개인정보보호위원회 신고(영 제40조)를 수행한다. 신고 대상은 1천명 이상 유출, 민감정보·고유식별정보 유출, 외부 불법접근 등 기준에 해당하는 경우로 한다.\""}, {"aspect": "legality", "issue": "전송 구간 암호화(정보통신망을 통한 송수신 시 암호화)와 관련한 시행령 제30조 제1항 제4호 다목 수준의 요구가 암시적으로만 표현되어 있습니다.", "fix": "내부/외부 제공 경로 문장에 다음을 명시적으로 추가하십시오: \"정보통신망을 통한 개인정보 송수신 시에는 전 구간 암호화(예: TLS) 또는 이에 상응하는 조치를 적용한다.\""}, {"aspect": "minimal_change", "issue": "원문 시나리오에 위탁 처리 언급이 없는데, REWRITTEN에는 위탁 관련 계약·감독 등 상세 조치가 포괄적으로 추가되어 불필요한 범위 확장으로 보입니다.", "fix": "다음 문장을 삭제하거나 조건을 더 명확히 하십시오.\n- 삭제 권고: \"위탁 시에는 처리 범위, 재위탁 제한, 보안 통제, 사고 통지, 반환·파기 절차 등을 포함한 계약을 체결하고 수행 점검과 교육을 실시한다.\"\n- 또는 교체: \"해당 업무에 개인정보 처리 위탁이 존재하는 경우에 한해, 처리 범위, 재위탁 제한, 보안 통제, 사고 통지, 반환·파기 절차 등을 포함한 계약을 체결하고 수탁자 감독 및 교육을 실시한다.\""}]}}
{"case_id": "2025-201-24", "respondent": "청주흥덕경찰서", "case_content": "청주흥덕경찰서는 범죄 예방과 수사 등 직무 수행을 위해 경찰청 전산시스템에 전자적으로 저장된 주민 조회 정보를 업무에 이용하며, 이 정보에는 성명, 주민등록번호, 주소 등이 포함된다. 2024년 4월 27일 내부 사용자 계정으로 조회한 7명의 정보를 일반 유선전화 음성 통화로 파일 전송 없이 항목값을 낭독하여 통화 상대에게 제공하였다. 해당 제공은 무전기나 업무용 휴대전화가 아닌 유선 일반전화를 통해 이루어졌으며, 정보는 경찰청 전산시스템에 계속 보관되는 상태에서 접근 권한이 있는 직원이 조회하여 사용하였다. 이후 개인정보 포털에 신고하고 홈페이지에 관련 내용을 게시했으며, 정보주체에게 유선·문자·우편으로 통지하고 관련 공문 발송, 직원 교육 및 모의 대응훈련 계획 수립 등을 진행하였다.\n\n현재는 다음과 같이 개인정보 처리 및 통신 제공 과정을 운영한다. 사건 처리에 필요한 최소 항목(성명, 주민등록번호, 주소 등)만 조회·이용하며, 조회 시 사건번호와 사유를 입력한다. 개인정보취급자에게는 직무별 최소 권한을 개인 계정으로 부여하고 다중인증을 적용한다. 주민등록번호 등 고유식별정보는 저장 시 강한 암호화로 보호하고, 암호키는 별도 구간에서 분리 관리한다. 접속기록은 사용자, 일시, 열람·제공 내역과 사유를 포함하여 위·변조 방지 조치와 함께 보관·점검한다. 외부 제공이 필요한 경우 요청·승인 절차에서 법적 근거, 목적, 제공 항목, 보유기간을 명시하고, 제공은 내부 연계시스템 또는 업무용 보안 통신수단을 통해 최소 항목으로 전송한다. 일반 유선전화 등 보안이 확보되지 않은 수단의 구두 제공은 제한하며, 불가피한 경우 신원 확인, 항목 최소화, 주민등록번호 일부 자리 마스킹 등 통제를 적용하고 제공 내역과 사유를 기록한다. 데이터는 업무망을 통해서만 접근 가능하도록 하고, 저장 및 전송 구간 모두 암호화한다. 보유기간은 기록물 관리기준 및 수사 목적 달성 여부에 따라 설정하며, 기간 만료 또는 불필요 시에는 다른 개인정보와 분리 보관하거나 복구 불가능한 방식으로 파기하고 파기 결과를 기록한다.\n\n사고 대응은 다음과 같이 수행한다. 유출 등 사고 인지 시에는 확산 방지 조치 후 서면 등 가능한 방법으로 72시간 이내 정보주체에게 통지한다. 1천명 이상 유출, 민감정보 또는 고유식별정보 유출, 외부 불법접근으로 인한 유출 등 해당 기준에 해당하는 경우에는 72시간 이내 보호위원회 또는 한국인터넷진흥원에 신고한다. 통지·신고 시 구체적 항목이나 경위 확인이 완료되지 않은 경우에는 확인된 범위 내에서 우선 통지·신고하고, 추가 사항은 확인되는 즉시 추가 통지·신고한다. 공공시스템을 통한 무권한 접근 사실이 확인되는 경우에는 지체 없이 정보주체에게 해당 사실과 피해 예방을 위한 필요한 사항을 알린다.\n\n공공시스템운영기관·이용기관 기준에 해당하는 경우, 시스템별 안전성 확보 조치를 문서화하고, 이용기관이 정당한 권한을 가진 개인정보취급자에게 접근 권한을 부여·변경·말소할 수 있는 기능을 제공한다. 공공시스템 접속기록을 저장·분석·점검·관리하고, 공공시스템별 관리책임자를 지정한다. 규모와 특성에 따라 개인정보 안전관리 전담부서 또는 전담인력을 배치하고, 운영기관·수탁자·필요 시 이용기관으로 구성된 공공시스템운영협의회를 설치·운영하여 이행상황을 점검·개선한다. 시스템 유지보수 등 위탁이 필요한 경우 처리 범위, 접근통제, 재위탁 제한, 사고 통지, 반환·파기, 관리 현황 점검 및 책임에 관한 사항을 포함한 계약을 체결하고 정기 점검으로 감독한다. 임직원 대상 정기 교육과 비밀유지 서약을 시행하고, 내부 관리계획에 따라 권한 부여·변경·말소 관리, 표본 점검, 이상징후 모니터링을 수행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "구두(전화)로 제3자에게 개인정보를 제공하는 불가피한 예외 절차에서 제17조(제3자 제공) 및 제18조(목적 외 이용·제공)의 법적 근거 확인/고지 요건이 명시적으로 드러나지 않는다. 또한 제공 기록 항목이 법적 근거 및 필수 고지사항을 포괄하지 않는다.", "fix": "다음 문장을 현재 운영 절차에 추가: \"불가피하게 유선전화 등으로 구두 제공이 필요한 경우, 제공 전 제17조·제18조에 따른 법적 근거를 확인하거나(동의 근거 시) 제17조제2항 각 호의 사항[제공받는 자, 이용 목적, 제공 항목, 보유·이용 기간, 동의 거부권 및 불이익]을 정보주체에게 고지·확인한 후에만 제공한다. 제공 기록에는 제공받는 자, 제공 항목, 제공 일시, 법적 근거 또는 동의 여부, 보유·이용 기간, 제공 사유를 포함한다.\""}, {"aspect": "legality", "issue": "주민등록번호 처리 제한(법 제24조의2)에 대한 법적 근거 사용 범위가 명시되어 있지 않아, 고유식별정보 처리 요건 충족 여부가 불명확하다.", "fix": "데이터 항목 통제 부분에 다음 문구 추가: \"주민등록번호 등 고유식별정보는 법령에 따른 처리 사유에 해당하는 범위에서만 처리한다(개인정보 보호법 제24조의2).\""}, {"aspect": "legality", "issue": "개인정보 처리방침의 수립·공개(법 제30조) 및 동의 없이 처리 가능한 항목·법적 근거의 구분 고지(법 제22조제3항)가 운영 설명에 포함되어 있지 않다.", "fix": "마지막 운영 관리 단락에 다음 문구 추가: \"개인정보 처리방침을 수립·공개하고(법 제30조, 시행령 제31조), 동의 없이 처리 가능한 개인정보의 항목과 법적 근거를 동의를 받아 처리하는 개인정보와 구분하여 공개 또는 고지한다(법 제22조제3항).\""}]}}
{"case_id": "2023-007-069", "respondent": "방문요양서비스 시스템 운영 사업자", "case_content": "방문요양서비스 제공을 위해 시스템에서 환자 식별 최소 항목(성명, 생년월일, 연락수단)과 돌봄 계획·건강상태 등 서비스 수행에 필요한 민감정보, 방문 일정·제공 내역, 정산에 필요한 자료 등을 처리한다. 불필요한 항목은 수집하지 않으며, 목적 변경 시 합리적 관련성 범위에서 별도 고지·동의를 받는다. 건강정보 등 민감정보와 주민등록번호 등 고유식별정보는 다른 동의와 구분하여 별도로 동의를 받거나, 관련 법령에서 요구·허용되는 경우에 한해 처리한다. 수집·이용 시 목적, 항목, 보유·이용 기간, 동의 거부권 및 불이익 등 주요 고지사항을 명확하고 알아보기 쉽게 표시하여 알린 뒤 동의를 받는다.\n데이터는 전송 시 TLS로 보호하고, 저장 시 DB·백업을 강한 암호화로 보호한다. 주민등록번호 등 고유식별정보가 포함되는 경우 별도 영역에 암호화해 분리 보관하고, 암호키는 운영망과 분리된 키관리시스템에서 역할 기반으로 관리한다. 주민등록번호는 법령에서 구체적으로 허용되거나 불가피 요건에 해당하는 경우에만 처리하며, 그 외에는 처리하지 않는다. 운영·개발·시험 환경은 분리하고, 시험에는 가명·비식별 데이터를 사용한다.\n외부 네트워크 접근은 VPN과 다단계 인증을 적용하고, 접속 IP 제한, 세션 타임아웃, 비인가 단말 차단을 운영한다. 계정은 개인별로 발급하며 최소권한 원칙으로 역할 기반 권한을 부여하고, 권한 변경·말소를 즉시 처리한다. 비밀번호는 일방향 암호화로 저장하며, 정기적 권한 검토를 수행한다.\n접근통제와 침입 차단/탐지 체계를 운영하고, 악성코드 방지와 보안패치를 주기적으로 적용한다. 개인정보처리시스템의 접속일시, 사용자ID, 접속원, 처리내역 등의 접속기록을 최소 1년 이상 분리 보관하며, 위·변조 방지 조치를 적용하고 정기 점검한다. 중요 행위는 경보 및 모니터링 대상에 포함한다.\n보관기간은 서비스 제공 및 관련 법령상 의무 이행 범위에서 설정하며, 기간 만료 또는 목적 달성 시 지체 없이 파기한다. 전자파일은 복구 불가능한 방식으로 영구 삭제하고, 서면은 파쇄 또는 소각한다. 다른 법령에 따라 보존이 필요한 경우에는 본 데이터와 분리하여 저장·관리하며, 파기·보존 이력은 기록한다.\n클라우드·알림발송 등 처리 위탁 시 위탁 범위, 재위탁 제한, 기술·관리적 보호조치, 사고 통지, 점검·감독, 반환·파기 절차를 포함한 계약을 체결한다. 수탁자 보안수준을 사전 평가하고 정기 점검하며, 위탁 현황을 공개한다.\n유출 등 사고 대응을 위해 탐지·격리·복구 절차와 24시간 연락체계를 운영한다. 유출 사실을 인지하면 지체 없이 피해 최소화 조치를 실시하고, 정보주체에게 항목, 시점·경위, 대처 방법, 문의처를 서면 등으로 72시간 이내 통지한다. 연락처 확인이 어려운 경우에는 홈페이지 또는 사업장 게시로 갈음한다. 민감정보 유출, 대규모 유출 등 해당 시에는 보호위원회 또는 지정 전문기관에 72시간 이내 신고한다.\n정보주체는 열람, 정정·삭제, 처리정지, 동의 철회를 요청할 수 있으며, 전담 창구에서 신속히 처리한다. 내부관리계획을 수립·시행하고, 개인정보 보호책임자 지정, 취급자 범위 최소화, 정기 교육을 실시한다. 물리적 보안구역과 잠금장치를 마련하고, 방문자 출입을 통제한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "유출 통지/신고 요건이 대통령령의 명시 요건과 불완전하게 일치함. 현재 문구는 ‘민감정보 유출, 대규모 유출 등’으로만 기술되어 고유식별정보 유출 및 외부 불법적 접근에 의한 유출 등 대통령령 제40조의 신고 트리거가 특정되지 않음. 또한 연락처 부재 시 홈페이지 등 게시의 기간(30일 이상)이 명시되어 있지 않고, 미확인 시 우선 통지/신고 후 추가 통지/신고 절차(대통령령 제39조제2항, 제40조제2항)도 빠져 있음.", "fix": "해당 단락을 다음과 같이 교체:\n\"유출 사실을 인지하면 지체 없이 피해 최소화 조치를 실시하고, 정보주체에게 항목, 시점·경위, 대처 방법, 문의처를 서면 등으로 72시간 이내 통지한다. 연락처 확인이 어려운 경우에는 홈페이지 또는 사업장에 30일 이상 게시하여 갈음한다. 관련 사실 중 일부를 즉시 확인하기 어려운 경우에는 확인된 범위 내에서 우선 통지하고, 추가로 확인되는 내용은 확인 즉시 추가 통지한다. 다음 중 어느 하나에 해당하면 72시간 이내 보호위원회 또는 한국인터넷진흥원에 신고한다: (1) 1천명 이상의 정보주체에 관한 개인정보 유출, (2) 민감정보 또는 고유식별정보 유출, (3) 개인정보처리시스템 또는 개인정보 취급 기기에 대한 외부 불법적 접근으로 인한 유출. 이 경우 일부 사항을 즉시 확인하기 어려운 때에는 확인된 내용으로 우선 신고하고, 추가 확인 사항은 확인 즉시 추가 신고한다.\""}, {"aspect": "legality", "issue": "시험 데이터 표현에 ‘비식별’ 용어 사용은 현행 법령 체계(가명/익명)와 용어 불일치가 있음.", "fix": "문장 교체: \"운영·개발·시험 환경은 분리하고, 시험에는 가명·비식별 데이터를 사용한다.\" → \"운영·개발·시험 환경은 분리하고, 시험에는 가명정보 또는 익명 처리된 데이터를 사용한다.\""}, {"aspect": "legality", "issue": "개인정보 처리방침의 수립·공개(법 제30조, 영 제31조)에 대한 이행 문구가 부재하여 공개의무 충족 여부가 불명확함.", "fix": "권리 및 내부관리 관련 단락 말미에 문장 추가: \"개인정보 처리방침을 수립하고, 처리 목적, 항목, 보유기간, 제3자 제공, 파기절차, 안전조치, 권리행사 방법 등 주요 사항을 홈페이지 등으로 지속적으로 공개한다.\""}]}}
{"case_id": "2023-007-068", "respondent": "주택건설 및 분양사업자(피심인)", "case_content": "주택 분양 및 계약 업무를 위해 청약·계약 이행에 필요한 최소 항목(성명, 연락처, 주소, 계약번호, 납부정보)만 수집하며, 주민등록번호는 법령상 의무 이행이 필요한 경우에 한해 별도 저장소에 분리·암호화하여 처리한다. 수집은 전자계약서·신청서 및 대면 접수로 이루어지며, 전송 구간은 암호화 채널을 사용한다.\n개인정보처리시스템은 계정 개인별 발급과 최소권한 원칙으로 운영한다. 외부 접속은 VPN과 다단계 인증을 적용하고, 권한 부여·변경·말소 이력을 자동 기록·보관한다. 인사이동·퇴직 시 즉시 접근을 종료하며, 정기적으로 권한 적정성을 점검한다. 시스템 접속기록과 다운로드 이력(사유, 승인자, 대상 파일, 시각)은 위변조 방지하여 보관한다.\n고유식별정보 및 인증정보는 저장 시 암호화하며, 백업본도 동일 기준으로 보호한다. 대량 다운로드와 대외 반출은 사전 승인 및 사유 확인 절차를 거치며, 필요 시 워터마킹·USB 차단·파일 암호화 등 반출 통제를 적용한다. 문서·출력물은 마스킹 후 제공하고, 잠금장치가 있는 보관구역에 보관한다.\n분양대행사·공인중개사 등에게 업무를 위탁하는 경우 처리 범위, 재위탁 제한, 접근통제, 사고 통지, 점검, 반환·파기 절차를 포함한 계약을 체결하고, 계정을 분리하여 접속기록을 점검한다. 위탁 내용과 수탁자는 홈페이지에 공개한다. 제3자 제공이 필요한 경우에는 제공받는 자, 목적, 항목, 보유기간 등을 알린 후 동의를 받거나 법령 근거에 따라 최소 범위로 제공한다.\n보존기간은 계약 관리와 관련 법정 보존기간으로 한정하고, 기간 경과 또는 목적 달성 시 전자파일은 복구 불가능한 방식으로 삭제하고, 종이는 파쇄·소각한다. 법정 보존 사유가 있는 정보는 다른 개인정보와 분리보관한다. 파기 이력은 기록한다.\n정보주체 권리(열람, 정정·삭제, 처리정지, 동의철회) 행사를 위한 전담 창구를 운영하고, 서면·이메일·웹을 통해 접수하며 본인확인 후 기한 내 처리한다. 처리 방침과 국외이전 여부, 위탁 현황, 보안조치를 공개한다.\n임직원 대상 정기 교육을 실시하고, 취급자 범위를 최소화한다. 이상 징후 모니터링 및 악성코드 방지 프로그램을 운영한다. 유출 징후 인지 시 격리·회수 등 긴급조치 후 영향 범위를 확인하고, 정보주체 통지 및 관계기관 신고를 정해진 기한 내 수행하며, 재발 방지 대책을 시행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "법 및 시행령상 필수 고지/조치가 명시적으로 드러나지 않음. 구체적으로 (a) 동의 시 고지사항(목적, 항목, 보유기간, 동의 거부 권리 및 불이익) 고지가 명시되지 않았고(법 제15조제2항, 제17조제2항, 제18조제3항), (b) 개인정보 보호책임자 지정 및 내부관리계획 수립·시행·점검의 명시가 없음(법 제31조, 시행령 제30조제1항제1호), (c) 유출 통지·신고 기한 72시간의 명시가 없음(시행령 제39조, 제40조).", "fix": "다음 문구를 해당 단락에 추가 또는 치환하세요.\n- 수집·이용 동의 관련(첫 단락 끝에 추가): \"동의 시에는 수집·이용 목적, 수집 항목, 보유·이용 기간, 동의를 거부할 권리 및 거부에 따른 불이익을 명확히 고지하고 동의를 받는다.\"\n- 관리체계 관련(보안관리 단락에 추가): \"법 제31조에 따라 개인정보 보호책임자를 지정하고, 시행령 제30조에 따른 내부관리계획을 수립·시행·정기 점검한다.\"\n- 유출 대응 관련(마지막 단락의 ‘정해진 기한 내’ 표현 치환): \"유출 징후 인지 시 격리·회수 등 긴급조치 후 영향 범위를 확인하고, 정보주체 통지 및 관계기관 신고를 72시간 이내 수행하며, 재발 방지 대책을 시행한다.\""}, {"aspect": "minimal_change", "issue": "원 사례는 불법 판매 시도가 있었으나 REWRITTEN은 일반적 위탁 시나리오(분양대행사·공인중개사 위탁)를 광범위하게 도입하여 사업 범위를 확장한 인상이 있음. 불필요한 시나리오 확장으로 해석될 소지가 있다.", "fix": "위탁 관련 문구를 보다 중립적으로 축소하세요.\n- 기존 문장: \"분양대행사·공인중개사 등에게 업무를 위탁하는 경우 ... 위탁 내용과 수탁자는 홈페이지에 공개한다.\"\n- 수정 제안: \"외부 수탁자에게 분양 관련 업무를 위탁하는 경우 처리 범위, 재위탁 제한, 접근통제, 사고 통지, 점검, 반환·파기 절차를 계약에 포함하고, 수탁자 계정을 분리·접속기록을 점검한다. 위탁 내용과 수탁자는 홈페이지에 공개한다.\""}]}}
{"case_id": "2023-007-070", "respondent": "결혼중개 서비스 제공 사업자(피심인)", "case_content": "온라인 무료 전화상담 신청 화면에서는 상담 진행에 필요한 최소 항목만 입력받는다. 필수: 성명, 연락수단(휴대전화번호 또는 이메일). 선택: 희망 상담시간, 출생년도. 선택 항목을 입력하지 않아도 신청이 완료된다. 수집·이용 목적, 항목, 보유기간, 동의 거부 권리 및 불이익 유무를 화면에 명확히 안내한다. 마케팅 정보 수신은 별도 선택(옵트인)으로 분리하여 받으며, 미동의해도 상담 신청 및 서비스 이용에 영향이 없다. 동의 여부와 시점은 전자적 기록으로 보관한다. 입력 정보는 암호화된 채널로 전송되며 저장 시 암호화된다. 상담 목적 데이터와 마케팅 목적 데이터(수신 동의가 있는 경우에 한함)는 논리적으로 분리 보관한다. 접근 권한은 최소 필요 인원에게만 개인별 계정으로 부여하고, 인증수단을 적용한다. 개인정보처리시스템의 접속기록을 보관·점검하고 위조·변조 방지조치를 적용한다. 상담 데이터는 상담 완료 후 내부 보존기간 경과 시 자동 삭제하며, 삭제 이력을 기록한다. 마케팅 수신 동의는 화면 또는 고객센터를 통해 언제든 철회할 수 있으며, 철회 시 관련 데이터는 지체 없이 마케팅 저장소에서 삭제한다. 출력물·백업본은 동일 기준으로 관리하고 파쇄·영구삭제 등으로 파기한다. 제3자 제공이나 위탁이 필요한 경우에는 처리 범위, 보안통제, 재위탁 제한, 사고 통지, 반환·파기 등을 포함한 문서화와 공개를 통해 관리한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "제3자 제공과 위탁을 함께 언급하면서, 제3자 제공 시 필수적인 별도 동의 및 고지사항(받는 자, 목적, 항목, 보유·이용기간, 동의 거부 권리와 불이익 등: 법 제17조제2항, 제18조제3항; 시행령 제17조)이 명시되어 있지 않아, 필요 시 제3자 제공을 수행하는 경우의 적법성 확보가 불명확함.", "fix": "case_content의 마지막 문장을 다음과 같이 교체 또는 보완하세요: \"개인정보의 제3자 제공은 법령 근거가 있거나 정보주체의 별도 동의를 받은 경우에 한하여 수행하며, 제공받는 자, 제공 목적, 제공 항목, 보유·이용 기간, 동의 거부 권리 및 불이익 유무를 사전 고지하고 별도 체크박스로 동의를 받는다. 개인정보 처리업무의 위탁은 처리 범위, 보안통제, 재위탁 제한, 사고 통지, 반환·파기 등을 포함한 계약 체결과 공개로 관리한다.\""}]}}
{"case_id": "2023-007-071", "respondent": "학습 서적 출판사업자(피심인)", "case_content": "학습 서적 출판사업자(피심인)는 인사·급여 관리를 위해 내부 업무시스템을 운영한다. 재직 단계에서는 인사관리와 급여 지급에 필요한 최소 항목(성명, 생년월일, 입사일, 직무, 급여지급 관련 정보 등)만 수집·이용한다. 퇴직 처리 시점에 개인정보를 보존 필요 항목과 불필요 항목으로 구분하며, 불필요 항목은 즉시 파기한다. 법령상 보존이 필요한 항목(예: 성명, 생년월일, 입·퇴사일, 급여 및 세무 증빙 관련 정보)은 별도의 보존 영역에 분리 저장하고 이용 목적을 세무·노무 증빙으로 한정한다. 별도 보존 영역은 저장 시 암호화하고 전송은 암호화 채널을 사용하며, 접근 권한은 인사·재무 담당자에게만 최소권한으로 부여한다. 계정은 개인별로 발급하고 2단계 인증을 적용하며, 조회·다운로드 등 접속기록을 보관하고 위·변조 방지 조치를 적용한다. 보유기간은 처리를 위한 최소 기간과 관련 법령의 보존기간을 기준으로 시스템에 등록·관리하고, 기간 도래 시 자동 파기 배치가 실행된다. 전자파일은 복구 불가능한 방식으로 영구 삭제하고, 종이 문서는 파쇄 또는 소각한다. 백업본은 보존기간 만료에 맞춰 순차적으로 덮어쓰기 또는 분리 보관 후 접근을 차단하여 폐기한다. 분쟁 대응이나 세무조사 등으로 파기가 유예되는 경우 보존 사유와 기간을 메타데이터로 표시하여 추가 분리 관리하고, 사유 종료 즉시 파기한다. 주민등록번호 등 고유식별정보를 처리하는 경우 제출 단계에서 불필요 수집을 제한하며, 저장 시 암호화하고 접근을 별도로 통제한다. 파기 결과와 보존·파기 이력은 시스템에 기록되며, 보유현황과 파기 스케줄은 정기 점검한다. 위탁이 없는 자체 처리 원칙을 적용하되, 필요 시 위탁 시에는 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 반환·파기 절차를 계약에 포함하고 수행 현황을 점검한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 1}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "핵심 사실관계가 변경되었습니다. 원문은 ‘퇴직한 근로자 496명의 개인정보를 법정 보존기간 경과 후에도 시스템에 보관’한 상황을 설명하는데, REWRITTEN은 구체적 수(496명)와 원문 맥락을 삭제하고 전반적 내부통제 체계 소개로 대체했습니다.", "fix": "case_content를 원문의 맥락과 핵심 사실(업종, 시스템, 퇴직자 496명, 처리 항목)을 유지하되, 불필요 보관을 방지하는 통제와 파기 절차를 명시하는 형태로 교체하세요. 예시 교체문: \"학습 서적 출판사업자(피심인)는 인사·급여 관리를 위해 내부 업무시스템을 운영하며, 재직·퇴직 인원 관리 과정에서 퇴직한 근로자 496명의 개인정보(성명, 생년월일, 입사일·퇴사일 등)를 처리한다. 퇴직 처리 시 보존 필요 항목과 불필요 항목을 구분하고, 불필요 항목은 즉시 파기한다. 법령상 보존이 필요한 항목은 세무·노무 증빙 목적 범위에서 별도 보존 영역에 분리 저장하고, 보유기간은 관련 법령의 보존기간을 기준으로 시스템에 등록·관리한다. 보유기간 도래 시 원본과 백업을 포함하여 복구 불가능한 방식으로 자동 파기하며, 파기 결과와 보존·파기 이력을 시스템에 기록한다. 보존 영역은 저장·전송 시 암호화하고, 접근 권한은 인사·재무 담당자에게만 최소권한으로 부여하며, 계정은 개인별로 발급하고 2단계 인증을 적용한다. 조회·다운로드 등 접속기록을 보관하고 위·변조 방지 조치를 적용한다. 주민등록번호 등 고유식별정보는 불필요 수집을 제한하고 저장 시 암호화하며 접근을 별도로 통제한다. 위탁이 필요한 경우 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 반환·파기 절차를 계약에 포함하고 수행 현황을 점검한다.\""}, {"aspect": "minimal_change", "issue": "메타데이터 변경이 불필요하게 이루어졌습니다. 원문은 violated_articles에 ‘개인정보 보호법 제21조’를 명시했으나, REWRITTEN은 이를 공란([])으로 변경했습니다.", "fix": "violate_articles 값을 원문과 동일하게 복원하세요. 예: \"violated_articles\": [\"개인정보 보호법 제21조\"]"}]}}
{"case_id": "2023-017-216", "respondent": "피심인", "case_content": "송금 기능의 Send Money API는 가맹점이 수취인의 전화번호 또는 이메일을 제출하면 기존과 같이 수취 확인 화면에 정보를 표시하되, 표시 정보는 확인에 필요한 최소 범위(마스킹된 성명(예: 홍*동), 국가코드, 블러 처리된 프로필 썸네일)로 제한한다. 전체 표시가 필요한 경우에는 사전 동의한 이용자에 한한다. 내부 시스템은 제출된 연락처를 정규화·해시하여 등록된 수취인 식별자와 매칭하고, 수취 가능 여부와 일회용 송금 토큰을 함께 응답한다.\n별칭(마스킹된 성명)을 가맹점에 표시하기 위한 제3자 제공 동의가 필요한 경우, 제공받는 자(가맹점), 제공 목적(수취인 확인), 제공 항목(마스킹된 별칭), 보유·이용 기간(거래 확인 완료 시 또는 관련 법령상 보존기간 경과 시까지), 동의 거부 권리 및 거부에 따른 불이익(없음)을 사전에 알리고 동의를 받는다. 이용자는 별칭 공개 여부를 설정할 수 있다.\n수집 항목은 송금 처리에 필요한 최소 항목(수취인 연락처, 거래금액, 가맹점 요청 식별자)으로 제한한다. 연락처 원문은 저장하지 않고 솔트 적용 해시값으로 변환하여 별도 저장소에 분리 보관하며, 송금 토큰은 1회용·단기 유효로 발급되어 만료 즉시 폐기한다.\nAPI 접근은 가맹점별로 발급된 인증서 또는 서명키 기반 상호 인증과 시간기반 서명(timestamp·nonce) 검증을 요구하고, 전 구간 TLS를 적용한다. 저장 데이터는 암호화하며, 키는 전용 키관리시스템으로 분리 관리·주기 교체를 수행한다. 접근 권한은 역할 기반으로 최소화하고 개인별 계정을 부여하며, 권한 부여·변경·말소 이력을 기록한다.\n피심인은 API 호출 트래픽을 IP 기준으로 관리하여 사고 전에는 1초 1,000건·10초 4,400건·2분 190,000건을 기준으로 일시 차단했고, 사고 이후에는 1분 15건·6분 90/120건·1시간 360/720건으로 속도 제한을 강화하고 HTTP Header 서명·유효성 검증 및 재전송 방지를 추가하였다. 남용 방지를 위해 클라이언트·IP·서비스 단위로 이상행위 탐지와 자동 차단을 운영하며, 해당 탐지·차단 정책은 가맹점 계정의 API 접근 권한에 적용된다. 요청 헤더 유효성·서명 검증, 입력 값 검증도 함께 적용한다.\n개인정보처리시스템의 접속기록(접속일시, 처리내역 등)은 위변조 방지 방식으로 보관·점검한다. 거래 및 조회 로그는 보존기간 경과 또는 목적 달성 시 지체 없이 파기하며, 전자파일은 복구 불가능한 방식으로 삭제한다. 다른 법령에 따른 보존이 필요한 경우에는 다른 정보와 분리하여 저장·관리한다.\n클라우드 운영·알림 발송 등 처리 업무 위탁 시 처리 범위, 안전조치, 재위탁 제한, 사고 통지, 반환·파기 절차를 포함한 계약을 체결하고, 계정 관리·보고·점검 등으로 정기 감독한다.\n이용자에게는 수취 설정, 별칭 공개 여부 변경, 열람·정정·삭제·동의 철회 방법과 본인의 이용·제공 내역 확인 경로를 제공한다.\n유출 등이 확인되면 72시간 이내 정보주체에게 통지하고 보호위원회 또는 한국인터넷진흥원에 신고한다. 통지 또는 신고에 필요한 일부 구체 내용이 확인 중이어도 우선 통지·신고 후, 확인되는 즉시 추가 통지·신고한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "안전성 확보조치(시행령 제30조) 중 악성코드 방지 프로그램 운영 및 물리적 접근통제 조치가 명시되어 있지 않음.", "fix": "다음 문장을 보안 조치 단락에 추가: \"개인정보처리시스템 및 개인정보 취급 단말에는 악성코드 탐지·치료 프로그램을 설치하고 주기적으로 갱신·점검한다. 서버실·자료보관구역 등에는 출입통제장치 및 잠금장치를 설치하여 물리적 접근을 제한한다.\""}, {"aspect": "legality", "issue": "내부관리계획 수립·시행 및 정기 점검 등 시행령 제30조 제1항 제1호에 해당하는 조치가 명확히 기재되지 않음.", "fix": "보안 관리 단락에 다음 문장을 추가: \"내부 관리계획을 수립·시행하고, 접근권한 관리, 인증수단 운영, 침입 탐지·차단 등 안전조치 이행 현황을 정기 점검한다.\""}, {"aspect": "legality", "issue": "제3자 제공 동의에 관한 절차는 있으나, 시행령 제17조의 동의 방법 요건(구분된 동의, 명확한 표시, 전자적 기록 등)이 구체적으로 표현되지 않음.", "fix": "제3자 제공 동의 문단 말미에 다음을 추가: \"동의는 개별 체크박스 등 구분된 동의항목으로 전자적 방법(서면 포함)으로 받으며, 동의 내용을 명확히 표시하여 정보주체가 자유롭게 선택하도록 한다. 동의 내역은 전자적으로 기록·보관한다.\""}, {"aspect": "legality", "issue": "수집·이용 동의 시 고지사항(법 제15조 제2항)과 선택동의 분리 고지(법 제16조, 제22조)에 대한 명시가 부족함.", "fix": "수집 항목 문단에 다음을 추가: \"수집·이용 동의 시 법 제15조 제2항의 고지사항(목적, 항목, 보유·이용기간, 동의 거부권 및 불이익)을 명시하고, 필요한 최소 범위 외 선택 항목은 별도 선택 동의로 구분하여 받는다.\""}, {"aspect": "legality", "issue": "개인정보 이용·제공 내역의 정기 통지(법 제20조의2, 시행령 위임)에 관한 운영 방안이 미기재됨.", "fix": "이용자 권리 안내 문단에 다음을 추가: \"대통령령 기준에 해당하는 경우, 개인정보의 이용·제공 내역 또는 그 확인 방법을 정기적으로 정보주체에게 통지한다.\""}, {"aspect": "legality", "issue": "연락처가 확인 불가한 경우의 유출 통지 갈음 방법(시행령 제39조 제3항)이 명시되어 있지 않음.", "fix": "유출 통지·신고 문단 말미에 다음을 추가: \"정보주체의 연락처를 알 수 없는 등 정당한 사유가 있는 경우에는 홈페이지 30일 이상 게시 등 대통령령에 따른 방법으로 통지를 갈음한다.\""}]}}
{"case_id": "2023-017-216", "respondent": "피심인", "case_content": "피심인은 Microsoft 365 환경(Outlook 365, SharePoint)에 한국인 가맹점주 및 파트너의 이름, 업무용 이메일, 업무용 전화번호, 업무용 주소가 포함된 MS 오피스 파일 3건을 저장·관리하였다. 해당 개인정보는 가맹점·파트너 관리와 업무 커뮤니케이션을 위해 계약·등록 절차 및 문의 응대 시 수집하며, 수집 항목은 위 4개로 한정한다. 동의를 받는 경우, 수집·이용 목적, 수집 항목, 보유·이용 기간, 동의 거부권 및 불이익을 구분하여 알리고, 서면 또는 전자적 방식 등 시행령 제17조에 따른 방법으로 명확히 동의를 받는다. 피싱 메일을 통해 확보된 한 직원의 계정으로 다중요소 인증 승인이 이루어져 내부시스템에 접속되었고, 해당 파일들이 클라우드 상에서 열람되었다. 피심인은 인지 즉시 직원 메일함에서 피싱 메일을 제거하고, 링크를 클릭한 계정의 접근 권한을 차단·재설정했으며, 관련 계정과 파일에 대한 포렌식 분석을 수행하였다. 또한 이용자 통지문을 준비해 고지했고, 법 제34조 및 시행령 제39조에 따라 정보주체에게는 72시간 이내 통지를 완료했으며, 해당 사건은 시행령 제40조의 신고 요건(외부 불법 접근)에 해당하여 72시간 이내 보호위원회 또는 전문기관에 신고하였다. 외부 공유는 기본 차단하되 제3자 제공이 필요한 경우에는 법 제17조 및 시행령 제17조에 따라 제공받는 자, 목적, 제공 항목, 보유·이용 기간, 동의 거부권 및 불이익을 사전 고지하고 별도 동의를 받는다. 제3자 제공이 아닌 위탁의 경우에는 법 제26조 및 시행령 제28조에 따른 계약, 공개 및 감독 절차를 적용한다. 재발 방지를 위해 MFA 번호 일치, 의심 메일 차단, 조건부 접근, 접속기록 위·변조 방지 보관(1년 이상), 보유기간 만료 자료의 복구 불가능한 파기 등을 시행하였다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 2, "minimal_change": 2}, "pass": false, "problems": [{"aspect": "objectivity", "issue": "case_content includes legality claims and article citations (e.g., '법 제34조 및 시행령 제39조에 따라... 72시간 이내...', '시행령 제40조의 신고 요건... 해당하여', '법 제17조 및 시행령 제17조에 따라...', '법 제26조 및 시행령 제28조... 적용한다'), which go beyond neutral business description and factual steps.", "fix": "Remove legal justifications and keep only factual actions. Make the following edits: 1) Replace '또한 이용자 통지문을 준비해 고지했고, 법 제34조 및 시행령 제39조에 따라 정보주체에게는 72시간 이내 통지를 완료했으며, 해당 사건은 시행령 제40조의 신고 요건(외부 불법 접근)에 해당하여 72시간 이내 보호위원회 또는 전문기관에 신고하였다.' with '또한 이용자 통지문을 준비해 고지했고, 위원회 포털을 통해 신고하였다.' 2) Delete the entire sentence '동의를 받는 경우, 수집·이용 목적, 수집 항목, 보유·이용 기간, 동의 거부권 및 불이익을 구분하여 알리고, 서면 또는 전자적 방식 등 시행령 제17조에 따른 방법으로 명확히 동의를 받는다.' 3) Delete the entire sentence '외부 공유는 기본 차단하되 제3자 제공이 필요한 경우에는 법 제17조 및 시행령 제17조에 따라 제공받는 자, 목적, 제공 항목, 보유·이용 기간, 동의 거부권 및 불이익을 사전 고지하고 별도 동의를 받는다.' 4) Delete the entire sentence '제3자 제공이 아닌 위탁의 경우에는 법 제26조 및 시행령 제28조에 따른 계약, 공개 및 감독 절차를 적용한다.'"}, {"aspect": "minimal_change", "issue": "New policy content was introduced that was not in the original scenario (collection consent flow and limitation statement, third-party sharing/outsourcing procedures, time-bound 72시간 assertions). These are unnecessary expansions beyond the original business facts.", "fix": "Revert to the original scenario scope and retain only necessary handling/controls. Make the following edits: 1) Delete the entire sentence '해당 개인정보는 가맹점·파트너 관리와 업무 커뮤니케이션을 위해 계약·등록 절차 및 문의 응대 시 수집하며, 수집 항목은 위 4개로 한정한다.' 2) Apply the replacements/deletions listed in the objectivity fixes above to remove added third자 제공/위탁 policy statements and 72시간 legal assertions. 3) Keep the final remedial controls sentence but remove prescriptive/legal framing; if desired, simplify to '재발 방지를 위해 MFA 번호 일치, 의심 메일 차단, 조건부 접근, 접속기록 위·변조 방지 보관, 보유기간 만료 자료의 복구 불가능한 파기 등을 시행하였다.'"}]}}
{"case_id": "2023-017-216", "respondent": "피심인", "case_content": "피심인은 계정 로그인 후 화면에서 전화번호, 주소, 생년월일 등 개인정보가 표시되도록 운영하였다. 2022년 12월 6~8일 다수의 로그인 시도가 있었고, 그 중 336개 한국 이용자 계정에서 이름·생년월일·주소·핸드폰 번호가 확인될 수 있었다. 당시 총 2억 6,354만 건의 로그인 시도 중 약 96%는 차단되었다. 이후 특정 IP 또는 계정의 다중 로그인 시도를 1분 3건, 6분 4건, 1시간 5건 기준으로 제한하고 CAPTCHA를 적용하였다. 피심인은 선택적 보안 기능으로 2단계 인증을 제공하고 한국 이용자에게 기능을 안내하였다. 전화번호(12.9.), 주소(12.12.), 생년월일(12.16.)을 순차적으로 마스킹하였다. 다크웹 게시 여부를 모니터링하고 관련 통지 및 신고를 진행하였다. 자료 제출 과정에서 데이터 보존 정책상 일자별 세부 지표는 별도로 상시 유지하지 않는다고 설명하였다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 3}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "REWRITTEN에서 violated_articles 배열이 원본의 위반 조항 목록에서 빈 배열로 변경되어, 처리 시나리오 외 불필요한 변경이 발생함.", "fix": "violate_articles 필드를 원본과 동일하게 복원하세요. 예: \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제48조의2\", \"개인정보 보호법 제39조의4\"]"}, {"aspect": "legality", "issue": "법령·시행령상 요구되는 유출 통지·신고의 기한(72시간) 준수 여부가 명시되지 않고, 시행령 제30조의 안전성 확보 조치(접속기록 저장·점검, 침입 탐지·차단, 암호화 등) 이행 여부가 불분명함.", "fix": "case_content에 다음과 같이 문장을 보강하세요. 1) 통지·신고 기한 명시: \"다크웹 게시 여부를 모니터링하고 관련 통지 및 신고를 진행하였으며, 해당 통지 및 신고는 72시간 이내에 완료하였다.\" 2) 안전조치 명시: CAPTCHA·시도 제한 조치 서술 뒤에 \"또한 접속기록의 저장·점검, 침입 탐지·차단 및 암호화 등 법령상 안전성 확보 조치를 이행하였다.\"를 추가. 3) 지표 보존 문구 보완: 마지막 문장 뒤에 \"다만, 법령에 따른 접속기록 등 보안 관련 로그는 별도로 보관·관리한다.\"를 추가."}]}}
{"case_id": "2025-001-001", "respondent": "법원행정처", "case_content": "과거 운영 및 사고 경과: 피심인 법원행정처는 재판 관련 업무를 지원하는 시스템을 통해 소송 관련 전자문서를 PDF로 변환하여 내부 스토리지 서버에 보관했으며, 해당 파일에는 이름, 주민등록번호, 생년월일, 연락처, 주소 등 고유식별정보가 암호화 없이 저장되었다. 피심인은 인터넷가상화PC와 내부 ‘인터넷가상화웹서버’·스캔서버 연계를 위해 80포트와 45100포트를 개방하고, 인터넷AD 서버 관리자 계정과 취급자 계정의 초기 비밀번호를 그대로 사용하는 방식으로 운용했으며, 일부 서버는 백신 등 보안프로그램 없이 운영되었다. 2021년 6월부터 2023년 1월 사이 내부 스토리지의 데이터와 관련하여 외부 경유지 8대 서버와의 통신이 발생했고, 수사기관이 복원한 4.7GB(5,171개 파일)에는 진술서, 등기사항전부증명서, 건강보험자격득실확인서, 혼인관계증명서, 진단서 등 731종 10,089개 문서와 17,998명의 개인정보가 포함되어 있었다. 이후 피심인 법원행정처는 2023년 12월 7일 개인정보보호 종합포털 신고 및 홈페이지 공지와 함께 문자(4,161명)·우편(9,016명) 통지를 실시하고, 연락처 미확인자(4,821명)는 홈페이지 공지로 안내하였다.\n현재 운영 및 개선 조치: 법원행정처는 재판 관련 업무 지원 시스템에서 접수·송달·기록관리 등을 위해 제출된 전자문서를 PDF로 변환·보관한다. 사건 처리에 필요한 최소 항목(성명, 생년월일, 연락수단, 주소, 사건번호, 당사자·대리인 식별정보 등)만 수집한다. 주민등록번호 등 고유식별정보는 법률·대통령령·대법원규칙 등에서 구체적으로 허용된 경우에 한해 수집·처리한다. 전자적으로 보관하는 주민등록번호는 법령에 따라 암호화하여 저장한다. 진단서 등 민감정보는 법령에 근거가 있거나 정보주체로부터 별도의 동의를 받은 경우에 한해 처리하며, 분리 보관과 접근권한 분리 등 추가 보호조치를 적용한다.\n전송은 TLS로 암호화하고, 저장 시 주민등록번호 등 고유식별정보와 인증정보는 각각 강한 암호화 및 일방향 암호화로 보호한다. 화면 조회 시 주민등록번호 등은 마스킹하며, 원본 열람은 승인된 담당자에게만 제한한다.\n인터넷망과 업무망을 분리 운영한다. 인터넷가상화PC는 업무망과 논리적으로 분리하고, 파일 반입·반출은 승인된 게이트웨이에서 악성코드 검사와 콘텐츠 무해화 후 허용한다. 스캔서버·웹서버·문서저장소는 방화벽으로 내부 지정망에서만 접근을 허용하고, 서비스에 필요한 포트만 출발지·대상지 기준 화이트리스트 방식으로 최소 개방한다(예: 443 중심). 외부 통신은 프록시/방화벽을 통해 승인된 목적지로만 제한하며, 비인가 경유지와의 통신은 차단·모니터링한다. 관리 접속은 암호화 채널과 점프서버를 통해서만 허용한다.\n접근 권한은 직무별 최소권한·직무분리 원칙으로 부여하고 정기적으로 검토·말소한다. AD 및 시스템 계정은 개인별로 발급하며 초기 비밀번호는 즉시 변경하고 복잡성·주기적 변경을 적용한다. 관리자 계정은 분리 사용하고 다단계 인증을 적용한다. 개인정보처리시스템의 접속기록(계정, 일시, 처리내역, 원격지 IP 등)은 위변조 방지 조치로 분리 보관하며, 이상 징후를 탐지·점검한다. 파일 다운로드·반출·인쇄 등 행위 로그를 수집·보관한다.\n서버·PC에는 백신/EDR을 설치하여 최신 엔진으로 자동 갱신하고, 정기 취약점 점검과 패치를 수행한다. 불필요한 서비스와 계정은 제거하고, 매체제어·화면잠금 등 보안 기본설정을 중앙에서 적용한다. 중요 데이터는 전용 저장소에 보관하고, 백업 데이터는 별도 구역에 암호화 저장하며 복구 테스트를 주기적으로 수행한다.\n제출 단계에서 가능한 경우 주민등록번호 등 고유식별정보 가림을 안내하고, 업로드 시 패턴 검사로 불필요한 고유식별정보 포함을 경고·차단한다. 전자문서는 사건 진행 및 보존연한에 따라 분류·관리하며, 보존기간 만료 시 복구 불가능한 방식으로 파기하고(전자파일 영구삭제, 서면 파쇄/소각 등) 파기 이력을 기록한다. 법령 등으로 보존이 필요한 정보는 다른 개인정보와 분리 보관한다.\n문서 스캔, 문자·우편 발송 등 위탁은 처리 범위, 재위탁 제한, 접근통제, 암호화, 접속기록 보관, 사고 통지, 반환·파기 절차를 포함한 계약으로 수행하고, 제공 항목은 최소화한다. 수탁자에 대한 교육과 처리 현황 점검을 정기적으로 실시하며, 업무 종료 시 즉시 삭제·반환을 확인한다.\n개인정보 처리방침에 처리 목적, 항목, 보유기간, 제3자 제공·위탁 현황, 안전조치, 권리행사 방법과 연락처를 공개하고, 열람·정정·삭제·처리정지 요청 창구를 운영한다. 이상 징후 발생 시 즉시 격리·원인 분석·확산 방지 후 영향과 범위를 확인하여 정보주체에게 72시간 이내 통지하고, 보호위원회 또는 한국인터넷진흥원에 72시간 이내 신고하며, 노출 정보의 삭제·차단을 요청하고 재발 방지 조치를 이행한다. 개인정보취급자 범위는 최소화하고 정기 교육과 비밀유지 서약을 시행한다. 개인정보 보호책임자를 지정하여 내부 관리계획을 수립·이행 점검하고, 공공기관 기준에 해당하는 개인정보파일은 등록하며 필요 시 영향평가를 수행해 개선사항을 반영한다. 개발·시험 환경에서는 실제 개인정보를 사용하지 않고, 필요한 경우 가명처리 후 분리 관리한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "물리적 안전조치(시스템·자료 보관시설의 출입통제 및 잠금장치 등)가 명시되지 않아 시행령 제30조 제1항 제7호의 요구사항 충족 여부가 불명확함.", "fix": "보안조치 단락에 다음 문구를 추가: \"서버실·전산실·문서보관구역 등 물리적 보관시설에는 권한기반 출입통제(출입카드 등), 잠금장치, 방문기록 보관을 운영하고, 무단 반출 방지를 위해 CCTV 등 물리적 보호조치를 적용한다.\""}, {"aspect": "legality", "issue": "정보주체 이외로부터 수집 시 수집출처 고지(법 제20조) 및 이용·제공 내역 정기 통지 의무(법 제20조의2, 시행령 위임)가 명시되어 있지 않음.", "fix": "권리보장/처리방침 단락에 다음 문구를 추가: \"정보주체 이외로부터 개인정보를 수집한 경우, 정보주체의 요구 시 지체 없이 수집출처, 처리 목적, 처리정지권 및 동의 철회권을 고지한다. 또한 대통령령 기준에 해당하는 경우, 개인정보의 이용·제공 내역 또는 확인 방법을 정기적으로 정보주체에게 통지한다.\""}, {"aspect": "minimal_change", "issue": "원문에 기재된 violated_articles가 빈 배열로 변경되어 사건 시나리오 외 요소가 불필요하게 수정됨.", "fix": "다음과 같이 원문의 목록을 복원: \"violated_articles\": [\"개인정보 보호법 제24조\", \"개인정보 보호법 제24조의2\", \"개인정보 보호법 제29조\", \"개인정보 보호법 제34조\", \"개인정보 보호법 시행령 제30조\"]"}]}}
{"case_id": "2023-213-254", "respondent": "토익센터 홈페이지 운영 공공기관", "case_content": "토익센터 홈페이지 운영 공공기관은 온라인 회원관리와 시험 접수 안내를 위해 회원가입 시 필요한 최소 항목(성명, 아이디, 비밀번호, 휴대전화번호, 생년월일)만 수집한다. 선택 항목(예: 이메일, 알림 수신)은 별도로 분리하여 동의를 받으며, 미동의해도 서비스 이용에 제한이 없다. 입력·전송 구간은 암호화 채널(TLS)을 사용한다.\n\n수집 정보는 회원 데이터베이스에 저장하되, 인증정보는 별도 테이블에 분리하여 관리한다. 비밀번호는 솔트가 적용된 일방향 해시(예: bcrypt/Argon2)로 저장하며 관리자도 열람할 수 없다. 비밀번호 찾기 기능은 제공하지 않고, 본인 확인 후 일회용 토큰 기반의 재설정 절차로만 처리하며 토큰은 짧은 유효기간 후 폐기한다.\n\n저장 데이터와 백업은 암호화하여 보관하고, 암호키는 별도 키관리체계로 분리·관리하며 주기적으로 교체한다. 개인정보처리시스템 접근 권한은 업무상 필요한 최소 범위로 부여하고 담당자별 개별계정을 사용한다. 관리자 계정에는 다단계 인증을 적용한다. 접속기록(접속일시, 처리내역 등)은 위변조 방지 조치와 함께 보관·점검한다. 시스템에는 침입차단/탐지, 악성코드 방지 및 보안패치 관리를 적용하고, 물리적 보관구역에는 출입통제를 시행한다.\n\n보유기간은 회원 관리 및 시험 관련 서비스 제공에 필요한 기간으로 설정하고, 목적 달성 또는 탈퇴 시 지체 없이 복구 불가능한 방식으로 파기한다. 다른 법령에 따라 보존이 필요한 경우에는 해당 항목을 다른 정보와 분리하여 보관하며, 보존기간 종료 시 파기한다. 파기 결과와 이력은 기록한다. 장기 미이용 계정은 분리 보관 후 안내 절차를 거쳐 파기한다.\n\n시스템 유지보수 또는 호스팅을 위탁하는 경우, 위탁계약서에 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 점검·감독, 종료 시 반환·파기 등을 포함하고, 수탁자에 대한 접근권한 관리와 접속기록 점검을 수행한다. 위탁 현황은 홈페이지에 공개한다.\n\n정보주체는 홈페이지를 통해 열람, 정정·삭제, 처리정지·탈퇴를 요청할 수 있으며, 처리 결과를 통지한다. 개인정보 처리방침에 수집 목적, 항목, 보유기간, 안전조치 및 권리행사 방법을 게시하여 상시 확인할 수 있도록 한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "공공기관에 필수적인 개인정보파일 등록(법 제32조, 영 제33조) 및(해당 시) 개인정보 영향평가 절차(법 제33조, 영 제35조)가 명시되지 않았고, 개인정보 처리방침 기재 항목이 법/영의 필수사항(예: 개인정보 보호책임자 연락처, 파기절차·방법, 제3자 제공 등)에 비해 축약되어 있음. 또한 파기 방법이 시행령 제16조의 구체 기준(전자파일 영구 삭제, 서면 파쇄·소각)까지는 명시되지 않음.", "fix": "다음 문구를 case_content에 추가/수정:\n- [회원관리 단락 뒤 또는 위탁 단락 앞에 추가] “공공기관으로서 운영하는 개인정보파일은 법 제32조 및 시행령 제33조에 따라 보호위원회에 등록하고, 변경 시 지체 없이 갱신한다. 해당되는 경우 법 제33조 및 시행령 제35조에 따른 개인정보 영향평가를 실시하고 결과를 제출한다.”\n- [파기 단락 보강] 기존 문장 끝에 “전자적 파일은 복구 불가능한 방법으로 영구 삭제하고, 종이 등은 파쇄 또는 소각한다.”를 추가.\n- [처리방침 단락 교체] 기존 “개인정보 처리방침에 수집 목적, 항목, 보유기간, 안전조치 및 권리행사 방법을 게시하여 상시 확인할 수 있도록 한다.”를 다음으로 대체: “개인정보 처리방침에는 법 제30조 및 시행령 제31조에 따른 사항(처리 목적, 처리 및 보유기간, 제3자 제공(해당 시), 파기절차·방법, 처리위탁, 가명정보 처리(해당 시), 자동수집장치 운영(해당 시), 개인정보 보호책임자 연락처 등)을 포함하여 게시하고, 쉽게 확인할 수 있도록 한다.”"}, {"aspect": "minimal_change", "issue": "원문에는 없는 구체적 선택수집 항목 예시(‘예: 이메일, 알림 수신’)가 추가되어 필요 이상으로 수집 항목 변경으로 보일 수 있음.", "fix": "다음 텍스트 수정: “선택 항목(예: 이메일, 알림 수신)은 별도로 분리하여 동의를 받으며, 미동의해도 서비스 이용에 제한이 없다.”에서 괄호 부분을 삭제하여 “선택 항목은 별도로 분리하여 동의를 받으며, 미동의해도 서비스 이용에 제한이 없다.”로 수정."}]}}
{"case_id": "2023-213-248", "respondent": "○○○○○종합지원센터", "case_content": "○○○○○종합지원센터는 홈페이지 회원관리 및 온라인 서비스 제공을 위해 회원가입 시 필요한 최소 항목(성명, ID, 비밀번호, 이메일, 전화번호, 주소)만 수집하며, 자녀 정보(자녀명, 생년월일, 성별)는 맞춤형 서비스 제공을 위한 선택 항목으로 별도 동의를 받아 수집한다. 선택 항목 미동의 시에도 회원가입과 서비스 이용에 제한이 없다. 만 14세 미만 아동의 개인정보는 법정대리인의 동의를 받아 처리하며, 휴대폰 본인인증·아이핀 등의 수단으로 법정대리인 동의 여부를 확인한다.\n입력 정보는 TLS가 적용된 암호화 채널로 전송되며, 개인정보는 전용 회원 DB에 저장한다. 비밀번호는 솔트가 적용된 일방향 강도 높은 해시로 저장하고, 이메일·전화번호·주소 등 주요 식별정보는 저장 시 암호화한다. 자녀 정보는 별도 저장소에 분리 보관하고, 일반 회원 정보와 논리적으로 구분한다.\n개인정보처리시스템 접근 권한은 업무상 필요한 최소 범위로 개인별 계정에 부여하며, 권한 부여·변경·말소 절차를 운영한다. 개인정보 보호책임자를 지정하고, 개인정보의 안전한 처리를 위한 내부 관리계획을 수립·시행·정기 점검한다. 관리자 계정에는 다단계 인증을 적용하고, DB 계정은 최소 권한으로 설정하며, 운영 구간은 외부망과 분리한다.\n애플리케이션은 입력값 검증과 준비된 문장/ORM을 사용해 질의를 처리하고, 웹 방화벽과 침입 탐지·차단을 적용한다. 게시판 및 첨부파일 업로드는 확장자·콘텐츠 유형·용량 검증, 악성코드 검사, 임의 파일명 부여, 실행 권한 제거 및 웹루트 외 저장으로 통제한다. 개인정보처리시스템의 접속일시·처리내역 등 접속기록을 보관하고 무결성 보호 조치를 적용한다. 악성코드 방지 프로그램을 설치·갱신하고 정기 취약점 점검 및 보완조치를 수행한다. 백업 데이터는 암호화하여 별도 분리 저장하고 주기적으로 복구 테스트를 진행한다.\n보유기간은 가입 시 고지된 기간 및 내부 기준에 따라 최소로 설정하며, 기간 경과 또는 목적 달성 시 전자파일은 영구 삭제하고 서면 자료는 파쇄한다. 다른 법령에 따른 보존 대상은 분리 보관한다. 정보주체가 열람·정정·삭제·처리정지·동의 철회를 요청할 수 있도록 홈페이지에 절차를 제공한다. 홈페이지 유지보수 또는 데이터 보관을 위탁하는 경우에는 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 반환·파기, 감독 절차를 포함한 계약을 체결하고 수탁자 교육과 점검을 정기적으로 실시하며, 위탁 현황은 홈페이지에 공개한다. 유출 등이 발생할 경우 내부 대응계획에 따라 72시간 이내에 통지·신고하고, 노출 정보의 삭제·차단 및 추가 피해 방지 조치를 수행한다. 개인정보 처리방침에는 처리 목적, 항목, 보유기간, 제3자 제공 및 위탁 현황, 안전조치, 권리행사 방법 등을 지속적으로 공개한다.\n과거에는 비밀번호에 강도가 낮은 암호화 알고리즘을 적용하였고, 입력값 검증 및 게시판 파일 업로드 검증 등 접근통제 설정이 미흡하여 SQL 인젝션과 웹셸 업로드 경로를 통해 데이터베이스 접근이 가능한 상태였다. 이로 인해 회원 31,528건의 성명, ID, 비밀번호, 이메일, 전화번호, 주소 등이 웹 취약점을 통해 제3자에게 전송되어 외부 저장공간으로 복제되었으며, 사고 인지 후 이메일 통지 및 홈페이지 공지를 통해 관련 사실을 알렸다. 이후 위와 같은 안전조치를 도입·강화하였다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "The REWRITTEN record cleared violated_articles to an empty array, which unnecessarily alters the original case metadata beyond handling/controls. The original explicitly listed violations (PIPA Art. 29 and Decree Art. 30(1)).", "fix": "Restore the citations in the violated_articles field. Explicit edit: change \"violated_articles\": [] to \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제30조제1항\"]."}]}}
{"case_id": "2023-213-251", "respondent": "피심인(학교)", "case_content": "학급 배정 결과 공지는 학교 교육행정시스템의 학생 DB를 활용하여 배정표를 생성한 뒤, 학생·학부모 전용 포털에서 개별 열람 방식으로 제공한다. 배정에 필요한 최소 항목(학생번호, 성명)과 배정 결과(학년·반, 담임교사, 교실)만 처리하며, 생년월일, 성별, 성적 등은 공개·제공하지 않는다. 포털은 HTTPS로 전송되고 저장 데이터는 암호화되며, 본인 계정으로 로그인한 경우에만 본인 정보만 열람할 수 있다. 공개 홈페이지의 게시판에는 개인이 식별될 수 있는 자료를 게시하지 않으며, 게시 전 자동 검사로 주민등록번호·성명·생년월일·성적 등 패턴이 포함된 엑셀·문서의 업로드를 차단하고 담당자 2인 검토를 거친다. 교사 계정은 역할 기반으로 최소 권한을 부여하고, 관리자·게시 권한에는 다단계 인증을 적용한다. 포털 및 관리자 기능의 접속기록과 업로드·다운로드 이력은 1년 이상 보관·점검한다. 배정 결과 파일은 교내 업무망에서 분리 보관하고, 학년도 시작 후 정해진 기간 경과 시 전자파일은 복구 불가능한 방식으로 삭제하며, 백업본도 동일 기준으로 파기하고 파기 이력을 기록한다. 홈페이지·포털 운영을 수탁사에 맡기는 경우 처리 범위, 재위탁 제한, 암호화·접근통제 등 안전조치, 사고 통지, 반환·파기 절차를 계약서에 포함하고 정기 점검으로 이행 여부를 확인한다. 개인정보의 제3자 제공은 하지 않으며, 시스템 외부 반출이 필요한 경우 사전 승인 절차를 적용한다. 관련 직원에게 정기 교육을 실시하여 최소수집, 비공개 공지 원칙, 자료 파기 절차를 준수하도록 한다. 개인정보처리시스템에는 침입탐지·차단(IDS/IPS) 및 웹방화벽 등 접근통제 장비를 운영하고 정기 취약점 점검을 실시한다. 교사·관리자 PC 등 업무용 단말에는 악성코드 방지 프로그램을 설치하여 자동 업데이트·주기적 검사를 수행한다. 개인정보처리시스템의 접속기록은 위·변조 방지를 위해 별도 보안영역에 보관하며 무결성 점검을 실시한다. 서버실·자료보관구역에는 출입통제와 잠금장치를 적용하고 방문기록을 관리한다. 개인정보의 안전한 처리를 위한 내부관리계획을 수립·시행하고 정기 점검한다. 개인정보 보호책임자를 지정하여 개인정보 보호 계획 수립·교육·점검을 총괄하고, 개인정보 처리방침을 학교 홈페이지에 공개하여 열람·정정·삭제·처리정지 등 권리행사 방법을 안내한다. 학급 배정 관련 개인정보파일은 보호위원회에 등록·관리하고, 변경 시 지체 없이 갱신한다. 개인정보 유출 등이 발생한 경우 72시간 이내 정보주체 통지 및 보호위원회(또는 한국인터넷진흥원) 신고를 포함한 대응절차를 가동한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "유출 통지·신고 절차는 언급되었으나, 법 제34조 및 시행령 제39조·제40조가 요구하는 통지 필수 기재사항(유출 항목, 시점·경위, 피해 최소화 방법, 대응조치·피해구제, 담당부서 연락처)이 명시적으로 포함되어 있지 않음.", "fix": "case_content의 마지막 단락 근처에 다음 문장을 추가: \"개인정보 유출 통지 시에는 법령에 따라 유출된 개인정보의 항목, 유출 시점과 그 경위, 정보주체가 피해를 최소화하기 위해 취할 수 있는 방법, 개인정보처리자의 대응조치 및 피해 구제절차, 담당부서 및 연락처를 포함하여 72시간 이내 통지한다.\""}, {"aspect": "legality", "issue": "보유·파기 기준이 \"정해진 기간\"으로 모호하여 법 제21조 및 시행령 제16조 취지(불필요 시 지체없는 파기, 구체 기준 마련)와 기록 관리 명확성이 부족함.", "fix": "다음 문구를 구체화: 기존 \"학년도 시작 후 정해진 기간 경과 시 전자파일은 복구 불가능한 방식으로 삭제\"를 \"학년도 시작 후 7일 경과 시 전자파일은 복구 불가능한 방식으로 삭제하며(보유·이용 기간: 공지일로부터 7일), 백업본도 동일 기준으로 파기하고 파기 이력을 기록한다\"로 교체."}]}}
{"case_id": "2023-213-252", "respondent": "피심인(공공기관)", "case_content": "피심인(공공기관)은 청년임대주택 입주자 선정 업무를 수행하면서 신청 접수, 적격 심사, 선정 통지, 계약 체결을 위해 필요한 최소한의 항목(성명, 생년월일, 연락수단, 신청번호, 자격요건 확인 정보)을 수집한다. 배정 호실 정보는 최종 선정 및 계약 단계에서만 처리하며, 대기자 정보는 선정 관리 데이터와 분리 보관한다.\n수집된 정보는 내부 입주자선정 시스템에 저장되며, 전송 구간은 암호화하고 저장 데이터는 암호화해 보관한다. 접근 권한은 담당 부서의 개인별 계정에 최소 권한으로 부여하고, 권한 부여·변경·말소 이력을 기록·관리한다. 시스템 접속기록(접속 일시, 처리 내역 등)은 위·변조 방지 조치와 함께 보관·점검한다. 악성코드 방지, 보안패치 적용, 물리적 출입통제 등 안전조치를 운영한다.\n선정 결과는 개별 통지(문자, 이메일) 또는 본인확인 절차를 거친 신청자 포털에서만 열람하도록 제공한다. 홈페이지 등 외부 공개가 필요한 경우에는 개인 식별이 불가능한 형태(신청번호 또는 통계값)로만 게시하며, 성명·전화번호 등 식별정보는 포함하지 않는다. 문서 게시 전에는 자동 검출(전화번호·주민번호 패턴 등)과 담당자 이중 검토 절차를 통해 개인정보 포함 여부를 점검하고, 포함 시 업로드를 차단하거나 비식별 처리 후 게시한다. 외부에서 직접 URL로 접근하거나 검색 노출되지 않도록 접근통제를 적용한다.\n업무 위탁(홈페이지 운영, 메시지 발송 등)이 필요한 경우 위탁 범위, 재위탁 제한, 암호화·접근통제 등 안전조치, 사고 통지, 반환·파기 절차를 포함한 계약을 체결하고, 수탁자 계정 분리 발급, 점검 및 교육으로 처리 현황을 감독한다.\n보존기간은 심사·이의제기 처리 등 목적에 필요한 기간으로 설정하며, 기간 만료 또는 목적 달성 시 지체 없이 파기한다. 전자파일은 복구 불가능한 방식으로 삭제하고, 종이 문서는 파쇄 또는 소각한다. 다른 법령에 따라 보존이 필요한 경우에는 본 파일과 분리하여 저장·관리한다.\n개인정보파일을 등록·관리하고, 처리방침과 권리행사 방법(열람, 정정·삭제, 처리정지 등)을 공개한다. 노출 또는 유출이 확인되는 경우에는 확산 방지 조치를 즉시 수행하고, 통지·신고 및 재발 방지 조치를 내부 절차에 따라 진행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "유출 통지·신고의 기한(72시간)과 신고 요건(1천명 이상, 민감/고유식별정보 유출, 외부 불법접근 등)에 관한 시행령 요구사항이 구체적으로 명시되어 있지 않음.", "fix": "case_content의 유출 대응 문단 끝에 다음을 추가: 유출 또는 노출이 확인된 경우 72시간 이내 정보주체에게 통지하고(정당한 사유가 있는 경우에는 사유 해소 즉시), 1천명 이상 유출, 민감정보 또는 고유식별정보 유출, 외부 불법접근에 의한 유출의 경우 72시간 이내 보호위원회 또는 전문기관에 신고한다."}, {"aspect": "legality", "issue": "처리의 법적 근거와 동의 없이 처리되는 항목의 구분 고지(법 제15조, 제22조제3항)가 구체적으로 드러나지 않음.", "fix": "case_content 수집·이용 관련 문단에 다음을 추가: 수집·이용의 법적 근거는 공공기관의 소관 업무 수행(법 제15조제1항제3호)이며, 동의 없이 처리되는 항목과 그 법적 근거를 처리방침 및 고지문에 구분하여 명시한다(법 제22조제3항)."}, {"aspect": "legality", "issue": "민감정보 및 고유식별정보(주민등록번호 등) 처리 제한과 전자적 보관 시 암호화 의무에 대한 명시가 부족함.", "fix": "case_content에 다음을 추가: 민감정보는 원칙적으로 수집하지 않으며 법령 근거 또는 별도 동의가 있는 경우에만 처리한다. 주민등록번호 등 고유식별정보는 법령에서 요구 또는 허용되는 경우에 한해 처리하며, 전자적으로 보관하거나 전송하는 경우에는 암호화한다(법 제24조, 제24조의2 및 영 제30조)."}, {"aspect": "legality", "issue": "인증정보 보호 등 세부 기술적 조치(예: 비밀번호 일방향 암호화)가 구체화되어 있지 않음.", "fix": "case_content의 안전조치 문단에 다음을 추가: 신청자 포털 등에서 사용하는 비밀번호는 일방향 암호화 방식으로 저장하고, 인증수단 관리 기준을 수립·운영한다(영 제30조제1항제4호가목·나목)."}]}}
{"case_id": "2023-213-250", "respondent": "피심인 조합", "case_content": "피심인 조합은 조합원 자격 유지 여부 확인을 위해 2021.3.18.~2022.2.25. 동안 자격 점검에 필요한 최소 항목(성명, 조합원/고객번호, 소속 지사, 가입일, 자격 상태, 연락수단 1개)을 수집·이용하여 1,924명 정보를 처리한다. 생년월일, 성별 등 불필요한 항목은 수집하지 않으며, 주소는 현황 확인이 필요한 경우에 한해 입력받는다. 수집 정보는 중앙 관리 시스템에 저장되며 저장 시 암호화되고, 전송은 내부망 내 암호화 채널을 사용한다.\n자격 점검은 13개 지사무소별로 분리된 조회 화면을 통해 수행하며, 지사 실태조사 담당자는 자신의 지사 소속 조합원 정보만 열람할 수 있다. 비상임이사와 조합원 본인에게는 열람 목적에 맞춘 최소 범위(예: 성명과 주소 또는 자격 상태)만 마스킹 처리된 형태로 제공된다. 동일 파일의 광범위 공유나 일괄 다운로드는 제한하고, 다운로드·출력은 승인 기반으로 관리한다.\n접근 권한은 역할 기반으로 부여·변경·말소되며, 담당자별 개별 계정과 다단계 인증을 사용한다. 개인정보처리시스템의 접속기록(접속 일시, 처리 내역 등)을 보관하고 위조·변조 방지 조치를 적용하며, 이상 징후를 주기적으로 점검한다. 개인정보취급자 범위는 최소화하고 정기 교육을 실시한다.\n출력이 불가피한 경우 문서 식별번호를 부여해 반출·보관 이력을 기록하며, 잠금장치가 있는 보관시설에 보관한다. 점검 종료 또는 보존기간 만료 시 전자파일은 복구 불가능한 방식으로 영구 삭제하고, 출력물은 파쇄로 파기한다. 법령상 보존이 필요한 자료는 본문 데이터와 분리하여 별도 저장·관리한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "시행령 제30조의 안전조치 중 일부가 명시적으로 드러나지 않아(악성코드 방지, 침입 탐지/차단, 방화벽, 내부관리계획 수립·시행, 서버실 등 물리적 접근통제, 인증정보의 일방향 암호화) 법/시행령 동시 충족이 불명확합니다.", "fix": "보안 통제 단락(접근 권한·접속기록·교육을 서술한 문단) 말미에 다음 문장을 추가하십시오: \"개인정보처리시스템 및 업무용 단말기에 악성코드 방지 프로그램을 설치·운영하고 최신 엔진으로 주기적으로 갱신·점검한다. 방화벽 및 침입 탐지·차단 시스템을 적용하여 비인가 접근을 차단하고, 보안 패치를 정기적으로 적용한다. 서버실 등 개인정보 보관설비에는 출입통제 등 물리적 보호조치를 적용한다. 내부관리계획을 수립·시행하고 이행 여부를 정기 점검한다. 인증정보(비밀번호 등)는 일방향 암호화로 저장한다.\""}]}}
{"case_id": "2023-213-249", "respondent": "○○○○○종합지원센터", "case_content": "센터는 홈페이지 회원관리 시스템을 통해 장난감 대여 및 예약 운영을 목적으로 지점명, 이름, 회원 ID, 휴대전화번호, 회원카드번호(필요 시), 가입일·종료일, 예약정보 등 서비스 제공에 필요한 최소 항목만 수집한다. 수집 시 목적, 항목, 보유기간, 거부권 및 불이익 여부를 고지하고, 알림·예약 안내 문자 수신은 서비스 이용과 분리된 선택 동의로 운영한다.\n데이터는 전송 구간과 저장 시 모두 암호화하며, 비밀번호는 일방향으로 저장한다. 연락처와 카드번호 등 주요 식별 값은 필드 단위로 암호화하고 화면 표시 시 일부를 마스킹한다. 알림 수신 동의 정보와 서비스 이용 정보는 논리적으로 분리 보관한다. 백업본은 별도 암호화 저장소에 보관하고 주기적으로 무결성과 복구 가능성을 점검한다.\n관리자페이지는 계정별 역할 기반 권한으로 운영하고 다단계 인증을 적용한다. 접근 권한은 담당 업무 범위로 최소화하여 부여·변경·말소하고 정기 점검을 실시한다. 관리자페이지와 API 전 구간에 인증·인가 검사를 공통 모듈로 적용하며, 세션 타임아웃과 자동 로그아웃을 설정한다. 외부 노출을 방지하기 위해 관리자 경로 은닉, IP/네트워크 제한, 웹방화벽과 침입 차단을 적용한다. 검색엔진 수집 방지를 위해 인증 전 구간 차단, noindex 헤더 및 robots 정책을 적용하고 디렉터리 리스팅을 금지한다. 시스템 접속기록과 주요 처리 로그를 보관·점검하며 위변조 방지 조치를 적용한다. 서버와 업무 단말에는 악성코드 방지 프로그램을 설치·갱신한다. 내부 관리계획을 수립·시행하고 관련 교육 및 정기 점검을 수행한다.\n문자 발송은 안내·예약 알림 등 목적에 한정하며, 발송 대행사를 사용하는 경우 처리 범위, 재위탁 제한, 암호화·권한관리 등 보안 통제, 사고 통지, 반환·파기 및 감독 절차를 포함한 위탁 계약을 체결한다. 전송은 암호화된 API로 수행하고, 위탁 현황을 공개하며 이행 여부를 주기적으로 점검한다.\n개발·배포는 운영환경과 분리된 시험환경에서 수행하며, 시험 데이터는 가명 또는 더미 데이터로 사용한다. 배포 전 소스 점검과 웹취약점 진단을 실시하고, 조치 완료 후 배포한다. 운영 변경은 승인 절차와 기록으로 관리한다.\n보존기간은 이용계약 기간 및 관련 기준에 따라 설정하고, 기간 경과 또는 목적 달성 시 지체 없이 파기한다. 전자파일은 복구 불가능한 방식으로 삭제하고, 법정 보존이 필요한 경우에는 다른 개인정보와 분리 보관한다. 파기 내역과 보관 사유는 기록한다.\n정보주체는 홈페이지·전화 등으로 열람·정정·삭제·처리정지·동의 철회를 요청할 수 있으며, 요청은 정해진 절차에 따라 처리한다. 사고 대응 계획을 마련하고, 노출 사실 인지 시 정보주체 통지 및 관계기관 신고, 유출등 인지 시 72시간 이내 정보주체에게 통지하고(연락처 확인 불가 시 홈페이지 30일 이상 게시), 1천명 이상 유출, 민감정보·고유식별정보 유출 또는 불법적 외부 접근에 따른 유출인 경우에는 72시간 이내 한국인터넷진흥원(KISA)에 신고한다. 피해 최소화 조치와 재발 방지 대책 수립·기록을 수행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 2}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "The rewritten case_content removes core incident facts (record counts, dates, exposure mechanism) and converts the scenario into a generic compliance policy, materially altering the original business scenario and narrative.", "fix": "Reintroduce the original incident details and timeline, and present the added controls as post-incident remediation rather than replacing the scenario. Replace the opening of case_content with: \"센터는 홈페이지 회원관리 시스템을 통해 장난감 대여 및 예약 운영을 목적으로 지점명, 이름, 회원 ID, 휴대전화번호, 회원카드번호(필요 시), 가입일·종료일과 예약 관련 정보 등 4,292건과 예약 관련 11건을 수집·보유하고, 관리자페이지에서 조회되는 형태로 데이터베이스에 저장·운영하였다. 2021-11-10 문자발송 및 장난감 대여 기능 개발·적용 과정에서 관리자페이지의 접근권한 확인 기능이 미적용되어 로그인 없이 특정 URL로 접근이 가능했고, 일부 화면은 검색엔진 크롤러에 의해 수집·색인되어 4,303명의 이름, ID, 휴대전화번호, 회원가입일 등이 외부에서 열람될 수 있는 상태였다. 센터는 즉시 홈페이지 차단, 관리자 권한 확인 기능 추가, 웹취약점 점검·보완을 실시하고, 2021-11-11 문자·이메일·등기로 정보주체에게 통지하며 유출신고와 조치 내역을 기록·관리하였다.\" Then introduce the new controls with a lead-in such as: \"재발 방지를 위해 다음과 같은 보완조치를 적용한다:\" and keep the existing control measures that follow."}, {"aspect": "minimal_change", "issue": "violated_articles was cleared, removing the original cited provisions and changing the case outcome.", "fix": "Restore violated_articles to match the original record: \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제30조제1항\"]. If you wish to indicate remediation, add such details in case_content as post-incident measures, but do not alter the violation list."}]}}
{"case_id": "2023-213-253", "respondent": "피심인 공공기관", "case_content": "피심인 공공기관은 ○○○○정보시스템을 통해 강의실 예약·사용 관리와 통학버스 예약·승차 관리를 수행한다. 처리 목적 수행에 필요한 최소 항목만 수집하며, 강의실 관리에는 학번(또는 교직원번호), 성명, 연락수단, 예약일시·공간, 이용상태를, 버스 관리에는 학번(또는 교직원번호), 성명, 노선·출발캠퍼스, 이용일자·시간, 예약번호·인증번호, 승차 여부를 사용한다. 주민등록번호 등 불필요한 고유식별정보는 수집하지 않는다. 전송 구간은 암호화 채널을 사용하고, 저장 시 연락처·인증번호 등 주요 항목은 암호화하여 보관한다.\n시스템은 역할 기반으로 메뉴와 데이터 범위를 분리한다. 사회복무요원에게는 조회·현황 확인 등 업무 수행에 필요한 최소 메뉴만 부여하고, 경비 근무자는 승차 확인 화면에서 마스킹된 정보로 본인 여부만 확인한다(예: 학번 뒤 4자리, 연락처 일부 마스킹). 전자단말을 통한 확인을 원칙으로 하며, 불가피하게 출력하는 경우에는 사유와 출력자, 출력 범위를 기록하고, 출력물에는 민감 항목을 마스킹하여 표시한다. 출력물은 지정된 수령자에게만 전달되며, 업무 종료 즉시 회수하여 파쇄한다.\n계정은 개인별로 발급하며 공유를 금지한다. 발급·변경·말소 기준을 운영하고, 근무·소집해제·부서이동 등 신분·직무 변경 시 계정이 자동으로 비활성화되도록 인사 정보와 연동한다. 접속은 개인별 인증수단으로 통제하고, 장기 미사용 계정은 잠금 처리한다. 접근기록(접속일시, 계정, 처리 내역 등)은 위·변조 방지 기능으로 안전하게 보관·점검한다. 사회복무요원 및 관련 취급자는 투입 시 비밀유지 서약과 개인정보 보호 교육을 이수하고, 처리지침에 따라 작업한다.\n보유기간은 예약·승차 확인 등 목적 달성 후 최소 기간으로 설정하여 자동 삭제하며, 민원 대응 등 정당한 사유로 추가 보관이 필요한 경우에는 일반 데이터와 분리하여 보관한다. 파기는 전자파일은 복구 불가능한 방식으로 영구 삭제하고, 종이 문서는 즉시 파쇄한다. 파기 이력은 기록·관리한다.\n시스템 운영부서를 지정해 내부관리계획에 따른 점검·개선, 권한 검토(정기 접근권한 재검토 포함), 취약점 점검, 악성코드 탐지·치료, 침입 탐지·차단, 물리적 접근 통제를 수행한다. 정보주체는 포털·창구를 통해 열람, 정정·삭제, 처리정지 요청 및 수집·이용 내역 확인 방법을 안내받고 요청할 수 있다. 제3자 제공은 법령 근거가 있거나 사전 고지된 범위에서만 수행하며, 시스템 운영·유지보수를 외부에 위탁하는 경우 위탁계약에 처리범위, 재위탁 제한, 안전조치, 사고 통지, 점검, 반환·파기 절차를 포함하고, 수탁자 교육·감독을 실시한다. 처리방침과 개인정보파일 등록을 통해 처리 목적, 항목, 보유기간, 제3자 제공 및 위탁 현황을 공개한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 3}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "핵심 시나리오 용어가 원문과 다르게 확장/변경됨(“강의실 예약·사용 관리”, “통학버스 예약·승차 관리” 등).", "fix": "첫 문장을 원문과 동일한 업무 범위로 환원: 현재 문장 '피심인 공공기관은 ○○○○정보시스템을 통해 강의실 예약·사용 관리와 통학버스 예약·승차 관리를 수행한다.'를 '피심인 공공기관은 ○○○○정보시스템을 통해 강의실 관리와 버스 승차 관리를 수행한다.'로 교체."}, {"aspect": "minimal_change", "issue": "수집·이용 항목이 원문 대비 불필요하게 변경/추가됨(교직원번호, 노선, 예약번호, 승차 여부 등 추가; 학과, 순번 등 누락).", "fix": "해당 문장을 원문 항목 중심으로 정렬: 현재 문장 '처리 목적 수행에 필요한 최소 항목만 수집하며, 강의실 관리에는 학번(또는 교직원번호), 성명, 연락수단, 예약일시·공간, 이용상태를, 버스 관리에는 학번(또는 교직원번호), 성명, 노선·출발캠퍼스, 이용일자·시간, 예약번호·인증번호, 승차 여부를 사용한다.'를 다음으로 교체: '처리 목적 수행에 필요한 최소 항목만 수집하며, 강의실 관리에는 성명, 학번, 학과, 연락처, 캠퍼스, 사용일시를, 버스 승차 관리에는 성명, 학번, 출발캠퍼스, 출발일자·시간, 순번, 인증번호를 사용한다.'"}, {"aspect": "minimal_change", "issue": "원문에 없던 광범위한 거버넌스·권리안내·제3자 제공/위탁 일반론이 추가되어 시나리오 범위를 불필요하게 확장함.", "fix": "말미의 일반 규정성 문단을 삭제하여 본 시나리오(강의실/버스 관리) 관련 처리 및 통제에 한정: '정보주체는 포털·창구를 통해 열람, 정정·삭제, 처리정지 요청 및 수집·이용 내역 확인 방법을 안내받고 요청할 수 있다.'로 시작하여 '처리방침과 개인정보파일 등록을 통해 처리 목적, 항목, 보유기간, 제3자 제공 및 위탁 현황을 공개한다.'로 끝나는 문단 전체를 삭제."}, {"aspect": "minimal_change", "issue": "수령자 표현이 원문보다 포괄적(‘지정된 수령자’)으로 바뀌어 원 시나리오의 구체성(경비 근무자 등 내부 직원) 축소.", "fix": "해당 문장을 원문 맥락으로 구체화: 현재 문장 '출력물은 지정된 수령자에게만 전달되며, 업무 종료 즉시 회수하여 파쇄한다.'를 '출력물은 경비 근무자 등 내부 직원 중 지정된 수령자에게만 전달되며, 업무 종료 즉시 회수하여 파쇄한다.'로 교체."}]}}
{"case_id": "2022-013-099", "respondent": "평창군시설관리공단", "case_content": "평창군시설관리공단은 2021년 5월 1일부터 평창자연휴양림의 시설 안전·관리 및 범죄·화재 예방을 위해 내·외부 공개된 장소에 고정형 영상정보처리기기 25대를 설치·운영하였다. 설치 위치는 공용 구역으로 한정하고, 객실 내부 및 화장실·샤워실·탈의실 등 사생활 침해 우려 장소의 내부가 촬영되지 않도록 배치·설계하였다.\n\n설치 전 시험 촬영 단계에서 3층 복도 카메라 1대의 창문 방향 시야를 확인하고, 프라이버시 마스킹과 차광 필름 부착 및 각도 조정을 통해 객실 내 화장실(샤워실 겸용) 내부가 어떠한 경우에도 포착되지 않도록 사전에 차단한 후 운영을 개시하였다. 2021년 8월 26일 민원 접수 시 재점검을 실시하여 복도 방향 고정 각도·줌 및 마스킹 범위를 추가 강화하였다.\n\n설치 전·후 시험 촬영으로 촬영 범위를 확인하고, 분기별 점검으로 각도 변경·고장 여부를 확인한다. 녹음 기능은 사용하지 않는다.\n\n안내판을 각 촬영 구역별로 게시하여 설치 목적과 장소, 촬영 범위·시간(예: 24시간), 관리책임자 및 연락처를 명시한다. 운영·관리 방침을 마련하여 공개하고, 임의 조작이나 목적 외 비추기 금지를 포함한다.\n\n영상은 24시간 기록하되 보존기간은 30일 이내로 설정하여 자동 삭제하며, 사고 조사 등으로 보존이 필요한 경우에는 관련 분량만 별도 저장소에 분리 보관하고 사유·기간을 기록한다. 저장 매체와 전송 구간은 암호화하고, 영상관리시스템 접근 권한은 담당자 개인계정으로 최소한으로 부여하며 다단계 인증을 적용한다. 접속기록과 열람·반출 이력을 보관·점검하고, 악성코드 방지, 취약점 점검 등 안전조치를 실시한다. 장비실·서버실은 잠금장치로 물리적 접근을 통제한다.\n\n정보주체가 자신이 촬영된 영상의 열람·사본을 요청하는 경우 본인 확인 후 가능한 범위에서 제3자 모자이크 등 비식별 조치를 거쳐 열람 또는 제공하며, 요청서와 처리 결과를 기록·보관한다. 보존기간 도래 또는 목적 달성 시에는 복구 불가능한 방식으로 파기하고, 파기 이력을 관리한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 1}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "The REWRITTEN case_content alters key facts of the ORIGINAL. It claims pre-operation masking/angle adjustments ensured bathrooms were never captured and removes the violation, whereas the ORIGINAL states one camera could capture part of a bathroom interior until a complaint on 2021-08-26 prompted an angle adjustment. The REWRITTEN also clears violated_articles, diverging from the ORIGINAL.", "fix": "Revise the narrative to retain the original scenario and restore the cited violation while keeping added control details. Make the following text-level edits: 1) Replace the sentence in the first paragraph: \"설치 위치는 공용 구역으로 한정하고, 객실 내부 및 화장실·샤워실·탈의실 등 사생활 침해 우려 장소의 내부가 촬영되지 않도록 배치·설계하였다.\" WITH \"설치 위치는 공용 구역으로 한정하였으나, 3층 복도 카메라 1대는 촬영 각도상 복도에 면한 창문을 통해 객실 내 화장실(샤워실 겸용) 내부 일부가 포착될 수 있는 상태로 운영되었다.\" 2) Replace the entire second paragraph: \"설치 전 시험 촬영 단계에서 3층 복도 카메라 1대의 창문 방향 시야를 확인하고, 프라이버시 마스킹과 차광 필름 부착 및 각도 조정을 통해 객실 내 화장실(샤워실 겸용) 내부가 어떠한 경우에도 포착되지 않도록 사전에 차단한 후 운영을 개시하였다. 2021년 8월 26일 민원 접수 시 재점검을 실시하여 복도 방향 고정 각도·줌 및 마스킹 범위를 추가 강화하였다.\" WITH \"2021년 8월 26일 민원 접수 후 현장 점검을 통해 해당 기기의 촬영 각도를 복도 방향으로 조정하고, 프라이버시 마스킹과 차광 필름을 적용하여 객실 내 화장실(샤워실 겸용) 내부가 포착되지 않도록 개선하였다.\" 3) Update violated_articles from [] TO [\"개인정보 보호법 제25조\"]."}]}}
{"case_id": "2022-013-101", "respondent": "◇◇◇◇ 고시원", "case_content": "◇◇◇◇ 고시원은 입실 계약 체결과 건물 안전관리, 요금 정산을 위해 필요한 최소 정보만 수집한다. 필수 항목은 성명, 연락처, 입실·퇴실일, 객실번호, 요금 및 납부 정보, 비상연락처이며, 우편 송부가 필요한 경우에 한해 주소를 선택 항목으로 별도 동의를 받아 수집한다. 주민등록번호는 수집·보관하지 않는다. 신원 확인은 신분증을 육안 확인하는 방식으로 처리하며, 확인 일시·담당자 및 확인 여부만 기록한다. 주민등록번호가 포함된 사본·이미지는 접수하지 않으며, 제출 시 가림 안내를 제공하고, 스캔·업로드 단계에서 주민등록번호 패턴을 감지하면 접수를 차단한다.\n계약서에는 개인정보의 수집·이용 목적, 수집 항목(필수/선택 구분), 보유기간, 제3자 제공·위탁 여부, 동의 거부 권리 및 거부에 따른 영향 등을 구분해 명확히 고지하고, 선택 항목과 마케팅 수신 여부는 필수와 분리하여 동의를 받는다.\n종이 계약서는 잠금장치가 있는 별도 보관함에 보관하고, 전자화 자료는 전송·저장 시 암호화한다. 접근 권한은 업무상 필요 최소 인원에게 개인별 계정으로 부여하고, 권한 변경·말소 절차를 운영한다. 개인정보처리시스템 접속기록을 보관·점검하고, 악성코드 방지 프로그램을 주기적으로 갱신한다.\n수집 정보는 계약 관리, 요금 정산, 안전관리 외의 목적으로 이용하지 않으며, 제3자 제공을 하지 않는다. 회계시스템 운영 등 외부 위탁이 필요한 경우 처리 범위, 재위탁 제한, 보안 통제, 사고 통지, 반환·파기, 관리 현황 점검을 포함한 계약을 체결하고 정기적으로 이행 여부를 확인한다.\n보유기간은 목적 달성 또는 퇴실 후 정해진 기간에 따라 관리하며, 관련 법령에 따른 보존 의무가 있는 자료는 의무기간 동안 다른 정보와 분리하여 저장·관리한다. 보유기간 경과 또는 목적 달성 시 전자 파일은 복구 불가능한 방식으로 영구 삭제하고, 종이 문서는 파쇄하며, 파기 이력을 기록한다.\n입실자는 열람, 정정·삭제, 처리정지 및 동의 철회를 요청할 수 있고, 고시원은 전용 창구를 통해 접수·처리 절차를 운영한다. 내부적으로 개인정보 보호책임자를 지정하고 개인정보취급자 범위를 최소화하며 정기 교육을 실시한다. 사고 발생 시 통지·신고 및 피해 확산 방지 절차를 마련해 운영한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "개인정보 처리방침의 수립 및 공개 의무(법 제30조, 시행령 제31조)가 명시되어 있지 않아 공개 요건 충족 여부가 불명확함.", "fix": "case_content에 다음 문장을 추가: \"개인정보 처리방침을 수립하고, 홈페이지가 없는 경우 사업장 내 보기 쉬운 장소에 게시하여 공개한다. 처리방침에는 처리 목적, 수집 항목(필수/선택), 보유 및 이용 기간, 제3자 제공 및 위탁 현황, 안전성 확보조치, 정보주체 권리 및 행사방법, 개인정보 보호책임자 및 담당 부서 연락처 등을 포함한다.\""}, {"aspect": "legality", "issue": "접속기록의 위·변조 방지 등 무결성 보장 조치가 시행령 제30조 제1항 제5호 요건까지는 명시되지 않음.", "fix": "보안 조치 문단에 다음을 보완: \"개인정보처리시스템 접속기록을 일정 기간 안전하게 보관하고 정기 점검하며, 위·변조 방지 조치를 적용한다.\""}, {"aspect": "minimal_change", "issue": "마케팅 수신 동의 도입은 원 사안의 사업 시나리오에 없던 처리 목적을 추가하여 불필요한 변화가 발생함.", "fix": "다음 문구에서 마케팅 관련 부분을 삭제: \"선택 항목과 마케팅 수신 여부는 필수와 분리하여 동의를 받는다.\" → \"선택 항목은 필수 항목과 분리하여 동의를 받는다.\""}, {"aspect": "minimal_change", "issue": "스캔·업로드 단계에서 주민등록번호 패턴 감지 및 차단 등 전자적 접수 프로세스 도입은 원 사안에 없던 채널 추가로 불필요한 확장 가능성이 있음.", "fix": "다음 문구를 삭제 또는 간소화: \"스캔·업로드 단계에서 주민등록번호 패턴을 감지하면 접수를 차단한다.\" → 삭제하거나 \"사본·이미지는 접수하지 않으며, 제출 시 주민등록번호는 반드시 가리도록 안내한다.\"로 축소."}]}}
{"case_id": "2022-013-100", "respondent": "경주정보고등학교", "case_content": "경주정보고등학교는 2011년 7월경부터 시설 안전 및 화재 예방을 위해 교내외 건물에 고정형 CCTV 38대를 설치·운영해 왔다. 과거 본관 동편·서편 각 층 및 별관 화장실 내부에 9대를 설치하여 학생 이용 모습 등의 영상이 CCTV 녹화장치(NVR)에 기록·보관되었고, 해당 장비는 관리번호(1~6, 8~10번)로 구분되어 운영되었다. 2021년 11월 전량 철거되었으며, 이후 동일 위치 인근의 출입구 및 복도 등 공개된 구역으로 재배치하였다.\n현재 촬영 위치는 정문·출입구, 주차장, 계단·복도 등 공개된 공용 구역으로 한정하며, 화장실·탈의실 등 사생활 침해 우려 장소의 내부는 촬영하지 않는다. 화장실 출입구 인근 장비는 출입구 방향 복도만 비추도록 시야를 고정하고, 프라이버시 마스킹을 설정하여 내부가 촬영되지 않도록 운영한다. 녹음 기능은 사용하지 않으며, 카메라의 임의 조작이나 다른 곳을 비추는 행위는 금지한다.\n고정형 CCTV를 신규 설치·증설하거나 촬영범위·위치를 변경할 때에는 공청회 또는 설명회 등을 통해 관계 전문가와 이해관계인의 의견을 수렴하고, 그 결과를 설치·운영 계획에 반영한다.\n안내판에는 설치 목적·장소, 촬영 범위·시간, 관리책임자 연락처를 표기하고, 설치·운영 사무를 위탁하는 경우 수탁자의 명칭과 연락처를 추가한다.\n영상은 전용 네트워크를 통해 암호화 채널로 NVR에 전송·저장하고, 저장 매체는 암호화하여 보관한다. 녹화장치는 잠금장치가 있는 통제구역에 보관하며, 접근은 안전관리 담당자 등 최소 인원에게 개인별 계정으로 부여한다. 관리자 계정은 강한 인증수단을 적용하고, 권한 부여·변경·말소 절차를 운영한다. 접속기록(접속 일시, 열람·다운로드·삭제 등 처리 내역)은 위·변조 방지 조치와 함께 보관·점검한다. 악성코드 방지, 보안패치, 네트워크 접근통제 등 기술적 조치를 주기적으로 시행한다.\n보관기간은 기본 30일로 설정하여 자동 삭제하며, 사고 조사 등 필요한 경우에 한하여 관련 구간만 별도 분리보관 후 목적 달성 시 복구 불가능한 방식으로 파기한다. 전자파일은 영구삭제 방식으로, 출력물은 파쇄 또는 소각으로 파기하고, 파기 이력은 기록한다.\n영상 열람·사본 요청은 학생·학부모 등 정보주체가 신청서로 접수하면 신원 확인 후 처리하며, 제3자의 권익 침해가 예상되는 부분은 모자이크 등으로 최소화하여 제공한다. 제공은 시설 안전 관리 및 관계 기관의 요청 등 필요한 범위로 한정하고, 제공 항목·목적·제공 일시를 기록한다.\n유지보수 등 설치·운영 사무를 위탁할 때에는 처리 범위, 재위탁 제한, 접근 통제, 사고 통지, 반환·파기 절차, 관리 현황 점검, 책임 등에 관한 사항을 포함한 계약을 체결한다. 수탁자 계정은 개인별·기간 제한으로 발급하여 접속기록을 점검하고, 위탁 현황과 수탁자는 학교 홈페이지 등으로 공개한다.\n학교는 고정형 영상정보처리기기 운영·관리 방침을 통해 설치 목적, 위치·촬영범위, 보관기간, 열람 절차, 위탁 및 안전조치, 관리책임자 연락처를 공개하고, 정기적으로 운영 현황과 안전조치 이행 상태를 점검한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": []}}
{"case_id": "2022-013-102", "respondent": "◇◇◇◇(고시원)", "case_content": "◇◇◇◇(고시원)은 객실 임대 및 운영을 위해 입실 계약 체결 시 필요한 최소 항목(성명, 연락수단, 청구·고지 주소 선택, 환불 계좌 선택)을 수집한다. 주민등록번호는 수집·보관하지 않으며, 신분 확인이 필요한 경우 신분증 사본을 보관하지 않고 성명과 생년월일만 확인·기록한다. 이미지나 문서에 주민등록번호가 포함된 경우 제출 전에 가림을 안내하고, 식별 시 접수를 차단하거나 즉시 반송·파기한다.\n수집 시 계약서 및 안내문을 통해 처리 목적, 수집 항목, 보유·이용 기간, 제3자 제공 여부, 권리 행사 방법, 동의 거부 가능성과 그 영향 등을 명확히 알리고 동의를 받는다. 필수 항목과 선택 항목(마케팅 등)은 분리하여 선택 동의를 받으며, 선택 동의가 없더라도 서비스 이용에 제한이 없도록 운영한다.\n개인정보는 계약관리 시스템에 저장하며 전송 구간은 암호화 채널을 사용한다. 저장 데이터는 암호화하고, 접근 권한은 담당자에게 최소로 부여한다. 계정은 개인별로 발급하며 접속기록을 보관·점검한다. 종이 계약서는 잠금장치가 있는 보관함에 분리 보관하고, 열람·반출 기록을 관리한다.\n보유 기간은 계약 이행 및 정산 완료 후 관련 보존 필요 기간까지로 한정하며, 기간 경과 또는 목적 달성 시 전자파일은 복구 불가능한 방식으로 삭제하고, 종이는 파쇄한다. 다른 법령에 따른 보존이 필요한 경우에는 해당 자료를 다른 개인정보와 분리하여 저장·관리하고, 파기 이력을 기록한다.\n영업 양도가 있는 경우, 이전 30일 전까지 문자·전자우편·우편 등으로 정보주체에게 이전 사실, 양수인의 명칭·주소·연락처, 이전을 원하지 않는 경우의 방법·절차를 개별 통지한다. 개별 통지가 곤란한 경우 홈페이지 및 사업장 게시로 추가 안내한다. 양수인은 이전 사실을 지체 없이 다시 알리고, 이전받은 개인정보를 기존의 목적과 보유 기간 범위 내에서만 이용한다. 이전 데이터는 항목·범위를 목록화하고, 전송 중 암호화 및 봉인 등 안전한 방법으로 인계한다. 불필요한 자료는 이전 전에 삭제하거나 반납한다.\n정보주체는 열람, 정정·삭제, 처리정지·동의철회를 전용 창구(전화·이메일)로 요청할 수 있으며, 고시원은 요청을 확인하여 처리 결과를 통지한다. 개인정보 처리방침을 공개하고, 보호책임자 및 담당 부서 연락처를 상시 안내한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "불필요하게 '마케팅 등' 선택동의 상황을 도입하여 원 사안(고시원 객실 임대·운영) 범위를 넓힌 인상이 있음.", "fix": "다음 문장을 수정: \"필수 항목과 선택 항목(마케팅 등)은 분리하여 선택 동의를 받으며, 선택 동의가 없더라도 서비스 이용에 제한이 없도록 운영한다.\" -> \"필수 항목과 선택 항목은 분리하여 선택 동의를 받으며, 선택 동의가 없더라도 서비스 이용에 제한이 없도록 운영한다.\""}, {"aspect": "minimal_change", "issue": "원문에 없던 '환불 계좌' 항목을 기본 수집 항목으로 명시하여 불필요한 시나리오 확장이 있음.", "fix": "첫 문장을 다음과 같이 수정: \"◇◇◇◇(고시원)은 객실 임대 및 운영을 위해 입실 계약 체결 시 필요한 최소 항목(성명, 연락수단, 청구·고지 주소 선택, 환불 계좌 선택)을 수집한다.\" -> \"◇◇◇◇(고시원)은 객실 임대 및 운영을 위해 입실 계약 체결 시 필요한 최소 항목(성명, 연락수단, 청구·고지 주소)을 수집한다. 환불 처리가 필요한 경우에 한하여 계좌정보를 별도 수집한다.\""}]}}
{"case_id": "2022-014-106", "respondent": "지방자치단체", "case_content": "지방자치단체는 대표홈페이지와 민원·세무 처리 시스템을 통해 민원 접수·처리, 고지·납부 관리 등 소관 업무를 수행한다. 이를 위해 내부 취급자에게 개인별 계정을 발급하고 부서장 승인 후 역할 기반으로 최소 권한을 부여한다. 공용 계정은 사용하지 않으며, 임시 권한은 기간을 설정해 자동 만료된다. 전보·퇴직 시 즉시 계정을 말소하고 권한을 회수한다.\n\n시스템 접속은 TLS 구간암호화와 기관 VPN을 통해서만 허용하며, 인증은 강력한 비밀번호 정책과 다단계 인증을 적용한다. 개인정보처리시스템의 접근권한 부여·변경·말소 이력과 이용자의 접속일시·처리내역 등 접속기록을 이용자 단위로 분리 보관하고, 무결성 보호조치를 적용하여 위·변조를 방지하며 정기 점검·분석을 수행한다.\n\n업무 처리에 필요한 최소 항목(성명, 연락처, 민원·신청·처리 내역 등)만 조회·이용하며, 주민등록번호 등 고유식별정보가 포함되는 경우 화면은 마스킹하고 저장 시 암호화한다. 개인정보는 전송·저장 시 암호화하고, 운영 DB와 백업 저장소를 분리하여 관리한다. 열람 범위는 승인 절차를 통해 세분화하고, 권한은 담당자에게만 부여한다.\n\n보존기간은 법령 및 기록물 관리 기준에 따라 설정하고, 목적 달성 또는 보존기간 만료 시 지체 없이 복구 불가능한 방식으로 파기한다. 법정 보존 사유가 있는 경우에는 다른 정보와 분리하여 보관한다.\n\n시스템 운영·유지보수를 위탁하는 경우 위탁 계약서에 처리 범위, 재위탁 제한, 접근통제·암호화·로그관리 등 안전조치, 사고 통지, 점검·감독, 종료 시 반환·파기 절차를 포함하고, 수탁자의 접근계정은 개인별로 발급하여 관리한다. 악성코드 방지, 취약점 점검, 물리적 접근통제 등 안전조치를 정기적으로 시행한다. 공공시스템 운영 절차에는 시스템별 안전조치, 권한 관리, 접속기록 저장·분석 및 이상 징후 통보 절차를 포함한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "인증정보 보호에 관한 시행령 제30조 제1항 제4호 가목(비밀번호 등 인증정보의 암호화 저장)에 대한 구체적 기술이 누락되어 안전조치 충족 여부가 모호합니다.", "fix": "다음 문장을 인증/접속 통제 단락 끝에 추가하세요: \"인증정보(비밀번호 등)는 일방향 암호화 방식으로 저장하여 관리한다.\""}, {"aspect": "legality", "issue": "공공시스템 관련 절차를 명시하면서(\"공공시스템 운영 절차\") 시행령 제30조의2 제2항의 '무권한 또는 권한초과 접근 확인 시 정보주체 통지' 조치가 명확히 드러나지 않습니다.", "fix": "다음 문장을 접속기록/모니터링 또는 공공시스템 운영 절차 문단에 추가하세요: \"정당한 권한 없이 또는 허용된 권한을 초과하여 개인정보에 접근한 사실이 확인되는 경우 지체 없이 해당 정보주체에게 해당 사실과 피해 예방에 필요한 사항을 통지한다.\""}, {"aspect": "legality", "issue": "주민등록번호 등 고유식별정보 처리와 관련해 법정 근거 제한(법 제24조의2)에 대한 조건이 명시되어 있지 않습니다.", "fix": "고유식별정보 처리 문장 앞에 다음을 보완하세요: \"주민등록번호 등 고유식별정보는 법령에서 허용하거나 요구하는 경우에 한하여 처리한다.\""}]}}
{"case_id": "2022-014-108", "respondent": "지방자치단체", "case_content": "지방자치단체는 대형폐기물 배출신청 시스템을 통해 신청 접수·결제·수거 배차 등 민원을 처리한다. 수집 항목은 업무에 필요한 최소 범위(신청자 성명, 연락처, 배출 주소, 품목·규격, 수거 희망일, 사진(선택), 결제 관련 식별자)로 한정하며, 카드번호 등 결제정보는 전자결제대행사 화면에서만 입력·처리되도록 구성하여 시스템에 저장하지 않는다.\n처리 시스템에는 개인정보취급자별로 개인 계정을 발급하고 공용계정은 사용하지 않는다. 역할 기반 최소권한을 부여하며(예: 조회/승인/정산 등 분리), 계정 생성·변경·말소 절차를 운영하고 인사 변동 시 즉시 권한을 회수한다. 로그인은 다단계 인증과 복잡도·주기 정책을 적용하고, 연속된 실패 시 계정 자동 잠금, 일정 시간 미사용 시 세션 자동 종료가 적용된다. 접근은 사내망/VPN에서만 허용하며, 관리자 구간은 별도 네트워크로 분리한다.\n신청 정보 전송은 암호화 통신구간을 사용하고, 저장 데이터는 암호화한다. 인증정보는 일방향 암호화로 저장하며, 주민등록번호 등 고유식별정보는 원칙적으로 수집하지 않는다(법령 근거로 수집이 불가피한 경우 분리 보관 및 암호화). 서버·데이터베이스에 대한 접근은 승인된 관리자만 가능하도록 통제하고, 물리적 접근통제를 적용한다.\n개인정보처리시스템의 접속기록(접속 주체, 일시, 처리내역)을 생성·보관하고 위·변조 방지 조치를 적용하며, 정기적으로 점검한다. 악성코드 방지 프로그램과 보안 패치를 주기적으로 적용하고, 중요 설정 변경에 대한 이력 관리를 수행한다.\n보관 기간은 처리 목적과 관련 법령의 보존 필요성을 고려해 사전에 정의하고, 기간 경과 또는 목적 달성 시 전자파일은 복구 불가능한 방식으로 삭제하며, 종이 문서는 파쇄 또는 소각한다. 법령에 따른 보존 대상은 다른 개인정보와 분리하여 저장·관리하며, 파기·분리보관 이력을 기록한다.\n문자발송, 전자결제, 수거 위탁 등 필요한 경우에 한해 최소 항목만 수탁사에 제공하며, 위탁계약에 처리 범위, 재위탁 제한, 보안통제, 사고 통지, 반환·파기 등을 포함한다. 수탁사 계정은 개인별로 발급하고 접근기록을 점검하며, 정기적으로 관리·감독을 실시한다.\n정보주체가 열람·정정·삭제·처리정지를 요청할 수 있는 창구를 운영하고, 개인정보 처리방침에 수집 항목, 이용 목적, 보유 기간, 제3자 제공·위탁 현황, 안전조치 등을 공개한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 3}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "REWRITTEN case_content adds numerous operational and policy elements (VPN 전용 접근, 관리자 네트워크 분리, 물리적 접근통제, 광범위한 위탁관리, 처리방침 공개·권리행사 안내 등) that go well beyond fixing the original issues (공용계정 사용, 계정잠금 미적용) and expand the scenario unnecessarily.", "fix": "Trim the case_content to retain the original business scope and only the necessary handling/controls to address the issues while keeping PIPA compliance. Replace case_content with the following concise text:\n\"지방자치단체는 대형폐기물 배출신청 시스템을 통해 신청 접수와 수거 처리를 수행한다. 업무에 필요한 최소 항목(신청자 성명, 연락처, 배출 주소, 품목·규격, 수거 희망일, 사진(선택))을 수집하며, 유료 서비스의 결제는 전자결제대행사 화면에서만 입력되도록 구성하여 카드번호 등 결제정보는 시스템에 저장하지 않는다.\n개인정보취급자별 개인 계정을 발급하고 공용 계정은 사용하지 않는다. 역할 기반 최소권한을 부여하고, 계정 생성·변경·말소 및 인사 변동 시 권한 회수 절차를 운영한다. 로그인에는 비밀번호 복잡도·주기와 다단계 인증을 적용하며, 연속된 실패 시 계정 자동 잠금을 설정하고 일정 시간 미사용 시 세션을 자동 종료한다.\n개인정보처리시스템의 접속기록(접속 주체, 일시, 처리내역)을 생성·보관하고 위·변조 방지 조치를 적용한다. 개인정보 전송 구간은 암호화하고, 인증정보는 일방향 암호화로 저장한다. 보관 기간은 사전에 정하고 기간 경과 또는 목적 달성 시 전자파일은 복구 불가능하게 파기하며 필요한 경우 분리보관한다.\""}]}}
{"case_id": "2022-014-115", "respondent": "목포시청", "case_content": "목포시청은 자동차등록사무소의 과태료 부과·고지·납부·체납관리 업무를 위해 필요한 최소 항목(차량번호, 소유자 성명, 주소·연락처, 위반·부과내역, 납부정보)을 시스템에 입력·처리한다. 주민등록번호 등 고유식별정보는 법령상 필요한 경우에 한해 수집하며, 저장 시 암호화하고 전송은 암호화 채널로 수행한다. 데이터는 시청 전산센터의 데이터베이스에 저장되며, 백업 데이터와 매체는 별도 구역에 암호화하여 분리 보관한다.\n개인정보취급자 계정은 개인별로 발급하고 역할 기반 최소권한으로 부여한다. 다중요소 인증, 허용 IP 및 업무용 단말 제한, 세션 시간 제한과 화면 잠금 정책을 적용한다. 인사 이동·퇴직 시 HR 연계로 계정을 즉시 말소하고, 당일 확인 절차를 운영한다. 분기별로 권한을 재점검하며 장기 미사용 계정은 자동 잠금 처리한다.\n접속기록과 처리내역(조회·수정·다운로드)을 보관·점검하고 위변조 방지 조치를 적용한다. 악성코드 방지 프로그램을 설치·주기적으로 갱신하며, 인증정보는 일방향 암호화로 저장하고 암호키는 전용 보관소에서 권한을 분리하여 관리한다. 물리적 접근은 전산실 출입통제로 제한한다.\n수납 연계를 위해 지정 수납기관에 필요한 항목만 최소화하여 암호화 채널로 전송하고, 제공 내역과 보유기간을 기록·관리한다.\n보관기간은 관련 기록물 보존기준에 따라 설정하고, 목적 달성 또는 기간 만료 시 전자파일은 복구 불가능한 방식으로 영구 삭제하며, 종이 등은 파쇄 또는 소각한다. 다른 법령에 따라 보존해야 하는 정보는 본 시스템과 분리하여 저장·관리하고, 파기·분리 이력을 기록한다.\n운영 부서장은 관리책임자로 지정되어 내부관리계획을 수립·점검하고, 공공시스템 접속기록을 분석·관리한다. 정당한 권한을 초과한 접근이 확인되면 지체 없이 통지 및 대응 절차를 가동한다. 시스템 유지보수를 위탁하는 경우 처리 범위, 재위탁 제한, 접근통제, 사고 통지, 반환·파기, 점검·감독을 포함한 계약을 체결하고, 수탁사 계정은 개인별로 발급하여 관리한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "The rewritten record introduces a new step (data sharing with a designated collection institution for payment linkage) that was not mentioned in the original business description, slightly expanding the scope beyond the original scenario.", "fix": "Modify the sentence to make the sharing explicitly conditional and tied to the existing scenario: replace \"수납 연계를 위해 지정 수납기관에 필요한 항목만 최소화하여 암호화 채널로 전송하고, 제공 내역과 보유기간을 기록·관리한다.\" with \"수납 연계가 필요한 경우에 한해 지정 수납기관에 필요한 항목만 최소화하여 암호화 채널로 전송하고, 제공 내역과 보유기간을 기록·관리한다.\""}]}}
{"case_id": "2022-014-118", "respondent": "지방자치단체", "case_content": "지방자치단체는 통합예약시스템을 통해 주민의 공공시설·민원 서비스 예약을 접수·관리한다. 예약 처리를 위해 필요한 최소 항목(성명, 연락수단, 예약 대상 서비스, 희망 일시, 거주지 등)만 수집하며, 법령 근거가 없는 주민등록번호 등 고유식별정보는 수집하지 않는다. 수집 목적, 보유기간, 선택 항목 여부를 사전에 안내하고, 선택 항목 미동의 시에도 예약이 가능하다. 입력 정보는 전송 구간에서 암호화되어 전달되고, 저장 시에도 암호화되며, 암호키는 별도 저장소에 분리 관리한다. 예약 데이터와 접속기록은 분리 저장하고, 접근 권한은 업무상 필요한 최소 범위로 부여한다. 관리자 계정은 개인별로 발급하고 강한 인증을 적용하며, 권한 부여·변경·말소 이력을 기록하고 정기 점검을 수행한다. 시스템은 이용자 ID, 접속일시, 처리내역 등 접속기록을 자동 생성하여 위·변조 방지 조치와 함께 안전하게 보관한다. 접속기록은 월 1회 이상 정기 점검하고, 비정상 조회·대량 다운로드 등 이상 징후에 대한 탐지 알림을 운영한다. 점검 결과와 조치 이력은 기록·보관한다. 접근 통제, 침입 탐지·차단, 악성코드 대응, 취약점 점검 등 기술적 보호조치를 운영하고, 서버는 물리적 통제구역에서 관리한다. 개인정보는 처리 목적 달성 또는 보유기간 만료 시 지체 없이 복구 불가능한 방식으로 파기하며, 다른 법령에 따른 보존이 필요한 경우에는 분리 보관한다. 로그와 백업 데이터는 정해진 기간 동안 동일한 보호조치 하에 관리하고, 파기 이력을 남긴다. 제3자 제공은 법령 근거가 있거나 별도 동의를 받은 경우에 한해 최소 항목으로 제공한다. 문자 발송 등 예약 알림 업무를 수탁사에 위탁하는 경우 처리 범위, 재위탁 제한, 보안 통제, 사고 통지, 반환·파기 절차를 계약에 명시하고, 수탁자의 접근 권한과 접속기록을 점검·감독한다. 유출 등 사고 인지 시에는 통지·신고 및 피해 최소화 조치를 수행한다. 정보주체의 열람·정정·삭제·처리정지 등 요구 창구를 제공하고 내부 관리계획을 통해 교육, 점검, 사고 대응 절차를 운영한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "The ORIGINAL noted a period when monthly access-log inspections were not performed; the REWRITTEN removes that historical fact and presents only a fully compliant state, which alters the scenario beyond adding controls.", "fix": "Explicitly acknowledge the past gap and the subsequent remediation in neutral terms. For example, append to case_content: \"과거에는 접속기록 정기 점검을 월 1회 이상 수행하지 않은 기간이 있었으나, 이후 점검 체계를 보완하여 현재는 월 1회 이상 정기 점검을 수행한다.\""}]}}
{"case_id": "2022-014-112", "respondent": "지방자치단체", "case_content": "지방자치단체는 지방행정·지방세 등 민원·행정 사무 처리를 위해 개인정보처리시스템을 운영하며, 민원 접수·처리 기록, 납세 정보, 성명, 생년월일, 주소, 연락처와 법령상 필요한 경우의 주민등록번호 등 업무에 필요한 최소 항목만 전자적으로 수집·저장한다. 사용자 계정은 개인정보취급자별 개인 계정으로만 발급하고 역할 기반 최소권한을 부여한다. 계정 발급·변경·말소는 사전 승인 절차로 처리하며, 인사 이동·퇴직 즉시 권한을 회수한다. 계정 공유 및 동일 자격증명의 동시 로그인을 금지하고, 세션 타임아웃과 로그인 실패 시 계정 잠금 등 인증 통제를 적용한다. 외부 또는 원격 접속은 VPN과 다단계 인증을 사용한다. 개인정보 화면은 기본 마스킹을 적용하고, 원본 열람·다운로드는 업무 필요 사유 입력 및 승인 후 가능하도록 제한한다. 개인정보처리시스템에 대한 접속, 조회·변경·출력·반출 이력은 사용자 단위로 기록·보존하고, 위변조 방지 저장소에 보관하여 정기 점검 및 이상징후 알림을 운영한다. 전송 구간은 암호화 채널을 사용하고 저장 데이터는 암호화하며, 주민등록번호 등 고유식별정보와 인증정보는 강한 암호화와 분리된 키 관리로 보호한다. 악성코드 방지, 취약점 점검·패치, 방화벽·침입차단 등 접근통제, 업무망 분리 등 기술·물리적 보호조치를 유지한다. 제3자 제공은 공공업무 수행에 필요한 경우에 한해 최소 항목만 제공하고, 제공 대상·항목·보유기간 및 제공 사유를 기록·관리한다. 보존기간이 끝나거나 처리 목적이 달성된 개인정보는 전자파일은 복구 불가능하게 삭제하고, 서면은 파쇄 또는 소각하며, 다른 법령에 따라 계속 보존해야 하는 정보는 별도 저장소에 분리 보관하고 파기·보존 이력을 관리한다. 시스템 운영을 위탁하는 경우 위탁 범위, 접근 통제, 재위탁 제한, 사고 통지, 점검·감독, 반환·파기 등 안전조치를 포함한 계약을 체결하고 이행 여부를 정기 점검한다. 정당한 권한 없이 또는 허용된 권한을 초과한 접근이 확인되는 경우 원인 분석·차단 조치를 하고 해당 사실을 정보주체에게 통지한다. 내부관리계획을 수립하여 권한관리, 접속기록 관리, 교육·점검 절차를 반영하고 주기적으로 이행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "원본은 계정 공유/인증 미분리의 문제에 한정되어 있으나, 재작성본은 제3자 제공, 위탁, 원격접속, 업무망 분리 등 원본 시나리오 범위를 넘어선 광범위한 통제까지 추가되어 불필요한 확장으로 보임.", "fix": "핵심 논점인 계정의 개인별 발급, 공유 금지, 인증/접근권한 관리, 접속기록, 암호화, 파기, 내부관리계획 등으로 범위를 축소하세요. 예시 텍스트 수정: 다음 문장들을 삭제\n- \"외부 또는 원격 접속은 VPN과 다단계 인증을 사용한다.\"\n- \"악성코드 방지, 취약점 점검·패치, 방화벽·침입차단 등 접근통제, 업무망 분리 등 기술·물리적 보호조치를 유지한다.\"\n- \"제3자 제공은 공공업무 수행에 필요한 경우에 한해 최소 항목만 제공하고, 제공 대상·항목·보유기간 및 제공 사유를 기록·관리한다.\"\n- \"시스템 운영을 위탁하는 경우 위탁 범위, 접근 통제, 재위탁 제한, 사고 통지, 점검·감독, 반환·파기 등 안전조치를 포함한 계약을 체결하고 이행 여부를 정기 점검한다.\""}, {"aspect": "objectivity", "issue": "“강한 암호화” 표현은 주관적이며 구체 기준이 불명확함.", "fix": "다음 구절을 명확한 기준으로 교체: \"주민등록번호 등 고유식별정보와 인증정보는 강한 암호화와 분리된 키 관리로 보호한다.\" → \"주민등록번호 등 고유식별정보와 인증정보는 보호위원회 고시 기준 이상으로 암호화하고, 키는 분리 보관·관리한다.\""}]}}
{"case_id": "2022-014-120", "respondent": "피심인(지방자치단체)", "case_content": "지방행정·지방세 처리를 위해 주민 개인정보를 개인정보처리시스템에 저장·관리한다. 계정은 개인정보취급자별로 개인별 ID를 발급하고 공유 계정은 사용하지 않는다. 권한은 업무 역할에 따라 최소 범위로 부여하며, 부여·변경·말소 시 상급자 승인을 거쳐 이력을 기록하고 위변조 방지 저장소에 보관한다. 휴면·임시·테스트 계정은 주기적으로 점검하여 자동 잠금 후 말소하고, 퇴직·전보 시 즉시 권한을 회수한다.\n외부 접속은 승인된 단말에 한해 VPN과 다단계 인증(OTP 등)을 적용하며, 내부망·외부망 분리와 IP 접근제어로 통제한다. 시스템 접근은 개인별 인증수단을 사용하고, 비밀번호는 일방향 암호화하여 저장한다. 통신 구간은 TLS 등 암호화 채널을 사용하고, 저장 데이터 중 주민등록번호 등은 암호화하여 보관한다.\n개인정보처리시스템의 접속기록(접속 일시, 계정, 처리 내역 등)과 권한관리 이력은 내부 기준에 따른 최소 보관기간 동안 안전하게 보관·정기 점검하며, 위·변조 방지 조치를 적용한다. 악성코드 방지 프로그램을 설치·갱신하고, 침입 탐지·차단 등 네트워크 접근통제 장치를 운영한다.\n내부관리계획을 수립하여 정기 교육, 권한 정기 점검, 계정 운영·점검 절차, 파기 정책을 포함한다. 이용목적이 종료되거나 보존기간이 경과한 개인정보는 복구 불가능한 방법으로 파기하고, 법령에 따라 보존이 필요한 정보는 분리 보관한다. 공공시스템 접속기록은 저장·분석하여 비정상 접근 징후를 모니터링하고, 정당한 권한 없는 접근이 확인되면 관련 사실을 통지하고 대응 절차를 진행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "시행령 제30조 제1항 제7호에서 요구하는 물리적 안전조치(보관시설의 마련 또는 잠금장치 설치 등)가 case_content에 명시되어 있지 않아, 기술적·관리적 조치는 구비되었으나 물리적 조치의 적시성이 부족합니다.", "fix": "case_content의 보안조치 서술에 물리적 안전조치를 명확히 추가하세요. 예: 다음 문장을 \"내부관리계획을 수립하여... 포함한다.\" 문단 뒤에 추가: \"서버실·전산실 및 문서 보관구역에 대한 출입통제(출입카드, 방문자 기록)와 CCTV를 운영하고, 보관시설에 잠금장치를 설치하여 물리적 접근을 통제한다. 오프라인 기록물·이동매체는 잠금 보관하고 반출·반입을 기록하며, 불필요 시 파쇄 또는 소각 등으로 파기한다.\""}]}}
{"case_id": "2022-014-111", "respondent": "지방자치단체", "case_content": "지방자치단체는 지방행정·지방세 민원 처리를 위해 홈페이지 기반 개인정보처리시스템을 운영한다. 업무 수행에 필요한 최소 항목(성명, 식별자, 연락처, 민원·세무 처리 이력 등)만 수집하며 목적별로 저장소를 분리한다. 주민등록번호 등 고유식별정보는 저장 시 암호화하고, 인증정보는 일방향 암호화한다. 관리자에게는 개인별 계정을 부여해 최소 권한만 제공하고 정기적으로 권한을 점검한다. 관리자 페이지는 외부에 직접 노출하지 않고 인증서 기반 VPN 또는 제로트러스트 게이트웨이를 통해서만 접속하도록 하며, 다단계 인증과 허용 IP 기반 접근통제를 적용한다. 로그인 실패 횟수 초과 시 계정을 잠그고, 일정 시간 미사용 시 자동 로그아웃과 세션 만료를 적용한다. 전송 구간은 TLS로 암호화하고, 데이터베이스와 백업 파일은 암호화하며, 시스템은 네트워크 분리 및 접근통제 장비로 보호한다. 공공시스템 접속기록(접속 일시, 처리 내역 등)은 위변조 방지 조치로 안전하게 보관하고 저장·분석·점검을 정기 수행한다. 서버와 단말에는 악성코드 방지와 보안패치 관리 체계를 운영하고, 전산실 출입통제 등 물리적 보호조치를 적용한다. 보유기간 경과 또는 처리 목적 달성 시에는 복구 불가능한 방법으로 파기하고, 다른 법령에 따른 보존 대상은 분리 보관한다. 운영·유지보수를 위탁하는 경우 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 반환·파기, 감독 절차를 포함한 계약을 체결하고 수행 현황을 점검한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": []}}
{"case_id": "2022-014-109", "respondent": "지방자치단체(공공기관)", "case_content": "지방자치단체(공공기관)는 대표홈페이지를 운영하며 주민·이용자의 계정 관리와 접속 관리를 수행한다. 회원 가입 시 서비스 제공에 필요한 최소 항목(아이디, 비밀번호, 성명, 연락수단)만 수집하고, 주민등록번호 등 불필요한 정보는 수집하지 않는다. 비밀번호는 사용자별 솔트를 적용한 강한 일방향 암호함수(예: bcrypt/Argon2)로 저장하며, 전송 구간은 TLS로 보호한다. 연락처 등 식별 정보는 데이터베이스에서 컬럼 단위로 암호화하고, 암호키는 분리 보관하며 키 접근과 사용 내역을 기록한다. 관리자 접근 권한은 역할 기반으로 최소화하고 개인별 계정과 다단계 인증을 적용한다. 권한 부여·변경·말소 절차를 운영하고 분기별로 권한을 점검한다.\n\n접속기록은 개인정보처리시스템의 사용자/관리자 식별자, 접속 일시, IP, 수행 기능, 처리 결과를 포함하여 별도의 로그 서버에 저장하며, 정보주체의 내용 데이터는 기록하지 않는다. 로그는 표준시로 시간 동기화 후 무결성 검증값을 생성해 위·변조 방지 저장소에 보관한다. 보안 관제 기준에 따른 이상 징후 알림을 설정하고, 매월 정기 점검과 표본 분석을 수행한다. 접속기록은 1년간 보관 후 복구 불가능한 방식으로 파기하고, 파기 이력을 남긴다.\n\n서버 및 업무용 단말에는 악성코드 탐지 프로그램을 설치·갱신하고, 운영체제와 응용프로그램의 보안 패치를 정기 적용한다. 개인정보와 로그는 물리적으로 접근이 통제된 구역에서 보관하며, 백업본은 암호화하여 분리 보관하고 복원 테스트를 주기적으로 수행한다.\n\n회원 탈퇴 또는 보존기간 만료 시 계정 정보는 지체 없이 파기하며, 관련 법령에 따라 보존이 필요한 항목은 다른 정보와 분리하여 저장·관리한다. 내부 관리계획을 수립하여 교육, 접속권한 관리, 암호키 관리, 접속기록 관리, 파기 절차를 포함하고, 실행 및 점검 결과를 기록·보관한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": []}}
{"case_id": "2022-014-116", "respondent": "정읍시", "case_content": "정읍시는 단풍미인 쇼핑몰 홈페이지를 통해 회원가입, 주문·결제, 배송, 고객문의 등 온라인 서비스를 운영한다. 회원가입 및 주문 처리에 필요한 최소 항목(이름, 연락처, 주소, 로그인 ID, 비밀번호)과 수취인 정보만 수집하며, 결제는 PG사를 통해 처리하여 카드번호 등 결제정보는 저장하지 않고 승인 식별자와 영수증 정보만 보관한다. 서비스 제공과 시스템 보안을 위해 접속 IP, 접속 일시, 요청·오류·보안 이벤트 로그를 수집하며, 보안 목적 범위에서만 활용한다.\n개인정보는 분리된 네트워크 구간의 데이터베이스에 저장하고, 전송 구간은 TLS 등 암호화 채널을 사용한다. 비밀번호는 일방향 암호화로 저장하고, 주요 식별정보와 연락처는 저장 시 암호화한다. 접근 권한은 역할 기반으로 최소 부여하며, 관리자 계정은 개인별 발급과 다중인증을 적용한다. 권한 부여·변경·말소는 절차에 따라 처리하고, 개인정보처리시스템에 대한 접근 및 처리 내역은 위·변조 방지 기능을 갖춘 저장소에 기록·점검한다.\n외부 네트워크 접속은 VPN과 허용 IP 기반으로 제한한다. 웹 방화벽과 침입탐지·차단 시스템을 연동해 비정상 트래픽, 반복 인증 실패, 대량 요청 등 이상 징후를 실시간 분석하고 자동 경보·차단한다. 보안 이벤트는 통합관제 환경에서 모니터링하여 즉시 통지·대응하며, 운영 단말과 서버에는 악성코드 방지 프로그램을 설치해 주기적으로 갱신·점검한다. 시스템과 데이터베이스는 정기 취약점 점검과 패치 관리 절차에 따라 유지한다.\n로그와 접속기록은 내부 정책에 따른 기간 동안 별도 저장소에 보관하고 무결성을 점검하며, 보존기간 도래 시 자동 삭제한다. 보존기간이 경과하거나 처리 목적이 달성된 개인정보는 복구 불가능한 방법으로 파기하고, 법령에 따라 보존이 필요한 경우에는 다른 개인정보와 분리하여 저장·관리한다. 시스템 운영 절차, 사고 대응, 계정·권한 관리 및 교육 등은 내부 관리계획에 따라 주기적으로 수행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "외부 네트워크 접속 제한 표현이 일반 이용자의 쇼핑몰 접속까지 VPN/허용 IP로 제한하는 것으로 해석될 수 있어, 원 시나리오(공개 웹 서비스 제공)와 상충할 여지가 있음.", "fix": "다음 문장을 교체하세요: \"외부 네트워크 접속은 VPN과 허용 IP 기반으로 제한한다.\" -> \"개인정보처리시스템(관리자·DB 등)에 대한 외부 관리자 접속은 VPN과 허용 IP로 제한한다. 일반 이용자의 웹 서비스 접속은 공개 인터넷을 통해 제공하며, 웹 방화벽·침입탐지/차단 등으로 보호한다.\""}]}}
{"case_id": "2022-014-117", "respondent": "줄포만갯벌생태공원 홈페이지 운영 지방자치단체", "case_content": "지방자치단체는 줄포만갯벌생태공원 홈페이지를 운영하며, 관람 예약, 문의 접수, 소식지 발송 등 서비스 제공에 필요한 최소 항목(성명, 연락수단, 예약정보)만 수집한다. 수집ㆍ입력 데이터는 전송 시 TLS로 암호화되고 저장 시 암호화되며, 인증정보는 일방향 암호화로 저장된다. 이용 목적, 보존기간, 선택 항목은 화면과 처리방침을 통해 안내하고, 보존기간 도래 시 전자파일은 복구 불가능한 방식으로 삭제하며 종이 자료는 파쇄한다. 관리자 계정은 개인별로 발급하고 공동 계정은 사용하지 않는다. 역할 기반으로 최소 권한을 부여하며, 접근권한의 부여ㆍ변경ㆍ말소 내역은 전자 관리대장에 기록하여 정해진 기간 보관하고, 인사 변동 시 즉시 권한을 정비한다. 관리자 페이지는 사무실 고정 IP 허용/VPN 또는 전용선 구간에서만 접속하도록 설정하고, 다중인증을 적용한다. 외부 접속은 암호화 채널만 허용하며, 비활성 계정은 자동 잠금ㆍ말소한다. 개인정보처리시스템의 접속기록(접속일시, 이용자, 처리내역 등)은 중앙 로그로 수집하여 위변조 방지 조치를 적용하고 정기 점검한다. 서버와 DB에는 접근통제, 침입탐지/차단, 악성코드 방지 및 보안 패치 관리 절차를 적용한다. 백업 데이터는 별도 구간에 분리 보관하고 접근을 통제한다. 홈페이지 유지관리 위탁 시에는 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 점검ㆍ감독, 반환ㆍ파기 등을 포함한 계약을 체결하고 이행 여부를 주기적으로 확인한다. 전산실과 문서 보관구역에는 출입 통제를 적용하고, 개인정보 보호책임자 주관으로 임직원 대상 정기 교육과 내부관리계획 점검을 실시한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "동의 기반 처리가 필요한 항목(예: 선택 서비스)에 대해 동의 구분 및 거부권 고지 등 법 제15조제2항, 제22조 및 시행령 제17조의 요건이 명시되지 않음. 또한 위탁 현황의 공개(시행령 제28조제2항)가 안내되지 않음.", "fix": "다음 문구를 추가하세요. 1) 아래 문장 뒤에 덧붙이기: \"이용 목적, 보존기간, 선택 항목은 화면과 처리방침을 통해 안내하고,\" 다음에 이어서 \"필수와 선택 항목을 구분하여 각각 동의를 받으며, 동의 거부 권리와 거부 시 불이익(있는 경우)을 화면에 명확히 고지하고 전자적 방법으로 동의를 수집한다.\" 2) 위탁 문단 끝에 문장 추가: \"위탁하는 업무의 내용과 수탁자 현황을 홈페이지에 지속적으로 공개한다.\""}, {"aspect": "minimal_change", "issue": "원 사안의 사업 시나리오(생태공원 홈페이지 운영)에 비해 불필요한 서비스(소식지 발송)까지 추가되어 사업 범위가 확장됨.", "fix": "다음 구절을 교체하세요. 기존: \"관람 예약, 문의 접수, 소식지 발송 등 서비스 제공\" -> 수정: \"관람 예약 및 문의 접수 등 서비스 제공\""}]}}
{"case_id": "2022-014-110", "respondent": "지방자치단체", "case_content": "지방자치단체는 대형폐기물 배출신청 시스템을 통해 신청을 접수·처리한다. 수집 항목은 처리에 필요한 최소 정보(성명, 주소, 연락처, 배출 품목·수량, 수거 희망일, 결제 관련 식별값)로 한정하며, 주민등록번호 등 고유식별정보와 민감정보는 수집하지 않는다. 입력 정보는 암호화된 통신구간으로 전송되고, 저장 시 주요 식별정보와 인증정보는 암호화된다.\n\n신청 데이터는 개인정보처리시스템에 저장되어 요금 산정, 접수 확인, 수거 일정 통보 등 목적 범위 내에서만 이용된다. 접근 권한은 역할 기반으로 최소한으로 부여하며, 개인별 계정을 사용하고 다단계 인증을 적용한다. 계정의 부여·변경·말소 기준을 수립하여 HR 시스템과 연계해 인사이동(전보·휴직·퇴직 등) 시 즉시 권한을 변경·회수하고, 정기적으로 권한을 점검한다. 공유계정은 사용하지 않는다.\n\n개인정보처리시스템의 접속기록(계정, 일시, 처리내역, IP 등)을 생성·보관하고 위조·변조 방지 조치를 적용하며, 주기적으로 점검한다. 악성코드 방지, 취약점 점검, 침입 차단 등 기술적 보호조치를 운영하고, 문서 형태 자료는 잠금장치가 있는 구역에 보관한다.\n\n보존기간은 기록물 관리 기준 및 관련 규정에 따라 설정하며, 기간 경과 또는 목적 달성 시 전자파일은 복구 불가능한 방식으로 삭제하고, 종이는 파쇄한다. 다른 법령에 따라 보존해야 하는 경우에는 별도 영역에 분리 보관한다. 백업 데이터는 암호화하여 분리 저장하고 동일한 파기 정책을 적용한다.\n\n시스템 개발·유지보수를 외부에 위탁하는 경우, 위탁 계약서에 처리 범위, 재위탁 제한, 접근통제, 사고 통지, 접속기록 관리, 작업 종료 후 반환·파기 등을 포함하고, 정기 점검 등으로 이행 여부를 감독한다. 수거 대행업체에 업무 수행에 필요한 최소 신청 정보만 안전한 방식으로 제공하며, 제공 목적·보유기간·보안조치를 통지하고 관리한다.\n\n개인정보 처리방침 및 민원창구를 통해 열람, 정정·삭제, 처리정지 등 권리행사 방법을 안내하고, 개인정보취급자에 대한 정기 교육과 내부 관리계획에 따라 운영한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "수거 대행업체 관련 처리가 제3자 제공처럼 서술되어 위탁(법 제26조) 요건(문서화, 재위탁 제한, 접근통제 등)과 공개(시행령 제28조제2항) 의무가 불분명함.", "fix": "문구 교체(제공 → 위탁) 및 위탁 요건·공개 의무 명시. 기존 문장 \"수거 대행업체에 업무 수행에 필요한 최소 신청 정보만 안전한 방식으로 제공하며, 제공 목적·보유기간·보안조치를 통지하고 관리한다.\"를 다음과 같이 교체: \"수거 대행업무는 개인정보 처리 위탁으로 수행하며, 위탁 계약서에 처리 범위, 재위탁 제한, 접근통제, 사고 통지, 접속기록 관리, 작업 종료 후 반환·파기 및 감독·점검을 포함한다. 위탁하는 업무의 내용과 수탁자를 홈페이지에 상시 공개하고, 업무 수행에 필요한 최소 신청 정보만 안전한 방식으로 수탁자에 제공한다.\""}, {"aspect": "legality", "issue": "시스템 개발·유지보수 위탁에 대해 공개의무(시행령 제28조제2항)가 누락됨.", "fix": "해당 단락 말미에 다음 문장을 추가: \"위탁하는 업무의 내용과 수탁자를 홈페이지에 상시 공개한다.\""}, {"aspect": "legality", "issue": "수집·이용의 법적 근거가 명시되어 있지 않아 법 제15조(수집·이용 근거) 충족 여부가 불명확함.", "fix": "첫 단락(\"지방자치단체는 대형폐기물 배출신청 시스템을 통해 신청을 접수·처리한다.\") 뒤에 다음 문장을 추가: \"개인정보는 폐기물 처리 관련 법령에 따른 소관 업무의 수행을 위하여 법 제15조제1항제2호 또는 제3호에 근거하여 수집·이용한다.\""}]}}
{"case_id": "2022-014-121", "respondent": "지방자치단체", "case_content": "지방자치단체는 청소년수련관 이용을 위한 회원 계정을 운영하며, 가입 및 로그인 인증에 필요한 최소 항목(계정 ID, 비밀번호)만 수집한다. 비밀번호는 복구 불가능한 일방향 방식으로 처리하여 저장하며, 사용자별 고유 솔트와 충분한 연산 비용을 갖는 적응형 해시(bcrypt/Argon2 등)를 적용하고 분리된 키 관리 시스템에 보관되는 페퍼를 함께 사용한다. 전송 구간은 TLS로 보호하고, 비밀번호는 평문 저장·로그 기록을 금지한다. 인증정보는 다른 개인정보와 논리적으로 분리된 저장소에 보관하며, 데이터베이스 및 백업 매체는 암호화한다. 접근 권한은 인증 모듈과 보안 담당 등 최소 인원에게만 부여하고, 권한 부여·변경·말소 기준을 운영한다. 관리자·DB 접속 및 해시 조회 등 주요 행위는 접속기록으로 남기고 위·변조 방지 조치를 적용하여 정기 점검한다. 로그인 시도 제한, 비정상 접근 차단, 악성코드 대응 프로그램의 설치·주기적 갱신 등 기술적 통제를 운영한다. 내부관리계획을 수립하여 취급자 교육, 계정·권한 관리, 패치·취약점 점검 절차를 이행한다. 비밀번호는 보유기간 경과 또는 회원 탈퇴 시 지체 없이 복구 불가능한 방법으로 삭제하며, 백업본은 주기적 순환 삭제로 파기하고 파기 이력을 기록한다. 법령상 보존이 필요한 자료는 분리 보관한다. 제3자 제공 및 외부 전송은 하지 않으며, 시스템 유지보수 등을 위탁할 경우 처리 범위, 재위탁 제한, 암호화·접근통제 등 안전조치, 사고 통지, 반환·파기, 점검·교육 등 내용을 계약에 포함하고 수탁자를 정기적으로 감독한다. 해시 알고리즘 및 비용 파라미터는 주기적으로 점검하며, 기준 상향 시 로그인 시점에 재해싱을 적용한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "원문은 청소년수련관 계정 비밀번호 저장(내부 DB, MD5 일방향 처리)에 초점이 있는데, REWRITTEN은 위탁 관리 조항, 광범위한 일반 보안통제(악성코드 대응, 전반적 DB/백업 전면 암호화 등)까지 포괄하여 원 시나리오 범위를 불필요하게 확장했습니다.", "fix": "불필요한 확대 서술을 비밀번호 처리 중심으로 축약하세요. 예시 수정: 1) 다음 문장을 삭제: \"시스템 유지보수 등을 위탁할 경우 처리 범위, 재위탁 제한, 암호화·접근통제 등 안전조치, 사고 통지, 반환·파기, 점검·교육 등 내용을 계약에 포함하고 수탁자를 정기적으로 감독한다.\" 2) 일반 보안 통제를 인증 관련 핵심으로 축소: \"로그인 시도 제한, 비정상 접근 차단, 악성코드 대응 프로그램의 설치·주기적 갱신 등 기술적 통제를 운영한다.\" → \"로그인 시도 제한 등 인증 관련 기술적 통제를 운영한다.\" 3) 비밀번호와 직접 관련된 영역으로 범위 한정: \"데이터베이스 및 백업 매체는 암호화한다.\" → \"비밀번호 해시가 저장된 영역과 해당 백업본은 암호화 또는 접근통제로 보호한다.\""}]}}
{"case_id": "2022-014-119", "respondent": "지방자치단체", "case_content": "지방자치단체는 지방행정·지방세 등 법령에 따른 사무 처리를 위해 필요한 최소 항목(신원 확인, 연락수단, 과세·민원 처리 관련 정보 등)을 수집한다. 수집 시 처리 목적과 보유기간을 고지하며, 목적 달성 후에는 지체 없이 파기하고, 법정 보존 대상은 분리 보관한다. 개인정보는 개인정보처리시스템과 백업 저장소에 저장 시 암호화하고, 전송 시 암호화 채널을 사용한다. 개인정보취급자에게는 개인별 계정을 발급하고 공용 계정은 사용하지 않으며, 역할 기반으로 최소권한을 부여한다. 외부(기관 외부 망)에서의 접속은 관리된 단말에 한해 가상사설망과 추가 인증을 적용하여 허용하며, 계정·권한에는 유효기간을 두고 정기적으로 재검토·말소한다. 장기간 미사용 계정은 자동 잠금·만료되며, 세션 타임아웃을 설정한다. 개인정보 파일의 다운로드·출력은 기본 차단을 원칙으로 하고, 필요한 경우에 한해 사유 기록과 승인 절차를 거쳐 최소 필드만 반출하도록 한다. 승인된 산출물은 자동 암호화되며, 반출은 보안매체로 제한하고 데이터 유출 방지(DLP)로 통제한다. 시스템 접근·처리·다운로드에 관한 접속기록은 위변조 방지 방식으로 보관하고 월 1회 이상 정기 점검·분석하며, 이상 징후에 대한 대응 절차를 운영한다. 개인정보처리시스템 및 단말에는 악성코드 방지, 취약점 점검 및 패치 관리를 수행하고, 물리적 접근은 출입통제와 잠금장치로 관리한다. 파기는 보유기간 경과 또는 처리 목적 달성 시 복구 불가능한 방법으로 수행하며, 파기 이력은 기록한다. 내부관리계획을 수립·시행하고 개인정보취급자에 대한 정기 교육을 실시한다. 다른 기관 제공 또는 위탁이 필요한 경우 처리 범위, 항목, 보유기간, 재위탁 제한, 안전조치, 사고 통지, 반환·파기 등을 문서화하고, 전송은 암호화 채널을 사용하며 처리 현황을 점검한다. 공공시스템은 접속기록 저장·분석, 관리책임자 지정, 권한 관리 등 운영 통제를 적용한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "공공시스템 관련 조치(시행령 제30조의2 제2항) 중, 정당한 권한 없는 접근이 확인된 경우 정보주체 통지 의무가 명시되어 있지 않음.", "fix": "case_content에 다음 문장을 추가: \"정당한 권한 없이 또는 허용된 권한을 초과하여 개인정보에 접근한 사실이 확인되면 지체 없이 정보주체에게 해당 사실과 피해 예방에 필요한 사항을 통지한다.\""}, {"aspect": "legality", "issue": "시행령 제30조 제1항 제3호 가목의 요구사항(개인정보처리시스템에 대한 침입 탐지·차단 조치)이 명시적으로 나타나지 않음.", "fix": "case_content의 보안 조치 부분에 다음 문장을 보강: \"개인정보처리시스템에 대하여 침입 탐지 및 차단 체계를 구축·운영하고, 관련 경보를 모니터링하여 대응한다.\""}]}}
{"case_id": "2022-014-114", "respondent": "지방자치단체(공공기관)", "case_content": "지방자치단체는 대표홈페이지와 지방행정·지방세 민원 처리 시스템을 운영하며, 민원 접수·처리 및 통지를 위해 필요한 최소 항목(성명, 주소, 연락처, 민원 내용, 처리 이력)만 수집한다. 온라인 제출 정보는 암호화 채널로 전송되고 내부 데이터베이스 저장 시 중요 항목은 암호화한다.\n개인정보취급자에게는 부서 공동 계정이 아닌 개인별 ID를 발급한다. 역할 기반으로 조회·등록·수정 권한을 구분하여 최소 권한만 부여하고, 계정 발급·변경·말소는 부서장 승인 후 수행한다. 인사이동·휴직·퇴직 시 즉시 계정을 비활성화하고 권한을 회수한다. 비밀번호는 정책에 따라 복잡도·주기 기준을 적용하며, 중요 기능 접근은 다단계 인증을 적용한다. 관리자 권한은 운영 계정과 분리한다.\n시스템 접근은 내부망 또는 승인된 VPN을 통해서만 허용하고, 접근통제장비로 IP·계정 기반 통제를 적용한다. 세션 타임아웃과 재인증을 적용한다. 개인정보처리시스템과 단말에는 악성코드 대응 프로그램을 설치·갱신하고, 침입 탐지·차단 등 보안장비를 운영한다.\n접속기록은 사용자 식별자, 접속일시, 출발지, 수행 기능, 처리 내역 등을 포함하여 보관하고, 위변조 방지 조치를 적용한다. 로그는 정기적으로 점검·분석하여 이상 징후를 확인한다.\n데이터베이스와 백업 매체는 암호화하며, 암호키는 별도 저장소에 분리 보관하고 접근 권한을 제한하며 사용 이력을 기록한다. 인증정보는 일방향 암호화 방식으로 저장한다. 서버실과 문서보관구역은 출입통제와 잠금장치로 관리한다.\n보유기간 경과 또는 처리 목적 달성 시 지체 없이 파기한다. 다른 법령에 따라 보존이 필요한 경우에는 관련 파일을 분리 보관하고 권한을 제한한다. 전자 파일은 복구 불가능한 방식으로 삭제하고, 종이 문서는 파쇄 또는 소각한다. 파기 이력은 기록한다.\n공공시스템별 관리책임자를 지정하고, 안전성 확보 조치를 포함한 내부관리계획을 수립·시행한다. 공공시스템 접속기록은 저장·분석·점검하며, 운영 현황을 주기적으로 자체 점검한다. 개인정보취급자 대상 정기 교육을 실시한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "공공기관으로서 법 제30조 및 제3조 제5항 관련(처리방침 수립·공개 및 권리보장)과 법 제32조(개인정보파일 등록)에 대한 준수 조치가 case_content에 명시되어 있지 않아 법·시행령 준수 여부가 서술상 불명확함.", "fix": "case_content 말미에 다음 문장을 추가: \"개인정보 처리방침을 수립·공개하고, 열람·정정·삭제·처리정지·전송요구 등 정보주체 권리 안내 및 처리 절차를 운영한다. 공공기관으로서 운용하는 개인정보파일은 법령에 따라 보호위원회에 등록·관리한다.\""}, {"aspect": "legality", "issue": "시행령 제30조의2 제2항(공공시스템에서 정당한 권한 없는 접근 사실 확인 시 정보주체 통지)에 관한 조치가 명시되어 있지 않음.", "fix": "접근통제·로그 관리 단락에 다음 문장을 추가: \"정당한 권한 없이 또는 허용된 권한을 초과한 개인정보 접근 사실이 확인되는 경우 지체 없이 정보주체에게 해당 사실과 피해 예방에 필요한 사항을 통지한다.\""}]}}
{"case_id": "2022-014-113", "respondent": "지방자치단체(공공기관)", "case_content": "지방자치단체는 ‘홈페이지 시스템’을 통해 안내, 민원·문의 접수, 전자신청 처리에 필요한 최소 항목(성명, 연락수단, 신청·문의 내용, 처리 결과 통지 정보)만 수집한다. 수집 시 전송구간은 암호화하고, 내부 저장은 DB·파일 단위 암호화를 적용한다.\n내부 직원은 개인별 계정으로 로그인하며, 업무 역할 기반으로 최소권한을 부여한다. 권한 부여·변경·말소는 결재를 거쳐 개인 단위로 시행하고, 사유와 승인자, 시점을 포함해 별도 감사로그로 기록·보관한다. 휴직·전보·퇴직 시 즉시 권한을 말소하고, 정기적으로 권한 적정성을 점검한다. 다중인증을 적용하고, 공용계정은 사용하지 않는다.\n개인정보처리시스템은 접속ID, 일시, 조회·출력·다운로드 대상(개인정보 항목·건수), 처리 내용, 요청·승인 사유를 포함한 접속기록을 생성·보관한다. 접속기록은 위변조 방지 조치를 적용해 보호하고, 자동 분석과 월 1회 이상 점검으로 이상 징후를 확인·조치한다.\n다운로드는 업무상 불가피한 경우에 한해 사전 승인과 사유 입력을 필수로 하고, 기본값은 화면 조회·보고서 출력으로 대체한다. 다운로드 파일은 표준 양식으로 암호화 저장되며, 워터마크·사용자 식별 정보가 포함된다. 주민등록번호 등 민감·고유식별정보는 수집·저장을 지양하고, 법령상 불가피한 경우에는 별도 분리영역에 암호화 보관하며 화면에서는 마스킹한다. 대량 반출은 차단하고, 외부 반출 시 추가 승인과 전송기록 보관 및 반출 후 회수·폐기 확인을 수행한다.\n운영기관은 내부관리계획을 수립·시행하고, 침입차단·탐지, 취약점 점검, 악성코드 대응, 백업·복구 체계를 유지한다. 서버실·자료보관구역은 출입통제와 잠금장치를 적용한다. 시스템 개발·운영·점검 이력은 변경관리 절차에 따라 기록한다.\n보존기간은 업무 목적·관련 법령에 따라 설정하고, 기간 만료 또는 목적 달성 시 전자파일은 복구 불가능한 방식으로 삭제하고, 종이 문서는 파쇄·소각한다. 백업본도 동일 기준으로 관리·파기한다. 처리업무 위탁 시 위탁범위, 재위탁 제한, 접근권한 통제, 사고 통지, 점검·감독, 반환·파기 절차를 계약에 반영하고 이행을 확인한다.\n공공시스템 운영 책임부서를 지정하고 관리책임자를 두며, 공공시스템 접속기록의 저장·분석·점검 절차를 운영한다. 정당한 권한 없이 또는 허용 범위를 초과한 접근이 확인되면 지체 없이 차단·조치하고, 필요한 경우 정보주체 통지 절차에 따라 안내한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "공공시스템의 무권한/권한초과 접근 확인 시 정보주체 통지를 \"필요한 경우\"로 한정하여, 시행령 제30조의2 제2항의 지체 없는 통지 의무(무조건적 통지)를 충분히 반영하지 못함.", "fix": "다음 문장을 교체하십시오.\n- 교체 전: \"정당한 권한 없이 또는 허용 범위를 초과한 접근이 확인되면 지체 없이 차단·조치하고, 필요한 경우 정보주체 통지 절차에 따라 안내한다.\"\n- 교체 후: \"정당한 권한 없이 또는 허용 범위를 초과한 접근이 확인되면 지체 없이 해당 정보주체에게 그 사실과 피해 예방을 위한 사항을 통지한다. 이 경우 법 제34조 및 시행령 제30조의2에 따른 통지 절차를 따른다. 다만, 법 제34조제1항 또는 다른 법령에 따라 이미 통지한 경우에는 그 통지로 갈음한다.\""}, {"aspect": "minimal_change", "issue": "원문은 단순히 자치단체 홈페이지 시스템에서 개인정보를 저장·접근·다운로드 가능한 운영상태를 묘사하였으나, REWRITTEN은 \"안내\" 등 구체 서비스 범위를 추가로 열거하여 불필요하게 사업 시나리오 범위를 넓힘.", "fix": "서비스 항목 열거를 축약하여 원 시나리오의 범위를 유지하십시오. 첫 문장을 다음과 같이 수정:\n- 교체 전: \"지방자치단체는 ‘홈페이지 시스템’을 통해 안내, 민원·문의 접수, 전자신청 처리에 필요한 최소 항목(성명, 연락수단, 신청·문의 내용, 처리 결과 통지 정보)만 수집한다.\"\n- 교체 후: \"지방자치단체는 ‘홈페이지 시스템’을 통해 제공하는 기존 서비스 수행에 필요한 최소 항목(성명, 연락수단, 요청 내용, 처리 결과 통지 정보)만 수집한다.\""}]}}
{"case_id": "2024-223-710", "respondent": "피심인(공공기관)", "case_content": "피심인(공공기관)은 2023-12-19부터 2024-02-29까지 소관 업무 수행을 위해 소속 698명의 정보를 처리한다. 수집 항목은 업무 식별 및 연락에 필요한 최소 범위(성명, 내부식별자, 연락수단, 생년월일 일부 등)로 한정하며, 병명 등 건강정보는 법령상 소관 업무 수행에 필요한 범위에서만 처리하고, 필요한 경우 별도 동의를 받아 분리 수집한다. 수집·전송 구간은 암호화 채널(TLS)을 사용한다.\n내부 시스템에는 일반정보와 민감정보를 논리적으로 분리하여 파일 형태로 저장하되, 저장 시 강한 암호화와 키 관리 체계를 적용한다. 접근 권한은 역할 기반으로 최소화하고, 담당자 개인별 계정·2단계 인증을 사용하며, 권한 부여·변경·말소 내역을 기록한다. 개인정보처리시스템 및 파일 접근에 대한 접속기록과 다운로드 이력을 보관하고 위·변조 방지 조치를 적용하여 정기 점검한다. 악성코드 방지, 취약점 점검, 물리적 출입통제 등 보호조치를 운영한다.\n결과를 게시할 때는 웹 기반 앱에 개인을 식별할 수 없는 형태의 데이터(가명처리 또는 통계값)만 업로드한다. 개인별 결과 제공이 필요한 경우에는 본인확인 후 해당 정보주체만 열람할 수 있도록 별도 화면에서 제공한다. 앱 저장소에는 서버측 암호화를 적용하고, 공개 범위는 기본 비공개로 설정하며, 열람 권한은 승인된 계정으로만 부여한다. 링크는 임의 공유·직접 조회가 불가능하도록 토큰 만료, 도메인 제한, 검색엔진 노출 차단을 설정한다. 게시 전 자동 검사로 식별정보·민감정보 포함 여부를 탐지하고, 필요 시 마스킹하며, 2인 승인 절차를 거친다.\n운영업체에 위탁하는 경우 처리 범위, 재위탁 제한, 암호화·접근통제·로그관리 등 안전조치, 사고 통지, 점검·감독, 종료 시 반환·파기 절차를 포함한 계약을 체결한다. 수탁사에는 담당자별 계정을 부여하고 접속기록을 보관하며, 전송·저장 단계 모두 암호화를 적용한다. 위탁 현황은 공개하고 정기적으로 이행 여부를 점검한다.\n보유기간은 업무 목적, 관련 기준 및 민원 대응 필요성을 반영해 최소 기간으로 설정·관리한다. 보유기간 경과 또는 목적 달성 시 본시스템과 백업 매체에서 복구 불가능한 방식으로 영구 삭제하고, 불가피한 보존이 필요한 경우에는 다른 정보와 분리 보관한다. 파기 결과와 이력은 기록·관리한다.\n정보주체에게는 처리 목적, 항목, 보유기간, 권리행사 방법을 안내하고, 열람·정정·삭제·처리정지·전송 요구 창구를 운영한다. 노출 징후나 이상 접속이 탐지되면 즉시 차단·회수 조치를 하고, 해당 사실과 필요한 정보를 지체 없이 통지·신고하는 절차를 가동한다. 내부관리계획을 수립·현행화하고, 전 직원 및 수탁사 담당자에게 정기 교육을 실시한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 2}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "원 사건의 핵심 사실(무권한 열람 가능 상태, 게시·삭제 시각, 통지·조치 내역)이 삭제되고 수집 항목과 시제가 변경됨.", "fix": "다음으로 교체/추가: 1) 문장 교체: '피심인(공공기관)은 2023-12-19부터 2024-02-29까지 소관 업무 수행을 위해 소속 698명의 정보를 처리한다. 수집 항목은 업무 식별 및 연락에 필요한 최소 범위(성명, 내부식별자, 연락수단, 생년월일 일부 등)로 한정하며, 병명 등 건강정보는 법령상 소관 업무 수행에 필요한 범위에서만 처리하고, 필요한 경우 별도 동의를 받아 분리 수집한다.' → '피심인(공공기관)은 2023-12-19부터 2024-02-29까지 업무 수행을 위해 소속 698명의 성명, 성별, 생년월일 등 개인정보와 병명 등 민감정보를 수집하여 내부 시스템에 파일 형태로 보관하였다.' 2) 사실 복원 문단 추가: '피심인은 결과를 게시하기 위해 웹 기반 앱에 내부용 자료 파일을 업로드하는 과정에서 해당 문서를 암호화 없이 앱 저장소에 저장하였고, 게시 시 열람 권한 제한이 적용되지 않아 권한이 없는 사용자가 화면 또는 링크를 통해 조회할 수 있는 상태였다. 해당 파일은 2024-02-22 14:00에 게시된 후 약 14:40에 삭제되었으며, 이후 사이트 초기화와 회원 접속 차단을 실시하고 운영업체에 저장본의 영구 삭제를 요청하여 확인서를 수령하였다. 피심인은 2월 23일부터 정보주체에게 개별 통지하고 다운로드 자료의 자체 삭제를 안내했으며, 전 직원 및 용역업체 대상 교육을 실시하고 개인정보 처리방침과 내부관리계획을 현행화하였다.' 3) 시제 정정: 본문 전반의 '처리한다' 등을 '처리하였다' 등 과거 시제로 통일."}, {"aspect": "minimal_change", "issue": "violated_articles가 원본문의 위반 조항에서 빈 배열로 변경됨.", "fix": "violated_articles 값을 원문과 동일하게 복원: [\"개인정보 보호법 제23조\", \"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제30조\"]"}, {"aspect": "legality", "issue": "유출 통지·신고의 법정 기한(시행령 제39조·제40조: 72시간 이내)이 명시되지 않아 절차의 충족 여부가 불명확함.", "fix": "해당 문장을 다음과 같이 수정: '노출 징후나 이상 접속이 탐지되면 즉시 차단·회수 조치를 하고, 해당 사실과 필요한 정보를 지체 없이 통지·신고하는 절차를 가동한다.' → '노출 징후나 이상 접속이 탐지되면 즉시 차단·회수 조치를 하고, 법 제34조 및 시행령 제39조·제40조에 따라 72시간 이내 서면등의 방법으로 정보주체에게 통지하고 보호위원회 또는 한국인터넷진흥원에 신고한다.'"}, {"aspect": "legality", "issue": "가명정보를 처리할 수 있도록 한 경우(가명처리 또는 통계값 업로드) 관련 기록 작성·보관 및 추가정보 분리 보관 등 의무(법 제28조의4, 시행령 제29조의5)가 명시되지 않음.", "fix": "다음 문장을 결과 게시 단락에 추가: '가명정보를 처리하는 경우에는 추가정보를 분리 보관하고 접근권한을 분리하며, 처리 목적, 가명처리 항목, 이용내역, 제3자 제공 시 제공받는 자, 처리기간 등 관련 기록을 작성·보관한다.'"}]}}
{"case_id": "2024-223-712", "respondent": "공공기관(명칭 비공개)", "case_content": "공공기관(명칭 비공개)은 시설 안전 및 범죄 예방을 위해 기관 내 고정형 CCTV를 필요한 구역과 시간대에 한정하여 운영한다. 공공기관의 설치인 경우 공청회·설명회 등 절차를 거쳐 관계 전문가 및 이해관계인의 의견을 수렴한다. 안내판에 설치 목적, 위치, 촬영 범위·시간, 관리책임자 연락처를 표시하고, 임의 조작 및 녹음 기능은 사용하지 않는다.\n수집된 개인영상정보는 기관 내부 영상관리시스템에 저장되며, 저장 시 암호화하고 전송은 암호화 채널을 사용한다. 접근 권한은 최소한으로 부여하고 개인별 계정으로 인증하며, 권한 변경·말소 이력을 포함한 접속기록을 보관·점검한다. 저장 장비는 출입통제되는 공간에 보관하고, 악성코드 대응 프로그램과 보안 패치를 주기적으로 적용한다.\n보관기간은 운영 목적 달성에 필요한 최소 기간(예: 30일)으로 설정하고 자동 삭제한다. 사건·민원 처리 또는 열람 요청으로 보존이 필요한 경우 해당 구간만 별도 저장소에 분리 보관하며, 사유·기간을 기록하고 접근을 추가로 제한한다. 보존기간 경과 시 전자파일은 복구 불가 방식으로 삭제하고, 출력물은 파쇄 또는 소각한다.\n법정대리인으로부터 특정 일시의 영상 열람을 접수하면 신청서·신분증 및 법정대리권 확인 후 정보공개심의회 절차를 거친다. 타인이 함께 촬영된 경우에는 타인에 대한 비식별 조치 가능성과 동의 필요성을 검토하였으며, 해당 사유로 이 요청 건은 열람 제공을 진행하지 않았다. 이 결정 및 검토 내용은 기록·보관하고, 영상 파일은 외부 제공이나 전송 없이 기관 내부에서 계속 보관한다. 열람을 연기하거나 거절하는 경우에는 접수일로부터 10일 이내에 연기·거절 사유와 이의제기 방법을 통지한다.\n제공·열람 과정에서 외부 전송은 지양하며, 불가피하게 외부 제공이 필요한 경우에는 법적 근거 또는 정보주체 동의를 확보한 뒤 대상·범위·보유기간을 고지하고 안전조치를 적용한다. 모든 열람·제공 처리에 대해 신청 내용, 검토 결과, 제공 여부 및 범위, 담당자, 일시를 기록·보관한다.\nCCTV 운영·관리 방침과 개인정보 처리방침을 수립·공개하고, 관련 개인정보파일은 목적, 항목, 보유기간 등 관리 사항을 등록·관리한다. 고정형 영상정보처리기기 설치·운영 사무 또는 유지보수 등을 위탁할 경우 처리 범위, 재위탁 제한, 접근 통제, 사고 통지, 점검·감독, 업무 종료 시 반환·파기 절차를 포함한 문서를 체결하고, 안내판 등에 수탁자 정보를 표시한다. 수탁자의 접근은 개인별 계정으로 제한하며 접속기록을 점검한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "열람 거절 사유와 범위 제한 제공(부분 열람) 검토 결과가 법 조문 기준(법 제35조제4항, 영 제42조제1항)에 명시적으로 연결되지 않아, 전체 거절이 정당했는지 판단이 모호함. 또한 열람 허용 시 10일 내 제공 통지 의무(영 제41조제4항~제5항)가 명시적으로 드러나지 않음.", "fix": "case_content 중 열람 거절 관련 문단에 다음 문장을 덧붙이세요: \"이 경우, 타인의 생명·신체 또는 재산 등 이익을 부당하게 침해할 우려가 있어 법 제35조제4항제2호에 해당하며, 모자이크 등 비식별 조치가 기술적·시간적으로 불가능하여 일부 열람 제공도 불가함을 확인하였다. 승인되는 경우에는 열람 요구를 받은 날부터 10일 이내에 열람 가능 일시·장소를 통지하고 열람을 제공한다.\""}, {"aspect": "legality", "issue": "고정형 영상정보처리기기 운용 제한 규정(법 제25조제5항)의 문구 취지가 모호하게 표현됨(\"임의 조작\"만 언급). 법 문언에 맞게 '설치 목적과 다른 목적으로 임의 조작 또는 다른 곳 비춤 금지'를 명확화 필요.", "fix": "case_content의 \"임의 조작 및 녹음 기능은 사용하지 않는다.\"를 다음으로 교체하세요: \"설치 목적과 다른 목적으로 카메라를 임의로 조작하거나 다른 곳을 비추지 않으며, 녹음 기능은 사용하지 않는다.\""}, {"aspect": "minimal_change", "issue": "원문에 기재된 violated_articles가 공란으로 변경되어 시나리오 부수 정보가 불필요하게 변형됨.", "fix": "REWRITTEN의 violated_articles를 원문과 동일하게 복원하세요: \"violated_articles\": [\"개인정보 보호법 제35조제3항\", \"개인정보 보호법 제75조제2항제10호\", \"개인정보 보호법 시행령 제63조\"]"}]}}
{"case_id": "2024-223-711", "respondent": "피심인 공공기관", "case_content": "피심인 공공기관은 홈페이지에 2024학년도 관련 안내 자료를 게시한다. 공개 페이지에는 개인을 식별할 수 있는 정보와 민감정보를 포함하지 않도록 사전에 비식별·가림 처리된 공개용 버전만 게시하며, 개별 대상자 통지가 필요한 경우에는 로그인 기반의 전용 포털에서 본인확인을 거친 뒤 최소 항목(필요 시 대체식별자, 연락수단)에 한해 열람하도록 제공한다.\n게시 전에는 생산 부서의 자체 점검과 별도 승인자의 2인 검토를 거치며, 업로드 시 문서 내 주민등록번호·연락처·건강정보 등 패턴을 자동 탐지하여 포함 시 업로드를 차단한다. 업로더 권한은 지정된 담당자에게만 부여하고 역할 분리(작성-검토-승인)를 적용한다. 계정은 개인별로 발급하며 다단계 인증을 적용하고, 전송은 암호화 채널을 사용한다. 홈페이지 및 게시관리시스템의 접속기록(접속일시, 변경 내역 등)은 위변조 방지 조치와 함께 보관·점검한다.\n원본 자료 중 개인정보가 포함될 수 있는 문서는 내부 저장소에만 보관하며, 저장 시 암호화하고 업무상 필요한 최소 인원에게만 접근권한을 부여한다. 공개 목적 달성 또는 보존기간 만료 시 전자파일은 복구 불가능한 방식으로 삭제하고, 종이 문서는 파쇄 또는 소각한다. 파기 및 접근권한 변경 이력은 기록한다.\n외부 기관이 운영하는 별도 사이트에 동 자료를 게시할 필요가 있는 경우 공개용 버전만 제공하며, 전송은 암호화 채널을 사용한다. 공동게시·위탁 또는 협업이 수반될 때에는 처리 범위, 재위탁 제한, 보안 통제, 사고 통지, 반환·파기 절차와 점검·감독 방안을 문서화하고, 게시 기간 종료 시 삭제·차단 완료 여부를 확인·기록한다.\n운영 과정에서는 악성코드 방지 프로그램의 주기적 갱신, 정기 권한점검 및 담당자 교육을 실시하며, 게시 후에도 자동 모니터링으로 개인정보 포함 여부를 점검한다. 노출 우려 탐지 시 즉시 게시 중단, 원인 제거, 검색캐시 삭제 요청 및 관련 기록 보존 등 대응 절차를 가동한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "민감정보/고유식별정보 처리의 법적 근거와 한정 조건이 명시되지 않아 법 제23조, 제24조의2 및 법 제15조의 범위 내 처리 여부가 불명확함.", "fix": "case_content의 업로드 전 점검 및 권한 통제 단락 끝에 다음 문장을 추가: \"민감정보 또는 고유식별정보를 처리해야 하는 경우에는 관련 법령에 근거하거나 정보주체의 별도 동의를 확보한 경우에 한하여 처리하며, 불가피한 경우에 한정하여 최소 항목만 처리한다.\" 또한 주민등록번호 등 고유식별정보에 대해서는 법령 허용 범위 내 처리임을 명시: \"주민등록번호 등 고유식별정보는 법령에서 허용하는 경우에만 처리하고, 저장 시 암호화하여 보관한다.\""}, {"aspect": "legality", "issue": "유출 등 사고 발생 시 정보주체 통지(72시간 이내) 및 보호위원회/전문기관 신고 기준(민감정보 유출, 1천명 이상, 외부 불법접근 등)에 관한 절차가 누락되어 법 제34조 및 시행령 제39조·제40조 충족이 불명확함.", "fix": "case_content의 마지막 ‘운영 과정…대응 절차’ 문단 끝에 다음 문장을 추가: \"유출 등이 확인된 경우에는 72시간 이내 해당 정보주체에게 통지하고, 민감정보 유출, 1천명 이상 유출, 외부 불법적 접근에 의한 유출 등 신고 대상에 해당하면 보호위원회 또는 한국인터넷진흥원에 지체 없이 신고한다. 법 제34조 및 시행령 제39조·제40조에 따라 추가로 확인되는 내용은 확인 즉시 추가 통지·신고한다.\""}]}}
{"case_id": "2024-223-713", "respondent": "피심인(비영리법인)", "case_content": "비영리법인은 홈페이지 회원관리, 행사 안내 및 뉴스레터 발송을 위해 회원 DB를 운영한다. 회원 가입 시 필수 항목은 성명, 이메일, 휴대전화로 한정하고, 주소는 우편물 발송이 필요한 경우에만 별도 선택으로 수집한다. 수집 시 목적, 항목, 보유기간, 동의 거부권 및 불이익 여부를 고지하며, 선택 항목 미동의로 인한 서비스 제한이 없도록 한다. DB는 웹서버와 분리된 내부망에 배치하고 애플리케이션 서버에서 사설망으로만 접속한다. 운영용 root 계정은 비활성화하고 담당자별 최소권한 계정을 발급·관리하며, 권한 부여·변경·말소와 정기 점검 절차를 운용한다. 관리자 페이지는 인터넷에 직접 노출하지 않고 VPN 기반 전용 경로와 사전 등록된 IP에서만 접속 가능하도록 하며, 사용자명·비밀번호 외 일회용 비밀번호 등 다단계 인증을 적용한다. 네트워크 경계에는 방화벽 및 웹방화벽을 구축하고, 침입 탐지·차단, 취약점 점검 및 보안패치를 정기 수행한다. 악성코드 방지 프로그램을 설치하여 자동 업데이트 및 주기적 검사를 실시한다. 개인정보 전송은 TLS로 암호화하고, 저장 시 전화번호·이메일·주소 등은 열 단위 암호화하며, 인증정보는 강한 알고리즘으로 일방향 해시 처리한다. 암호화 키는 분리된 키관리시스템에 보관하고 접근을 통제한다. 개인정보처리시스템 및 DB 접근기록을 분리 저장하여 위·변조 방지 기능과 함께 보관·점검하며, 비정상 행위에 대한 모니터링을 수행한다. 백업은 주기적으로 암호화하여 별도 매체 및 분리된 위치에 보관하고, 복구 테스트를 정기 실시한다. 회원정보는 서비스 제공 및 고지 목적 범위에서만 이용하며, 보유기간 경과 또는 탈퇴 시 지체 없이 복구 불가능한 방식으로 파기한다. 다른 법령에 따라 보존이 필요한 경우에는 본 데이터와 분리 보관하고, 기간 종료 후 파기하며, 파기 결과는 기록으로 남긴다. 서버실 등 보관구역은 출입통제 및 잠금장치 등 물리적 조치를 적용한다. 서버 호스팅 및 문자·이메일 발송 등은 수탁사를 통해 수행할 수 있으며, 위탁계약에 처리 범위, 재위탁 제한, 접근통제·암호화 등 안전조치, 사고 통지, 점검, 반환·파기 절차를 명시하고 정기적으로 이행 여부를 점검한다. 내부 관리계획을 수립하여 개인정보취급자 범위를 최소화하고 정기 교육, 계정관리, 반출통제, 패치·취약점 관리 절차를 운영한다. 개인정보 처리방침과 권리행사 절차(열람·정정·삭제·처리정지·동의철회)는 홈페이지에 공개하며, 이상 징후 탐지, 통지 및 관계기관 신고 절차를 포함한 대응 프로세스를 마련해 운영한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "원문에는 명시되지 않은 추가 목적(‘행사 안내 및 뉴스레터 발송’)이 도입되어 사업 시나리오가 불필요하게 확장됨.", "fix": "case_content 첫 문장을 다음과 같이 수정: \"비영리법인은 홈페이지 회원관리를 위해 회원 DB를 운영한다.\" 또는 기존 문구에서 \"행사 안내 및 뉴스레터 발송\"을 삭제하여 \"비영리법인은 홈페이지 회원관리 및 고지 안내를 위해 회원 DB를 운영한다.\"로 조정."}]}}
{"case_id": "", "respondent": "", "case_content": "문서 접수 및 문의 대응을 위해 이용자가 제공하는 자료의 범위를 업무 판단에 필요한 최소 항목(성명, 연락수단, 문의 내용, 관련 파일)으로 한정한다. 제출 파일에는 주민등록번호 등 불필요한 고유식별정보가 포함되지 않도록 사전 안내하고, 업로드 시 패턴 검사를 통해 해당 정보가 탐지되면 접수를 차단하거나 가림 방법을 안내한다. 수집 정보는 암호화된 전송 채널을 통해 접수하며 저장 시 암호화한다. 접근 권한은 담당자에게 최소한으로 부여하고 계정은 개인별로 발급하며, 접속기록을 보관하고 위조·변조 방지 조치를 적용한다. 수집 목적은 문의 확인 및 회신, 의뢰 처리로 한정하고, 마케팅 정보 수신은 별도 선택 항목으로 분리하여 동의하지 않아도 서비스 이용에 영향이 없도록 한다. 외부 시스템 또는 수탁사를 이용하는 경우 위탁 범위, 재위탁 제한, 안전조치, 사고 통지, 반환·파기 절차를 문서화하고 정기 점검으로 수행 현황을 확인한다. 보존기간은 문의 처리 완료 후 정해진 기간으로 설정하고, 기간 경과 또는 목적 달성 시 지체 없이 파기한다. 전자 파일은 복구 불가능한 방식으로 삭제하고, 서면은 파쇄 또는 소각한다. 법령에 따라 보존이 필요한 경우에는 별도 저장소에 분리하여 관리한다. 정보주체는 열람, 정정·삭제, 처리정지, 동의 철회를 요청할 수 있으며, 요청이 접수되면 본인 확인 후 절차에 따라 처리한다. 목적 외 이용·제공은 내부 판단 기준(목적과의 관련성, 정보주체 불이익 발생 가능성, 안전조치 적용 여부 등)에 따라 검토하며 필요한 경우 별도 동의를 받은 후 수행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 1}, "pass": false, "problems": [{"aspect": "legality", "issue": "목적 외 이용·제공에 대한 기준이 내부 판단 기준과 '필요한 경우 동의'로만 표현되어 있어 법 제18조(목적 외 이용·제공 예외) 및 법 제15조제3항(합리적으로 관련된 범위) 요건을 구체적으로 반영하지 못함.", "fix": "case_content의 마지막 문장을 다음으로 교체: \"목적 외 이용·제공은 법 제18조제2항 각 호에 해당하거나 법 제15조제3항에 따른 합리적으로 관련된 범위인 경우에 한하여 수행하며, 그 외에는 정보주체의 별도 동의를 받은 후에만 수행한다.\""}, {"aspect": "legality", "issue": "정보 수집 시 동의 고지 항목(수집·이용 목적, 항목, 보유·이용 기간, 동의 거부권 및 불이익)을 명시하지 않아 법 제15조제2항 및 영 제17조의 요건 고지가 누락될 소지.", "fix": "첫 문단(수집 범위 한정)을 잇는 문장으로 다음을 추가: \"수집 시에는 개인정보의 수집·이용 목적, 수집 항목, 보유 및 이용 기간, 동의 거부 권리 및 거부에 따른 불이익을 명확히 고지하고 필요한 경우 동의를 받는다.\""}, {"aspect": "legality", "issue": "제3자 제공 시 정보주체에게 제공받는 자, 목적, 항목, 보유·이용 기간, 동의 거부권 등을 고지하고 동의를 받는 절차가 명시되지 않음(법 제17조제2항).", "fix": "위탁·외부 시스템 관련 문단 이후에 다음을 추가: \"제3자 제공이 필요한 경우에는 제공받는 자, 제공 목적, 제공 항목, 보유·이용 기간, 동의 거부 권리 및 거부에 따른 불이익을 사전에 알리고 별도 동의를 받은 후 제공하며, 법령에 근거한 경우에 한해 동의 없이 제공한다.\""}, {"aspect": "legality", "issue": "업무 위탁 시 수탁자와 위탁 내용의 대외 공개 의무(법 제26조제2항, 영 제28조제2항)가 누락됨.", "fix": "위탁 관련 문장 끝에 다음을 추가: \"위탁하는 업무의 내용과 수탁자를 인터넷 홈페이지 등에 상시 공개한다.\""}, {"aspect": "legality", "issue": "기술적 보호조치 중 악성코드 방지 프로그램 설치·운영 및 갱신(영 제30조제1항제6호)에 대한 언급이 없음.", "fix": "접근통제·접속기록 문장 다음에 다음을 추가: \"개인정보처리시스템 및 업무용 단말기에 악성코드 방지 프로그램을 설치·운영하고 주기적으로 갱신·점검한다.\""}, {"aspect": "legality", "issue": "정보주체 권리 행사에 대한 처리 기한 및 통지 절차(열람·정정·삭제·정지 등 10일 이내 통지: 영 제41조제4항·제5항, 제43조제3항, 제44조제2항)가 불명확함.", "fix": "정보주체 권리 문단에 다음을 추가: \"열람, 정정·삭제, 처리정지, 동의 철회 요청은 접수일로부터 10일 이내에 조치하고 결과를 통지한다.\""}, {"aspect": "legality", "issue": "유출 통지·신고 체계(법 제34조, 영 제39조·제40조)의 기본 원칙이 누락되어 사고 대응 의무가 불명확함.", "fix": "파기·보존 문단 뒤에 다음을 추가: \"개인정보 유출 등을 인지한 경우에는 72시간 이내에 정보주체에게 통지하고, 요건에 해당하는 경우 보호위원회 또는 전문기관에 신고한다.\""}, {"aspect": "minimal_change", "issue": "원본은 '자료 부재로 분석 불가' 안내만 있으나, 재작성본은 새로운 업무 시나리오(문의 접수 처리 정책)를 창설하여 원 시나리오를 불필요하게 변경함.", "fix": "case_content를 원문 수준으로 환원: \"문서 내용이 제공되지 않아 분석을 진행할 수 없습니다. \\\"의결(2/별지3) - 1\\\" 파일의 전체 본문(피심인, 사건번호, 사실관계, 관련 법 조항이 포함된 부분)을 붙여 주시면, 해당 내용을 바탕으로 사건별 JSON을 작성하겠습니다.\" 그리고 기존 REWRITTEN의 정책 서술은 삭제."}]}}
{"case_id": "2023-018-236", "respondent": "ㅇㅇㅇㅇㅇ청", "case_content": "ㅇㅇㅇㅇㅇ청은 관내 학원 현황을 관리하기 위해 업무상 필요한 최소 항목만 수집·이용한다. 내부 관리용으로는 학원명, 소재지, 사업자 연락처, 교습과정, 교습비, 강사 성명 및 자격 확인 정보 등으로 구성하며, 주민등록번호 등 고유식별정보는 수집·처리하지 않는다. 법령 근거로 불가피하게 고유식별정보가 포함된 서류가 제출되는 경우에는 제출 단계에서 마스킹을 안내하고, 서버 측 패턴 검사로 해당 정보가 감지되면 접수를 차단한다. 불가피하게 접수된 경우에는 별도 저장소에 분리 보관하고 강력한 암호화, 최소 권한, 접근기록 보관 후 즉시 불필요 부분을 삭제한다.\n정보공개시스템을 통한 공개본은 기관 식별과 서비스 안내에 필요한 범위(학원명, 소재지, 대표 연락처, 교습과정, 교습비 범위 등)로만 편성하며, 개인 식별이 가능한 강사 성명 등은 공개본에서 제외하거나 통계·집계 형태로 대체한다. 공개 전 자동·수동 이중 검토(숨김 시트·메타데이터 제거, 주민등록번호·연락처 등 패턴 검출) 절차를 거쳐 비식별 여부를 확인하고 승인 워크플로우를 통해 게시한다. 공개 파일은 원본과 분리된 별도 저장소에 보관하며, 수정·게시·삭제 이력과 검토 결과를 기록한다.\n내부 저장 데이터는 전송·저장 시 암호화하고, 담당자별 개별 계정으로 역할 기반 접근 권한을 부여한다. 개인정보처리시스템 접근기록(접속일시, 처리내역 등)을 주기적으로 점검하고 위·변조 방지 조치를 적용한다. 악성코드 방지, 취약점 점검, 화면 잠금 등 기술적 보호조치를 운영하며, 열람·반출은 승인 절차를 거친다. 위탁이 필요한 경우 처리 범위, 재위탁 제한, 보안통제, 사고 통지, 반환·파기 등을 포함한 계약을 체결하고 수행 현황을 점검한다.\n보존기간은 목적 달성 및 관련 규정에 따른 최소 기간으로 설정하고, 기간 만료 또는 목적 달성 시 복구 불가능한 방법으로 파기한다. 장기 보존이 필요한 자료는 다른 개인정보와 분리 보관한다. 공개 범위 및 보관·파기 기준, 열람·정정·삭제·처리정지 요구 방법은 홈페이지 처리방침에 게시하고, 정기 교육과 내부관리계획에 따라 점검을 수행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "고유식별정보 처리 관련 문장이 법령상 제출이 필수인 경우에도 일률적으로 접수를 차단하는 것으로 해석될 수 있어 법 제24조의2 제1항 제1호(법령 근거가 있는 경우 처리 허용)와 시행령 제21조의 암호화·안전조치 취지와 충돌 소지가 있음.", "fix": "해당 문단을 법령상 필수 제출 시에는 차단하지 않고 안전조치를 적용하도록 명확화하고, 불필요한 경우에만 반려하도록 수정. 텍스트-level 제안: 기존 문장\n\"법령 근거로 불가피하게 고유식별정보가 포함된 서류가 제출되는 경우에는 제출 단계에서 마스킹을 안내하고, 서버 측 패턴 검사로 해당 정보가 감지되면 접수를 차단한다. 불가피하게 접수된 경우에는 별도 저장소에 분리 보관하고 강력한 암호화, 최소 권한, 접근기록 보관 후 즉시 불필요 부분을 삭제한다.\"\n를 아래와 같이 교체:\n\"법령 근거로 고유식별정보 제출이 필요한 경우에는 비필수 항목 마스킹을 안내하되, 법령상 제출이 필수인 항목은 차단하지 않는다. 제출된 고유식별정보는 별도 저장소에 분리 보관하고 암호화, 최소 권한, 접근기록 보관 등 안전조치를 적용하며, 목적 달성 후 즉시 불필요 부분을 삭제한다. 법령 근거 없이 고유식별정보가 포함된 경우에는 서버 측 패턴 검사로 감지 시 접수를 반려하고 재제출을 요구한다.\""}, {"aspect": "legality", "issue": "공공기관으로서 개인정보파일 등록의무(법 제32조, 시행령 제33조)에 대한 준수 내용이 부재하여 법령·시행령 동시 충족 측면에서 누락 가능성이 있음.", "fix": "처리방침·관리체계 부분에 개인정보파일 등록 의무를 명시. 텍스트-level 제안(추가 문장):\n\"공공기관은 운용하는 개인정보파일을 법 제32조 및 시행령 제33조에 따라 등록·관리한다.\""}, {"aspect": "minimal_change", "issue": "원문 시나리오에는 내부 관리 항목에 대표자 성명이 포함되어 있었으나, 재작성본에서는 내부 항목에서 제외되어 업무 시나리오가 불필요하게 변경됨.", "fix": "내부 관리 항목에 대표자 성명을 복원. 텍스트-level 제안: 기존 문장\n\"내부 관리용으로는 학원명, 소재지, 사업자 연락처, 교습과정, 교습비, 강사 성명 및 자격 확인 정보 등으로 구성하며,\"\n을 아래와 같이 교체:\n\"내부 관리용으로는 학원명, 소재지, 대표자 성명, 사업자 연락처, 교습과정, 교습비, 강사 성명 및 자격 확인 정보 등으로 구성하며,\""}, {"aspect": "minimal_change", "issue": "공개본에서 강사 성명을 일률적으로 제외하도록 한 표현은 원문 시나리오(강사 성명 포함 파일 관리/공개)에서 불필요한 본질 변경 소지가 있음. 법령상 공개 근거가 있는 경우의 공개 가능성을 남겨두는 편이 시나리오 보존과 법적 정합성에 부합.", "fix": "법령상 공개 근거가 있는 경우에 한해 최소범위 공개 가능하도록 문구 조정. 텍스트-level 제안: 기존 문장\n\"개인 식별이 가능한 강사 성명 등은 공개본에서 제외하거나 통계·집계 형태로 대체한다.\"\n을 아래와 같이 교체:\n\"강사 성명 등 개인 식별 정보는 법령상 공개 근거가 있는 경우에 한해 최소 범위로 공개하고, 그 외에는 공개본에서 제외하거나 통계·집계 형태로 대체한다.\""}]}}
{"case_id": "2023-018-234", "respondent": "ㅇㅇㅇㅇ학교", "case_content": "ㅇㅇㅇㅇ학교는 장학금 수여 및 학자금 대출 관리를 위해 재학생·졸업생 정보를 처리한다. 수집 항목은 목적 달성에 필요한 최소 범위(성명, 학번, 재학·졸업 여부, 장학·대출 식별값, 연락수단 등)로 한정하며, 주민등록번호는 법령에 따른 필요 범위에서만 처리하고 전자적으로 보관되는 경우 암호화한다. 한국장학재단 전용 시스템을 통해 필요한 정보를 조회·제출하며, 자료 교환은 TLS 등 암호화 채널을 사용하고 불필요한 다운로드를 제한한다. 학사정보 매칭은 내부 폐쇄망의 업무 서버에서 수행하고, 제출용 산출물에는 주민등록번호를 포함하지 않으며 대체식별자 또는 마스킹 값을 사용한다. 가공 중인 파일은 공용 웹사이트와 분리된 암호화 저장소에 보관하고, 접근 권한은 최소 권한 원칙에 따라 담당자 개인계정으로만 부여하며 다단계 인증을 적용한다. 개인정보처리시스템 및 파일 저장소의 접속기록(접속일시, 처리내역 등)은 위·변조 방지 조치와 함께 보관·점검한다. 학교 홈페이지에는 장학 공지가 필요한 경우 성명·학번 일부 마스킹 등 최소 정보만 게시하고, 첨부파일 업로드 단계에서 주민등록번호 패턴 탐지로 개인정보 포함 파일을 자동 차단한다. 웹사이트 운영 및 시스템 유지보수를 외부에 맡기는 경우 위탁 범위, 재위탁 제한, 암호화·접근통제·로그관리 등 안전조치를 계약에 명시하고 정기 점검으로 이행 상황을 확인한다. 보유 기간은 장학·대출 업무 및 관련 법정 보존기간에 따르며, 기간 경과 또는 목적 달성 시 전자파일은 복구 불가능한 방식으로 삭제하고, 법정 보존 사유가 있는 정보는 다른 개인정보와 분리 보관한다. 유사시를 대비하여 통지·신고, 회수·차단, 재발 방지 절차를 포함한 내부관리계획을 운영하고, 담당자에 대한 정기 교육을 실시한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "불필요하게 구체적 사실(처리 시기 2023년 4~5월, 대상 규모 1,203명, 엑셀 형식)이 삭제되어 원사례의 맥락이 약화되었습니다. 또한 ‘제출용 산출물에는 주민등록번호를 포함하지 않음’은 외부 공지/게시 용도인지 대외 제출(예: 전용 시스템 제출)인지가 불명확하여, 원사례의 한국장학재단 전용 시스템 제출 맥락과 다르게 해석될 수 있습니다.", "fix": "다음과 같이 원사례의 핵심 맥락을 보강하세요.\n- 첫 문장 교체: \"ㅇㅇㅇㅇ학교는 장학금 수여 및 학자금 대출 관리를 위해 2023년 4~5월 동안 재학생·졸업생 1,203명의 정보를 처리하였다.\"\n- 가공 파일 형식 및 암호화 명시 추가(수집 항목 문단 뒤): \"제출용 자료 가공은 엑셀(XLSX) 파일 형식으로 수행하되, 파일 자체 암호화(AES-256 등)를 적용한다.\"\n- 전용 시스템에서의 주민등록번호 처리 범위 명확화(한국장학재단 문장 보완): \"법령상 필요한 경우에는 한국장학재단 전용 시스템 내에서 주민등록번호를 조회·제출하되, 시스템 외부 저장은 최소화하고 저장 시 암호화한다.\"\n- ‘제출용 산출물’ 범위 명확화: 기존 문장 \"제출용 산출물에는 주민등록번호를 포함하지 않으며 대체식별자 또는 마스킹 값을 사용한다.\"를 \"외부 게시 또는 대내 공지용 산출물에는 주민등록번호를 포함하지 않으며, 대체식별자 또는 마스킹 값을 사용한다.\"로 수정"}]}}
{"case_id": "", "respondent": "", "case_content": "의결서 등 사건 문서를 받아 요약·구조화(JSON) 결과를 제공하는 서비스다. 접수 시 의뢰인 식별 최소 항목(담당자명, 연락수단)과 과금에 필요한 결제 정보만 수집하며, 문서 외 불필요한 개인정보는 받지 않는다. 업로드 전 주민등록번호 등 고유식별정보와 민감정보는 제출하지 않도록 안내하고, 서버에서 패턴 검사로 해당 정보가 포함된 파일은 접수를 차단하거나 자동 마스킹한다. 문서와 결과물은 전송·저장 구간에서 암호화되며(전송 TLS, 저장 AES-256), 원본·가공 데이터·결제/연락처 정보는 논리적으로 분리 보관한다. 접근 권한은 업무상 필요한 담당자에 한해 개인별 계정과 다단계 인증으로 부여·관리하고, 권한 변경 이력과 처리·열람 등 접속기록을 최소 1년 이상 안전하게 보관·점검한다. 악성코드 방지, 취약점 점검, 물리적 통제 등 안전조치를 운영하며, 결과 전달은 만료기간이 있는 암호화 링크로 제공한다. 수탁사를 사용하는 경우 처리 범위, 재위탁 제한, 암호화·접근통제, 사고 통지, 반환·파기, 점검·감독을 포함한 계약을 체결하고 이행 여부를 정기 점검한다. 데이터는 국내 리전에서 저장·처리하며 국외 이전은 하지 않는다. 부득이한 국외 이전이 필요한 경우 이전 국가·이전 항목·목적·보유기간·거부 방법을 사전 고지하고 별도 동의를 받는다. 수집 목적 달성 후 원본 문서는 단기 보존 후 자동 파기하고(전자파일 영구삭제, 종이는 파쇄), 법적 의무로 보존이 필요한 항목은 다른 정보와 분리하여 최소 기간만 보관한다. 마케팅 정보 수신은 별도 선택으로 분리하며, 거부해도 서비스 이용에 영향이 없다. 추가적인 품질 개선·통계 목적 처리는 개인을 식별하지 못하도록 처리한 정보로만 수행하고, 처리방침에 수집 목적, 보유기간, 제공·위탁 현황, 국외 이전 여부, 권리행사 방법 등을 공개한다. 정보주체의 열람·정정·삭제·처리정지 및 동의 철회 요구를 위한 연락 창구를 제공하고, 보안사고 발생 시 통지 및 신고 절차에 따라 신속히 안내한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "수집·이용의 법적 근거(동의 또는 계약이행)가 명시되지 않아 법 제15조 및 동의 고지사항(제15조제2항) 충족 여부가 불분명함.", "fix": "case_content에 다음 문장을 추가: \"개인정보의 수집·이용 법적 근거: 서비스 제공 및 계약 이행을 위한 필수 정보(담당자명, 연락수단, 결제 정보)는 제15조제1항제4호(계약 이행) 근거로 처리하고, 선택 목적(마케팅 등)은 제15조제1항제1호에 따른 별도 동의를 받아 처리한다. 동의 시 목적, 항목, 보유기간, 동의 거부권 및 거부에 따른 불이익 여부를 고지한다(제15조제2항).\""}, {"aspect": "legality", "issue": "의뢰인으로부터의 문서 처리에 관한 위탁(수탁자) 관계 및 위탁계약 필수사항(법 제26조, 영 제28조)이 명시되지 않음.", "fix": "case_content에 다음 문장을 추가: \"의뢰인(개인정보처리자)과는 처리위탁(법 제26조) 계약을 체결하고, 계약서에 처리 범위, 재위탁 제한, 개인정보에 대한 접근 제한 등 안전조치, 처리 현황 점검·감독, 사고 통지, 반환·파기, 손해배상 책임 등 영 제28조 각 호의 사항을 명시한다.\""}, {"aspect": "legality", "issue": "개인정보 보호책임자(CPO) 지정 및 공개 의무(법 제31조, 영 제31조)가 구체적으로 나타나지 않음.", "fix": "case_content에 다음 문장을 추가: \"개인정보 보호책임자(CPO)를 지정하고, 처리방침에 성명(또는 담당부서명) 및 연락처를 공개한다(예: 개인정보 보호책임자: 홍길동, cpo@domain.com, 02-0000-0000).\""}, {"aspect": "legality", "issue": "내부관리계획 수립·시행·점검 등 영 제30조제1항제1호의 명시가 부족함.", "fix": "case_content에 다음 문장을 추가: \"개인정보 보호 내부관리계획을 수립·시행하고 정기 점검한다(교육, 권한관리, 위탁관리, 사고 대응 등 포함).\""}, {"aspect": "legality", "issue": "접속기록의 위·변조 방지(무결성 확보) 조치에 대한 영 제30조제1항제5호 요건이 명시적으로 드러나지 않음.", "fix": "case_content의 접속기록 문장에 다음을 보완: \"접속기록은 1년 이상 안전하게 보관하고, 전용 로그서버·무결성 검증(해시/서명) 등 위·변조 방지 조치를 적용하여 정기 점검한다.\""}]}}
{"case_id": "2023-018-235", "respondent": "ㅇㅇㅇ학교", "case_content": "ㅇㅇㅇ학교는 2022년도 ㅇㅇㅇㅇ ㅇㅇㅇ 합격자 발표를 위해 응시자 관리 시스템에서 필요한 최소 항목(성명, 연락수단, 지원분야, 권역, 수험번호, 선발결과)만 처리한다. 합격자 발표 목적에는 주민등록번호를 사용하지 않으며, 입학전형 등으로 별도 보유가 필요한 경우에는 저장 시 암호화하고 다른 정보와 분리 보관하며 접근 권한을 제한한다. 발표는 전용 조회 페이지에서 수험번호와 1회용 인증번호(사전에 등록된 연락처로 개별 발송)를 입력하는 방식으로 제공하고, 화면에는 합격 여부와 마스킹된 성명 일부만 표시한다. 대량 다운로드 파일은 제공하지 않으며, 검색로봇 차단과 조회 건수 제한, 캡차 및 재시도 제한 등 무단 대량 조회 방지 통제를 적용한다. 데이터는 전송 구간에 암호화 채널을 사용하고, 저장 시 주요 식별정보와 인증정보를 암호화한다. 발표용 데이터셋은 원본 신청서 데이터와 분리하여 구성하고 최소 기간만 운영한다. 접근 권한은 담당자에게만 개인별 계정으로 부여하며, 권한 부여·변경·말소 이력을 관리한다. 조회 및 처리 이력, 접속기록은 위변조 방지 조치를 적용해 보관·점검한다. 발표 기간 종료 후 발표용 데이터셋은 복구 불가능한 방식으로 파기하고, 파기 이력을 기록한다. 원본 신청서 및 선발 관련 기록은 내부 보존기준에 따라 보관하며, 보존기간 경과 시 복구 불가능한 방식으로 파기하거나 분리 보관한다. 홈페이지 운영 또는 호스팅을 위탁하는 경우 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 점검 및 반환·파기 절차를 계약에 명시하고, 수탁자에 대해 계정의 개인별 발급, 접근기록 보관 및 정기 점검을 통해 감독한다. 내부적으로 개인정보 보호책임자 지정, 내부관리계획 수립, 정기 교육, 악성코드 대응, 서버 물리적 통제 등을 운영한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "주민등록번호 처리의 법적 근거가 명시되지 않아 법 제24조의2 제1항(법령 근거 등 예외적 경우에 한함) 및 시행령 제21조의2 취지 충족 여부가 불명확함.", "fix": "다음 문장을 교체: \"합격자 발표 목적에는 주민등록번호를 사용하지 않으며, 입학전형 등으로 별도 보유가 필요한 경우에는 저장 시 암호화하고 다른 정보와 분리 보관하며 접근 권한을 제한한다.\" → \"합격자 발표 목적에는 주민등록번호를 사용하지 않으며, 주민등록번호는 법률·대통령령 등 법령에 근거해 처리가 불가피한 경우에 한하여 처리하고, 이때 전자적으로 보관하는 경우에는 암호화하며 다른 정보와 분리 보관하고 접근 권한을 제한한다.\""}, {"aspect": "legality", "issue": "홈페이지 운영/호스팅 위탁 시 법 제26조 및 시행령 제28조 제2항의 '위탁하는 업무의 내용과 수탁자 공개' 요건이 누락됨.", "fix": "위탁 관련 문단 끝에 다음 문장을 추가: \"위탁 시에는 위탁하는 업무의 내용과 수탁자를 인터넷 홈페이지에 지속적으로 공개한다.\""}, {"aspect": "minimal_change", "issue": "원문에 있던 구체적 운영 맥락(2022.10.26. 기준, 4,562명)이 제거되어 사례의 동일성이 약화됨.", "fix": "첫 문단 뒤에 다음 문장을 추가해 원문의 사실 맥락을 보존: \"2022.10.26. 기준으로 4,562명의 응시자에 대한 발표용 데이터셋을 구성하여 최소 기간 운영하였다.\""}]}}
{"case_id": "2023-213-256", "respondent": "온라인 식품 쇼핑몰 운영사", "case_content": "온라인 식품 쇼핑몰 운영사는 2003년부터 회원 가입·이용 과정에서 성명, 비밀번호, 성별, 연락처, 이메일, 연계정보(CI)와 선택 항목인 결혼 여부, 결혼기념일, 주소(자택/직장), 직장명, 부서명 등의 정보를 수집·보관해 왔다. 2022-10-19 캐시 서버 설정 변경으로 개인화 응답이 캐시에 저장되어, 웹 요청 시 한 이용자의 성명·주소·휴대전화번호가 다른 이용자에게 제공되고 마이페이지 접속 시 로그인 세션이 타 계정으로 설정되는 문제가 발생하였다. 2022-11-16 설정을 원복하고, 2022-11-17 문자·전화로 이용자에게 통지한 뒤 개인정보보호 포털에 신고하였다.\n이후 다음과 같이 개선하였다. 회원가입·주문·배송·고객상담을 위해 필요한 최소 항목(성명, 로그인 ID 또는 휴대전화, 비밀번호, 연락수단, 주문 시 배송지 및 수령인 정보, 결제 승인 식별자 등)만 수집·이용한다. 선택 정보(결혼 여부, 기념일, 직장명/부서, 추가 주소 등)는 맞춤형 혜택·마케팅 제공 목적에 한해 별도 선택으로 분리하여 동의를 받고, 동의하지 않아도 서비스 이용에 제한이 없다. 동의 시 수집·이용 목적, 수집 항목, 보유·이용 기간, 동의 거부 권리 및 거부에 따른 불이익(있는 경우)을 명확히 안내한다. 본인확인이 필요한 경우 대행기관을 통해 확인하고, 연계정보(CI)는 저장하지 않거나 확인 결과만 보관한다.\n기술·관리 보호조치로 개인정보 전송 시 TLS를 적용하고, 저장 시 주요 식별정보를 암호화하며 비밀번호는 일방향 암호화로 보관한다. 마케팅 목적 데이터와 서비스 운영 데이터는 논리적으로 분리하고, 최소 권한의 역할 기반 접근통제를 적용하며 관리자 계정에는 다중인증을 사용한다. 개인정보처리시스템, 네트워크 장비, 캐시/CDN, 관리 콘솔의 접속기록을 보관·점검하고 위·변조 방지 조치를 적용한다. 악성코드 대응 프로그램을 운영·갱신하며, 내부관리계획을 수립·시행·점검한다.\n캐시 서버는 정적 자원에 한해 활용하고, 인증이 필요한 경로(마이페이지, 장바구니, 주문/배송 조회 등)와 개인화 응답은 기본적으로 캐시를 우회한다. 해당 응답에는 no-store·private 등 캐시 제어 헤더를 설정하고, 캐시 키는 권한·세션 정보를 포함하지 않도록 설계하며 사용자 단위 격리 정책을 적용한다. 세션은 로그인 시 재발급하고 HttpOnly·Secure·SameSite 속성을 적용하며, 유휴·최대 만료시간을 설정한다. 캐시·세션 구성 변경은 사전 위험분석, 스테이징 검증, 승인 절차를 거쳐 배포하고, 배포 후 자동 점검으로 이상을 탐지하면 즉시 롤백한다.\n업무 위탁(클라우드, CDN/캐시, 콜센터, 물류 등)이 필요한 경우 처리 범위, 재위탁 제한, 암호화·접근통제, 접속기록 보관, 사고 통지, 반환·파기 절차를 포함한 계약을 체결하고, 정기 점검과 교육으로 안전조치 이행을 확인한다. 위탁자는 인터넷 홈페이지에 위탁업무의 내용과 수탁자 현황을 지속적으로 공개(게시)한다. 배송·결제 등 계약 이행에 필요한 처리는 원칙적으로 위탁으로 수행하고(수탁자와의 계약 체결·감독), 불가피하게 제3자 제공이 필요한 경우에는 제17조제2항에 따라 별도 동의를 받아 처리한다(제공받는 자, 이용 목적, 제공 항목, 보유·이용 기간, 동의 거부권 및 불이익을 고지). 국외 이전이 수반되는 경우 제28조의8 및 시행령 제29조의7·제29조의10에 따라 이전 항목, 국가, 시기·방법, 이전받는 자, 이용 목적·보유기간, 거부 방법·효과를 알리고 별도 동의를 받거나 공개·고지 요건을 충족하며, 이전받는 자와 안전조치·권리보장을 계약에 반영한다.\n보유기간은 계약 이행 및 관련 법정 보존기간을 기준으로 설정하고, 기간 경과 또는 목적 달성 시 복구 불가능한 방식으로 파기한다. 법정 보존 사유가 있는 경우에는 다른 개인정보와 분리하여 저장·관리하며, 파기 이력을 기록한다. 전자파일은 영구 삭제 또는 이에 준하는 방식으로 조치하고, 오프라인 자료는 파쇄 또는 소각한다.\n정보주체는 열람, 정정·삭제, 처리정지·동의철회를 요청할 수 있으며, 전담 창구와 절차를 통해 처리한다. 자동수집 장치의 설치·운영 및 거부 방법을 안내하고, 마케팅 수신 동의는 언제든지 철회할 수 있다. 제30조에 따른 개인정보 처리방침을 수립·변경하여 홈페이지에 지속적으로 게재·공개한다.\n보안사고 대응 계획을 운영하며, 노출이 의심되면 관련 시스템을 격리하고 캐시 제공을 중지한 후 영향 분석과 재발 방지 조치를 시행한다. 해당 사실과 안내를 정보주체에게 통지하고 기준에 해당하는 경우 관계 기관에 신고한다. 법 제34조 및 시행령 제39조·제40조에 따라 유출 등을 인지한 때부터 72시간 이내에 정보주체에게 통지하고 보호위원회 또는 한국인터넷진흥원에 신고한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 3, "minimal_change": 3}, "pass": false, "problems": [{"aspect": "objectivity", "issue": "case_content에 법 조문을 직접 인용하며(예: \"제17조제2항에 따라\", \"제28조의8 및 시행령...\", \"제30조에 따른\", \"법 제34조 및 시행령 제39조·제40조에 따라\") 준수 주장 성격의 문구가 포함되어 있어 사실 서술을 넘어 법적 적합성 주장을 암시함.", "fix": "법 조문 인용을 제거하고 절차/조치를 사실 서술로만 표현하세요. 예시 교체:\n- \"불가피하게 제3자 제공이 필요한 경우에는 제17조제2항에 따라 별도 동의를 받아 처리한다(제공받는 자, 이용 목적, 제공 항목, 보유·이용 기간, 동의 거부권 및 불이익을 고지).\" -> \"불가피하게 제3자 제공이 필요한 경우에는 별도 동의를 받아 처리하며, 제공받는 자, 이용 목적, 제공 항목, 보유·이용 기간, 동의 거부권 및 불이익(있는 경우)을 고지한다.\"\n- \"국외 이전이 수반되는 경우 제28조의8 및 시행령 제29조의7·제29조의10에 따라…\" -> \"국외 이전이 수반되는 경우 이전 항목, 국가, 시기·방법, 이전받는 자, 이용 목적·보유기간, 거부 방법·효과를 사전에 알리고 별도 동의를 받거나 공개·고지 요건을 충족하며, 이전받는 자와 안전조치·권리보장을 계약에 반영한다.\"\n- \"제30조에 따른 개인정보 처리방침을…\" -> \"개인정보 처리방침을 수립·변경하여 홈페이지에 지속적으로 게재·공개한다.\"\n- \"법 제34조 및 시행령 제39조·제40조에 따라 72시간 이내에…\" -> \"유출 등을 인지한 때부터 72시간 이내에 정보주체에게 통지하고, 기준에 해당하는 경우 관계 기관에 신고한다.\""}, {"aspect": "minimal_change", "issue": "원래 사건은 캐시 설정 오류로 인한 오답변/세션 전이와 그 복구·통지·신고에 관한 것인데, REWRITTEN에는 위탁, 제3자 제공, 국외 이전, 정보주체 권리 고지, 처리방침 등 사건 해결과 직접 관련 없는 광범위한 일반 준수 정책이 추가되어 시나리오 범위를 불필요하게 확장함.", "fix": "사건 해결 및 재발방지에 직접 필요한 통제만 남기고 불필요한 범위는 삭제하세요. 구체적으로 다음 문단을 삭제:\n- 삭제 대상 문단(그대로 제거): \"업무 위탁(클라우드, CDN/캐시, 콜센터, 물류 등)이 필요한 경우 … 국외 이전이 수반되는 경우 … 제29조의7·제29조의10 … 권리보장을 계약에 반영한다.\"(해당 단락 전체)\n- 삭제 대상 문단(그대로 제거): \"정보주체는 열람, 정정·삭제, 처리정지·동의철회를 요청할 수 있으며 … 개인정보 처리방침을 수립·변경하여 홈페이지에 지속적으로 게재·공개한다.\"(해당 단락 전체)\n이외 나머지(수집 최소화, 선택동의 분리, 기술·관리 보호조치, 캐시/세션 통제, 변경관리, 보유·파기, 사고 대응·통지)는 유지."}, {"aspect": "minimal_change", "issue": "ORIGINAL에는 유출 발생 후 \"캐시 서버에 저장된 개인정보가 더 이상 제공되지 않도록 관리\"했다는 사후 조치가 있었으나, REWRITTEN에는 캐시 설정 원복·통지·신고는 있으나 저장된 캐시 데이터의 즉시 삭제/차단 조치가 명시적으로 누락됨.", "fix": "사후 조치 사실을 명시적으로 추가하세요. 예: \"2022-11-16 설정을 원복하고, 2022-11-17 문자·전화로 이용자에게 통지한 뒤 개인정보보호 포털에 신고하였다.\" 다음 줄에 다음 문장을 추가: \"캐시 서버에 저장된 개인정보성 응답을 즉시 삭제하고 관련 캐시 제공을 중지하였다.\""}, {"aspect": "minimal_change", "issue": "violated_articles가 ORIGINAL에는 2개 조항으로 기재되어 있는데, REWRITTEN에서는 빈 배열로 변경되어 사건 기록의 핵심 메타정보가 불필요하게 수정됨.", "fix": "violated_articles를 ORIGINAL과 동일하게 복원하세요. 예: \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제48조의2\"]"}]}}
{"case_id": "2023-213-255", "respondent": "피심인(온라인 서비스 제공자)", "case_content": "온라인 서비스 제공자는 신원 확인이 필요한 경우에 한해 이용자가 업로드한 운전면허증 이미지에서 필요한 최소 항목(성명, 생년월일, 운전면허번호, 발급일자 등)만 추출하여 처리한다. 주소는 확인 목적상 필요한 경우에만 수집한다. 업로드 단계에서 주민등록번호가 포함되지 않도록 안내하고, 스캔/OCR 과정에서 주민등록번호 패턴 탐지 시 접수를 차단한다. 운전면허번호 등 고유식별정보는 별도 동의를 통해 수집하며, 동의 화면에 목적, 항목, 보유기간, 동의 거부권 및 거부 시 영향 등을 구체적으로 고지한다.\n추출 데이터와 면허증 이미지는 분리 보관하며, 전송 구간은 암호화 채널을 사용한다. 저장 시 운전면허번호 및 인증정보는 암호화하고, 암호키는 별도 시스템에서 관리한다. 접근 권한은 업무상 필요 최소 범위로 부여하고, 개인별 계정과 다단계 인증을 적용한다. 개인정보처리시스템의 접속기록을 보관하여 점검하고, 위·변조 방지 조치를 적용한다. 악성코드 방지, 취약점 점검 및 보안 패치 등 기술적 조치를 정기적으로 수행한다.\n자동 통지·안내 메일 시스템에는 신분증 파일을 첨부하지 않으며, 자료 열람이 필요한 경우에는 로그인 기반 또는 기한 제한·1회용 토큰이 포함된 인증된 링크를 사용한다. 데이터베이스 식별자 및 시퀀스는 중복 방지 규칙과 사전 검증 절차로 관리하고, 개발·검증·운영 환경을 분리한다. 배포 전에는 샘플 비식별 데이터로 테스트하며, 변경 승인 절차와 자동화된 매핑 검증을 거친다.\n보유기간은 본인 확인 완료 후 즉시 최소화하며, 면허증 이미지는 확인 완료 후 7일 이내 자동 파기한다. 분쟁 대응이나 법령상 보존이 필요한 경우에는 해당 자료를 본래 자료와 분리하여 보관하고, 사유 해소 시 지체 없이 파기한다. 전자파일은 복구 불가능한 방식으로 삭제하고, 파기 이력을 기록한다.\n제3자 제공은 당초 목적 범위에서 필요한 경우에 한해 수행하며, 필요한 고지·동의를 거친다. 처리 위탁이 필요한 경우 위탁계약서에 처리 범위, 재위탁 제한, 접근통제·암호화 등 안전조치, 점검·감독, 사고 통지, 반환·파기 절차를 포함하고, 수탁자에 대한 권한관리 및 접속기록 점검을 수행한다.\n사고 대응 체계는 구축되어 있으며, 유출 등 사실을 알게 된 때에는 접속 경로 차단, 회수·삭제 등 긴급조치를 하고, 정보주체에게 지체 없이(원칙적으로 72시간 이내) 항목, 시점·경위, 피해 최소화 방법, 대응조치, 담당부서 연락처를 통지한다. 신고 요건에 해당하는 경우 보호기관 또는 전문기관에 72시간 이내 신고한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "원문은 수집 항목으로 성명, 생년월일, 운전면허번호, 주소를 명시했으나, REWRITTEN은 ‘발급일자 등’을 추가하고 주소 수집을 조건부로 변경하여 불필요하게 시나리오가 변형됨.", "fix": "문장을 다음과 같이 교체하여 원문 시나리오의 수집 항목을 유지하되 최소처리 원칙을 함께 반영하십시오: \n- 교체 전: \"…필요한 최소 항목(성명, 생년월일, 운전면허번호, 발급일자 등)만 추출하여 처리한다. 주소는 확인 목적상 필요한 경우에만 수집한다.\"\n- 교체 후: \"…신원 확인이 필요한 경우에 한해 이용자가 업로드한 운전면허증 이미지에서 필요한 최소 항목(성명, 생년월일, 운전면허번호, 주소)만 추출하여 처리한다.\""}]}}
{"case_id": "2025-001-004", "respondent": "Alipay Singapore E-Commerce Private Limited", "case_content": "Alipay Singapore E-Commerce Private Limited는 애플의 결제 중계사로서 카카오페이로부터 NSF 모델 구축 및 점수 산출을 위해 내부고객번호(SHA-256, 솔트 미적용), 휴대전화번호(AES-128 암호화 후 계정값과 결합해 해시), 이메일 결합 해시, KYC 수행 여부, 계좌 존재·수, 잔고, 최근 1·7일 결제·송금 여부·횟수·금액 등 24개 항목을 수령·처리한다. 2018년 4·6·7월에는 FTP로 세 차례 수령했고, 2019년 6월 27일부터 2024년 5월 21일까지는 D+1 일일 배치로 수령하였다. 전송 시에는 파일 암호화 및 무결성 검증을 적용하고, 이후 구간에는 mTLS 기반 SFTP로 전송한다.\n수령 데이터는 자체 데이터베이스(NSF용)에 저장하고 저장 시 AES-256으로 암호화하며, 키는 HSM에서 분리 관리한다. NSF용 DB와 가맹점 결제용 DB는 물리·논리적으로 분리하되 동일한 해시된 account_id 키를 사용하여 필요 시 목적 범위 내에서 매칭이 가능하도록 운영한다. 접근 권한은 점수 산출·운영 담당자로 최소화하고 MFA를 적용하며, 모든 접속·조회·반출·삭제 내역은 위변조 방지 기능으로 보관·점검한다.\n고객별 NSF 점수를 사전 계산하여 보관하고, 애플의 API 요청 시 점수만 제공하며 원자료는 제공하지 않는다. NSF 점수가 자동화된 결정에 활용되어 정보주체의 권리 또는 의무에 중대한 영향을 미칠 수 있는 경우, 정보주체의 거부·설명 요구 및 인적 개입에 의한 재검토 요청을 접수·처리할 수 있는 창구를 운영하고 그 기준·절차를 공개한다.\n일일 전송분 데이터는 30일간 유지하며, 기간 만료 또는 서비스 종료 시 전자파일은 복구 불가능한 방식으로 삭제한다. 2024년 5월 22일 API 연동 중단 이후에도 8월 7일까지 기산출 점수를 제공한 뒤 8월 21일 삭제하였다. 법령상 보존이 필요한 자료는 다른 파일과 분리해 접근을 제한하며, 종료 시 제공사와 상호 삭제 확인을 완료한다.\n국외 이전 또는 제3자 제공이 수반되는 경우에는 이전 국가, 수신자, 항목, 목적, 보유기간, 거부 방법 등을 사전에 알리고 별도 동의를 받아 처리하며, 계약에 보안 통제, 재위탁 제한, 사고 통지, 반환·파기 절차를 포함하고 이행을 점검한다. 정보주체 이외로부터 개인정보를 수집하는 경우, 정보주체 요구 시 즉시 수집 출처·처리 목적·처리정지권 등을 알리고, 시행령 기준에 해당하는 경우에는 제3자 제공에 기초한 수집 사실과 주요 사항을 지체 없이 통지한다. 법령상 주기적 이용·제공 내역 통지 대상에 해당하는 경우에는 정보주체에게 정한 주기에 따라 통지한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "식별키 처리 안전성 미흡. case_content에 내부고객번호가 'SHA-256, 솔트 미적용'으로 기술되어 있고, 두 DB를 동일 해시 account_id로 매칭 가능하도록 운영한다고 기재되어 있어 재식별·오남용 위험이 존재. 법 제29조 및 시행령 제30조의 안전조치 취지에 비추어 키 관리 강화가 필요.", "fix": "다음과 같이 문구를 교체하세요.\n- '내부고객번호(SHA-256, 솔트 미적용)' → '내부고객번호(HMAC-SHA-256, HSM 보관 키 사용)'\n- '동일한 해시된 account_id 키를 사용하여 … 매칭이 가능한 구조' → 'HMAC 기반 토큰화된 account_id(키는 HSM에서 분리 보관)를 사용하여, 승인된 절차에 따라 목적 범위 내에서만 일시적 매칭이 가능하도록 운영' "}, {"aspect": "legality", "issue": "수집·이용 및 제3자 제공·국외이전에 관한 법적 근거와 동의 방법이 구체적으로 명시되지 않아 법 제15조, 제17조, 제28조의8 및 시행령 제17조 요건 충족 여부가 불명확.", "fix": "제3단락(국외 이전·제3자 제공 관련 단락) 말미에 다음 문장을 추가하세요.\n'개인정보의 수집·이용 및 제3자 제공·국외 이전은 법 제15조, 제17조, 제28조의8을 근거로 하며, 동의 기반 처리 시에는 법 제15조제2항 및 시행령 제17조에 따라 목적, 항목, 보유·이용 기간, 제공받는 자, 거부 권리 및 불이익 등을 구분 고지하고 전자적 방법으로 명시적 동의를 받는다.'"}, {"aspect": "legality", "issue": "원자료 30일 보관은 명시되어 있으나, 파생정보(NSF 점수) 및 NSF용 DB의 구체적 보유 기간과 파기 기준이 특정되지 않아 법 제21조 및 시행령 제16조의 '불필요 시 지체 없는 파기' 요건 충족이 모호함.", "fix": "데이터 보관·삭제 단락에 다음 문장을 추가하세요.\n'NSF 점수 및 산출 특성 데이터는 산출일로부터 최대 90일 보관 후 지체 없이 복구 불가능한 방식으로 파기하며(법령상 보존 예외 제외), API 미사용 상태가 30일 지속되면 해당 고객의 점수와 관련 원자료를 즉시 파기한다.'"}, {"aspect": "minimal_change", "issue": "일부 서술이 현재형·일반 정책 서술로 되어 있어(예: '전송한다', '운영한다') 2019~2024년 실제 운영 사실과의 시점을 혼동시킬 수 있음.", "fix": "해당 문장을 과거 시점으로 명확히 하세요.\n- '이후 구간에는 mTLS 기반 SFTP로 전송한다.' → '이후 구간(2019년 6월 27일~2024년 5월 21일)에는 mTLS 기반 SFTP로 전송하였다.'\n- '… 운영한다.'(권한·로그 등) → '… 운영하였다.'(2019~2024년 운영 사실을 서술하는 경우에 한해)"}]}}
{"case_id": "2025-001-002", "respondent": "㈜카카오페이", "case_content": "㈜카카오페이는 애플 서비스의 결제수단 연동 및 청구 처리를 지원하기 위해, 알리페이를 점수 산출 수탁사로 지정하여 거래위험(NSF) 점수를 제공한다. 이 목적을 위해 필요한 최소 항목만 처리하며, 내부고객번호는 파트너별 키가 적용된 HMAC-SHA-256 기반 일회성·기간제 토큰으로 대체하고(교차 서비스 간 재사용 금지), 전화번호·이메일 등 직접 식별자는 전송하지 않는다. 전송 항목은 다음과 같은 비식별 통계치로 한정한다: KYC 수행 여부(예/아니오), 최근 90일 내 결제/충전/출금 횟수의 구간값, 최근 결제금액의 구간값, 가맹점 수의 구간값, 미수/부도 발생 여부, 점수 산출 기준일. \n국외 이전 및 제3자 제공에 대해서는 앱 화면에서 별도 동의를 받으며, 이전 국가, 수탁자 명칭·연락수단, 전송 항목, 이용 목적, 보유·이용 기간, 전송 시기·방법, 거부 시 대체 절차를 구체적으로 안내한다. 동의를 거부하는 경우 국내 시스템에서 점수를 산출하거나 한도 축소·보증수단 등 대체 절차로 결제 연동을 진행한다. \n전송은 건별 API로만 수행하며, TLS 기반 암호화 통신과 필드 단위 암호화를 적용한다. 알리페이는 수신 데이터의 저장을 금지하고, 점수 캐시는 최대 24시간 이내 자동 삭제한다. 카카오페이는 점수 및 전송 이력을 청구 정산·분쟁대응에 필요한 최소 기간 동안만 보관하고, 기간 도래 시 복구 불가능한 방식으로 파기하며, 법정 보존 사유가 있는 경우에는 분리보관한다. \n수탁계약에는 처리 범위, 재위탁 제한, 물리·기술·관리적 보호조치, 국외에서의 동일 수준 통제, 사고 통지, 접근권한 통제, 반환·파기, 현장/원격 점검 및 로그 제출 의무를 포함하고, 정기 점검과 모의훈련을 실시한다. \n접근 권한은 최소권한 원칙으로 부여하고 MFA를 적용한다. 개인정보처리시스템 접속기록과 국외 전송 로그는 위·변조 방지 조치와 함께 보관·점검한다. 저장 데이터는 암호화하고 키는 분리 관리한다. 악성코드 방지, 취약점 점검, 네트워크 분리 등 안전조치를 운영한다. \n이용자는 앱에서 국외 이전·제3자 제공 내역을 확인하고 동의를 철회할 수 있으며, 자동화된 점수에 기반한 중요 결정에 대해 설명 요구 및 인적 재검토를 요청할 수 있다. 추가 이용·제공은 수집 목적과의 관련성, 정보주체 영향, 안전조치 수준 등을 내부 기준에 따라 사전 검토하여 결정한다. 개인정보 처리방침에 국외 이전 관련 세부 사항과 안전조치를 공개한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "국외 이전(처리위탁)과 제3자 제공의 대상과 법적 근거가 모호합니다. 수탁자(알리페이) 위탁 고지/계약(법 제26조, 시행령 제28조)와 국외 이전 동의 고지 항목(법 제28조의8제2항), 제3자 제공 동의 고지 항목(법 제17조제2항)을 각각 분리 명시할 필요가 있습니다.", "fix": "다음 문장을 교체:\n\"국외 이전 및 제3자 제공에 대해서는 앱 화면에서 별도 동의를 받으며, 이전 국가, 수탁자 명칭·연락수단, 전송 항목, 이용 목적, 보유·이용 기간, 전송 시기·방법, 거부 시 대체 절차를 구체적으로 안내한다.\" ->\n\"국외 이전(처리위탁)과 제3자 제공에 대하여 각각 별도 동의를 받는다. [국외 이전(처리위탁): 이전 국가, 수탁자(알리페이) 명칭·연락처, 이전 항목, 이용 목적, 보유·이용 기간, 이전 시기·방법, 거부 방법·효과를 고지] 및 [제3자 제공: 제공받는 자(애플) 명칭·연락처, 제공 목적, 제공 항목, 보유·이용 기간, 동의 거부권 및 불이익을 고지]를 앱 화면에 명확히 안내한다.\""}, {"aspect": "legality", "issue": "국외 이전 시 보호조치의 계약 반영 의무(시행령 제29조의10제2항)와 위탁 공개 의무(법 제26조제2항, 시행령 제28조제2항)가 case_content에 명시적으로 드러나지 않습니다.", "fix": "수탁계약 문단에 다음 문장을 추가:\n\"국외 이전에 관한 보호조치(안전조치, 권리보장, 분쟁해결 등)를 이전받는 자와 사전 협의하여 계약에 반영한다(시행령 제29조의10). 위탁하는 업무의 내용과 수탁자(알리페이)를 홈페이지에 상시 공개한다(법 제26조제2항, 시행령 제28조제2항).\""}, {"aspect": "legality", "issue": "이용·제공 내역의 주기적 통지 의무(법 제20조의2, 시행령에서 정하는 기준 해당 시)가 ‘확인 가능’ 수준으로만 서술되어 있어 통지 요건 충족이 불명확합니다.", "fix": "권리 안내 문단에 다음 문장을 추가:\n\"법 제20조의2 및 관련 시행령 기준에 해당하는 경우, 개인정보의 이용·제공 내역 또는 이를 확인할 수 있는 방법을 분기 1회 이상 앱 알림 또는 전자우편으로 통지한다.\""}, {"aspect": "legality", "issue": "자동화된 결정 관련하여 거부·설명·인적 재검토 권리는 서술되어 있으나, 결정의 기준·절차 공개(법 제37조의2제4항)가 명시되어 있지 않습니다.", "fix": "권리 및 공개 문단에 다음 문장을 추가:\n\"자동화된 점수 산정에 관한 기준·절차 및 개인정보 처리 방식의 개요를 홈페이지와 개인정보 처리방침에 공개한다(법 제37조의2제4항).\""}]}}
{"case_id": "2025-001-003", "respondent": "Apple Distribution International Limited", "case_content": "Apple Distribution International Limited는 애플 서비스에서 카카오페이 결제수단 등록 및 결제(일괄청구 포함) 적합성 판단을 위해 NSF 점수를 조회·참조한다. 조회를 위해 애플은 내부 생성한 계정 토큰(솔트 적용 일방향 해시)과 거래 판단에 필수적인 최소 메타데이터만 수탁자인 알리페이에 API로 전송하고, 알리페이는 카카오페이에서 산출한 점수와 사유코드만 반환한다. 대량·일괄 데이터 수집이나 장기 보관은 하지 않으며, 점수 산출에 필요하지 않은 연락처, 식별번호 등은 처리하지 않는다.\n알리페이와는 처리 범위, 재위탁 제한, 암호화·접근통제 등 안전조치, 사고 통지, 점수·로그의 보유기간과 반환·파기 절차, 점검·감사권을 포함하는 위탁계약을 체결한다. 알리페이는 전송 중 TLS, 저장 시 강력한 암호화(AES-256 등)와 키관리(HSM 등)를 적용하고, 점수 캐시와 처리 로그는 업무상 필요한 범위에서만 보유(예: 최대 30일) 후 복구 불가능한 방식으로 삭제하며 삭제 이력을 기록한다. 애플은 수탁자에 대해 정기 점검(보안 적합성 확인, 접속기록 표본 점검, 취약점 개선 확인)과 재위탁 사전 승인 절차로 감독한다.\n국외에서의 처리에 관하여, 결제수단 등록 과정에서 별도의 동의 화면을 통해 이전 항목(계정 토큰, 필수 거래 메타데이터), 이전 국가·시기·방법(API 조회 시 암호화 전송), 수탁자 명칭 및 연락처, 이용 목적(NSF 점수 산출·전송)과 보유기간, 거부 방법 및 거부 시 영향(해당 결제수단 이용 제한 및 대체 결제수단 제공)을 알리고 전자적 방식으로 동의를 받는다. 동일한 내용을 개인정보처리방침에도 상시 공개하며, 이전 정보가 변경되면 사전 재안내 및 재동의를 받는다.\n애플 내부에서 수신 점수는 결제 위험 판단 저장소에 분리 보관하고, 접근 권한을 결제 리스크 담당자에 한정한다(RBAC, MFA, 최소권한, 정기 권한 재검토). 처리 시스템과 네트워크는 분리 운영하며, 접속기록(접속일시, 처리내역 등)은 위변조 방지 조치와 함께 일정 기간 이상 보관·점검한다. 점수 및 판단 로그는 목적 달성 또는 보존기간 도래 시 지체 없이 파기하고, 법령상 별도 보존이 필요한 거래기록이 있는 경우에는 본 데이터와 분리하여 저장·관리한다.\n자동화된 결정이 적용되는 경우 이를 화면과 처리방침에 고지하고, 정보주체가 설명을 요구하거나 인적 검토를 요청할 수 있는 절차를 제공한다. 동의 철회 또는 처리 정지 요구 시 국외 이전 및 위탁 처리를 중단하고, 철회 이력과 조치 결과를 기록한다. 개발·테스트 환경에는 가명·비식별 또는 더미 데이터를 사용한다.\n정보주체는 열람·전송·정정·삭제·처리정지·동의철회를 위한 전용 채널(앱/웹·전자우편 등)을 통해 권리를 행사할 수 있으며, 애플은 본인확인 후 법정 기한 내 처리하고 결과를 통지한다. 유출 등 사고 인지 시에는 영향 최소화를 위한 즉시 조치, 관계 기관 신고 및 정보주체 통지 절차를 가동한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 3}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "원문의 핵심 처리 구조(카카오페이 → 알리페이 D+1 일일 배치 수령 후 점수 산출, 대규모 데이터 처리)가 REWRITTEN에서 ‘대량·일괄 수집 없음, API 조회 중심’으로 변경되어 시나리오가 불필요하게 축소·변형됨.", "fix": "다음과 같이 1문단을 수정하여 원문 시나리오(배치 기반 점수 산출)를 유지하되 통제만 보강하세요.\n- 변경 전: \"조회를 위해 애플은 내부 생성한 계정 토큰(솔트 적용 일방향 해시)과 거래 판단에 필수적인 최소 메타데이터만 수탁자인 알리페이에 API로 전송하고, 알리페이는 카카오페이에서 산출한 점수와 사유코드만 반환한다. 대량·일괄 데이터 수집이나 장기 보관은 하지 않으며, 점수 산출에 필요하지 않은 연락처, 식별번호 등은 처리하지 않는다.\"\n- 변경 후: \"알리페이는 2018년 모델 구축 단계에서 2018.2~3월분 데이터 세트를 3회 수령하고, 2019.6.27.~2024.5.21. 동안은 D+1 주기의 일일 배치로 필요한 항목만 수령하여 고객별 점수를 산출·현행화한다(배치 원본·점수 캐시·처리 로그는 최대 30일 보관 후 복구 불가능한 방식으로 삭제). 애플은 조회를 위해 내부 생성한 계정 토큰(솔트 적용 일방향 해시)과 거래 판단에 필요한 최소 메타데이터만 수탁자인 알리페이에 API로 전송하고, 알리페이는 산출된 점수와 사유코드만 반환한다.\""}, {"aspect": "minimal_change", "issue": "원문에 존재하던 시계열 사실(애플의 점수 활용 기간, 알리페이의 점수 삭제 시점)이 삭제되어 불필요한 사실 변경이 발생.", "fix": "2문단 말미 또는 별도 문단에 원문 시계열을 복원하세요.\n- 추가: \"애플은 2019.7.11.~2024.8.7. 기간 동안 상기 점수를 결제수단 등록 및 결제 시 참조하였고, 알리페이는 2024.8.21.에 기산출 점수를 삭제하였다.\""}, {"aspect": "minimal_change", "issue": "원문 기술적 처리(계정·연락처·이메일의 해시/암호화 방식) 서술이 REWRITTEN에서 ‘연락처 등은 처리하지 않음’으로 바뀌어 실제 처리 범위가 변경된 것으로 보임.", "fix": "원문 범위를 유지하되 안전조치만 보강하여 기술 처리를 정합적으로 서술하세요.\n- 변경 전: \"대량·일괄 데이터 수집이나 장기 보관은 하지 않으며, 점수 산출에 필요하지 않은 연락처, 식별번호 등은 처리하지 않는다.\"\n- 변경 후: \"account_id는 SHA-256(솔트 적용) 해시, 휴대전화번호는 AES-128 이상 수준으로 암호화 후 해시, 이메일은 계정 토큰과 결합한 해시 형태로 처리하며, 점수 산출 목적상 필요한 경우에 한하여 최대 30일 보관 후 복구 불가능한 방식으로 삭제한다.\""}]}}
{"case_id": "2023-008-072", "respondent": "피심인(공공기관)", "case_content": "공공업무 수행을 위해 직원·회원 관리, 서비스 제공 이력 관리 등 목적에 필요한 범위에서 최소한의 개인정보(성명, 생년월일, 성별, ID, 비밀번호 해시값, 이메일, 휴대전화, 주소, 사원번호 등)만 수집한다. 주민등록번호 및 여권번호 등 고유식별정보는 법령상 근거 또는 별도 동의가 있는 경우에 한하여 수집하며, 수집 단계에서 마스킹 안내와 패턴 검사를 통한 업로드 차단을 적용한다.\n\n저장은 업무용 PC의 개인 영역과 공용 공유폴더 대신 문서관리시스템(DMS)과 데이터베이스로 일원화한다. 접근 권한은 직무 기반 최소권한으로 부여하고, 권한의 부여·변경·말소 이력은 시스템에서 자동 기록·보관하며 정기 점검한다. 내부관리계획을 수립·시행·점검하고, 개인정보취급자 범위를 최소화하며 정기 교육과 감독을 수행한다. 비밀번호는 복구 불가능한 단방향 해시(솔트 포함)로 저장하고, 고유식별정보와 인증정보는 저장 시 강력한 암호화를 적용한다. 전송 구간은 모두 암호화 통신을 사용한다. 서버실과 자료보관구역에는 출입통제와 잠금장치 등 물리적 보호조치를 운영한다.\n\n백업은 전용 백업시스템에서만 수행하며, 데이터베이스 덤프 및 파일 백업은 강력한 암호화로 보호하고 키는 분리된 KMS에서 국내에 보관·관리한다. 이메일 서버 등 비업무 저장영역(예: 메일 서버의 특정 폴더)에는 백업본을 저장하지 않으며, 백업망은 업무망과 분리한다. 백업 보존기간과 매체별 보존 위치를 지정하고, 기간 만료 또는 목적 달성 시에는 복구 불가능한 방식으로 자동 파기하며 파기 이력을 남긴다.\n\n네트워크는 내부망, 서버망, DMZ를 분리하고, DMZ에는 개인정보를 저장하지 않는다. 외부 원격접속은 VPN과 다중인증이 적용된 점프서버를 통해서만 허용하며, 인터넷에 직접 노출되는 원격 데스크톱과 내부 공유는 비활성화한다. 침입차단·침입탐지, WAF, EDR, 악성코드 방지 및 취약점 점검·패치 관리 절차를 상시 운영한다. 리버스 프록시는 공개 웹서비스 트래픽만 중계하며 TLS를 적용하고, 개인정보가 포함된 파일 전송은 내부 전용 전송 채널에서만 허용한다.\n\n국외 이전은 원칙적으로 정보주체의 별도 동의를 받아 시행한다(법 제28조의8제1항제1호). 다만, 정보주체와의 계약의 체결 및 이행을 위하여 불가피한 경우에는 법 제28조의8제1항제3호에 따라 이전 항목, 국가, 시기·방법, 이전받는 자, 이용 목적, 보유·이용 기간, 거부 방법을 개인정보 처리방침에 공개하거나 서면등의 방법으로 사전 통지한다(법 제28조의8제1항제3호가목·나목, 제2항). 해당 사항이 변경되면 재공지하고 필요한 경우 재동의를 받은 후 시행한다(법 제28조의8제3항). 이전과 관련된 암호화, 접근통제, 권리보장 등 보호조치는 계약에 반영하여 시행하고, 암호화 키는 국내에서 관리한다(법 제28조의8제4항, 영 제29조의10).\n\n업무 위탁은 필요한 범위로 한정하고, 위탁 범위, 재위탁 제한, 접근통제, 암호화, 접속기록 보관, 사고 통지, 점검·감독, 종료 시 반환·파기 등 사항을 포함한 계약을 체결한다. 수탁자 계정은 개인별로 발급하고, 처리 현황을 주기적으로 점검한다.\n\n개인정보 처리방침에는 처리 목적, 항목, 보유기간, 국외 이전의 근거와 이전 관련 사항, 위탁 현황, 안전조치, 권리행사 절차 등을 공개한다. 공공기관은 법 제32조에 따라 개인정보파일을 등록하고, 대통령령 기준에 해당하는 경우(영향평가 대상)에는 영향평가를 실시하여 개선사항을 반영한다.\n\n접속기록은 접속일시, 계정, 처리내역 등을 포함하여 위변조 방지 조치와 함께 최소 1년 이상 보관·점검하고 안전하게 보관한다. 보유기간 만료 또는 목적 달성 시에는 본 시스템과 백업본을 포함하여 지체 없이 복구 불가능한 방식으로 파기하고, 다른 법령에 따른 보존 사유가 있는 경우에는 분리보관한다. 사고 대응 절차를 마련·운영하고, 유출등 사실을 알게 된 때에는 72시간 이내 정보주체에게 통지하며, 법령 기준에 해당하는 경우 보호위원회 또는 한국인터넷진흥원에 72시간 이내 신고한다(영 제39조, 제40조).", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 4, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "objectivity", "issue": "case_content includes multiple parenthetical citations to specific statutes and decrees (e.g., “(법 제28조의8제1항제1호)”, “(영 제39조, 제40조)”). These read as legality assertions rather than neutral handling steps.", "fix": "Remove the parenthetical legal citations while keeping the factual handling. For example: replace “국외 이전은 원칙적으로 정보주체의 별도 동의를 받아 시행한다(법 제28조의8제1항제1호).” with “국외 이전은 원칙적으로 정보주체의 별도 동의를 받아 시행한다.” Similarly delete “(법 제28조의8제1항제3호가목·나목, 제2항)”, “(법 제28조의8제3항)”, “(법 제28조의8제4항, 영 제29조의10)”, and “(영 제39조, 제40조)” throughout."}, {"aspect": "minimal_change", "issue": "Key scenario specifics from the original were omitted or generalized: (a) the actual overseas destination (Germany), (b) prior reverse-proxy-based transfers to domestic and German servers, (c) concrete notification channels (문자·우편·홈페이지 공지), and (d) the approximate data scale.", "fix": "Re-introduce original scenario anchors while keeping the improved controls. Suggested text-level additions/edits: (1) In the 국외 이전 paragraph, add: “이전 대상 국가는 독일이며, 위 요건을 충족하는 범위에서 이전한다.” (2) In the 네트워크/전송 단락, append: “기존 리버스 프록시 구성은 공개 웹서비스 트래픽만 중계하도록 재설계하고, 독일 및 국내 서버로의 파일 전송은 내부 전용 전송 채널에서만 허용한다.” (3) In the 사고 통지 문장, revise to: “유출 등 사실을 알게 된 때에는 72시간 이내 정보주체에게 문자(SMS), 우편 및 홈페이지 공지 등의 수단으로 통지하며, 법령 기준에 해당하는 경우 보호위원회 또는 한국인터넷진흥원에 72시간 이내 신고한다.” (4) In the 첫 단락 말미에 데이터 규모를 보강: “보유 규모는 약 652,930명의 정보와 1,953건의 직원·회원정보 수준이다.” (5) In the 백업 단락에 과거 경로 전환을 명시: “기존 MS Exchange 서버 ecp 폴더에 저장하던 백업본은 전용 백업시스템으로 이전하고 해당 경로 사용을 중단한다.”"}]}}
{"case_id": "2023-006-056", "respondent": "피심인(정보통신서비스 제공자)", "case_content": "피심인(정보통신서비스 제공자)은 홈페이지 내 1:1 상담문의 게시판을 운영하며 이름, 이메일, ID, IP, 질문내용, 전화번호 등 이용자 46,134명의 정보를 게시판 데이터베이스에 저장하고, 관리자 페이지에서 상담사 계정으로 마스킹 상태 조회와 마스킹 해제를 통해 열람하도록 관리하였다. 상담사 계정은 ID와 비밀번호, 이메일 또는 SMS를 통한 인증으로 로그인하며, 접속 후 세션 ID를 기반으로 인증이 유지되었고 보안솔루션 로그와 웹로그 등 접속기록이 서버에 보관되었다. 피심인은 2021.7.5.부터 침입차단·탐지와 IP 기반 접근제어를 적용하여 운영하고, 관리자·상담사 계정에 최소권한을 부여하며 세션 타임아웃·동시세션 차단·IP/브라우저 기반 세션 검증을 상시 적용하였다. 비밀번호 등 인증정보는 일방향으로 암호화해 저장하고, 개인정보 전송 구간은 암호화하였다. 2022.6.2.경 관리자 페이지 로그인 세션이 제3자에 의해 사용되어 대량 조회가 발생하자, 피심인은 2022.6.5.까지 확인된 사실을 정보주체에게 우선 통지하고 보호위원회 및 한국인터넷진흥원에 우선 신고한 뒤, 추가 확인되는 내용을 즉시 추가 통지·신고하였다. 이후 6.9. 인증 오류 영향 계정에 대해 로그아웃 조치하고 6.10.과 6.15.에 신고, 6.15.와 6.17.에 이메일·문자·SNS로 통지하며 6.15.~7.22. 메인 홈페이지에 공지하였다. 사건 이후에는 제목 영역의 악성코드 삽입 차단, IP 통제 등 보안 정책과 세션 관리 설정을 재점검하고 검증 절차를 강화하였다. 해당 개인정보는 처리 목적 달성 또는 보유기간 경과 시 지체 없이 파기하고(전자파일은 복구 불가능하도록 영구 삭제), 법령상 보존이 필요한 항목은 다른 개인정보와 분리하여 저장·관리하였으며, 2023.6.14. 기준 보존 의무가 있는 항목만 분리 보관 중이었다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 1}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "사전 보안운영 사실을 원본과 다르게 강화된 상태로 변경했습니다(제한적 운영 -> 상시 적용, 최소권한, 세션 타임아웃 등 추가).", "fix": "다음 문장을 원본 서술로 되돌리세요.\n- 교체 전: 피심인은 2021.7.5.부터 침입차단·탐지와 IP 기반 접근제어를 적용하여 운영하고, 관리자·상담사 계정에 최소권한을 부여하며 세션 타임아웃·동시세션 차단·IP/브라우저 기반 세션 검증을 상시 적용하였다.\n- 교체 후: 피심인은 2021.7.5.부터 일부 보안정책을 적용하지 않는 설정으로 침입차단·탐지와 IP 기반 접근제어를 제한적으로 운영하였고, 사건 이후에는 제목 영역의 악성코드 삽입 차단, IP 통제, 세션 검증 시 로그인한 IP 정보와 웹 브라우저 정보 확인을 추가하여 관리 방식을 강화하였다."}, {"aspect": "minimal_change", "issue": "원본에 없던 기술통제(인증정보 일방향 암호화 저장, 전송구간 암호화) 내용을 추가했습니다.", "fix": "아래 문장을 삭제하세요.\n- 삭제 대상: 비밀번호 등 인증정보는 일방향으로 암호화해 저장하고, 개인정보 전송 구간은 암호화하였다."}, {"aspect": "minimal_change", "issue": "사고 통지·신고 타임라인을 변경하여 6.5. ‘우선 통지·신고’ 등 원본에 없는 조치를 추가했습니다.", "fix": "아래 문단을 원본 서술로 교체하세요.\n- 교체 전: 2022.6.2.경 관리자 페이지 로그인 세션이 제3자에 의해 사용되어 대량 조회가 발생하자, 피심인은 2022.6.5.까지 확인된 사실을 정보주체에게 우선 통지하고 보호위원회 및 한국인터넷진흥원에 우선 신고한 뒤, 추가 확인되는 내용을 즉시 추가 통지·신고하였다. 이후 6.9. 인증 오류 영향 계정에 대해 로그아웃 조치하고 6.10.과 6.15.에 신고, 6.15.와 6.17.에 이메일·문자·SNS로 통지하며 6.15.~7.22. 메인 홈페이지에 공지하였다.\n- 교체 후: 2022.6.2.경 관리자 페이지 로그인 세션이 제3자에 의해 사용되어 대량 조회가 발생하자, 피심인은 6.9. 인증 오류 영향 계정에 대해 로그아웃 조치하고 6.10.과 6.15.에 신고, 6.15.와 6.17.에 이메일·문자·SNS로 통지하며 6.15.~7.22. 메인 홈페이지에 공지하였다."}, {"aspect": "minimal_change", "issue": "보유·파기 현황을 ‘목적 달성 시 지체 없이 파기 및 분리보관’으로 변경하여 원본의 ‘계속 보관’ 사실을 삭제했습니다.", "fix": "보유·파기 관련 서술을 원본으로 되돌리세요.\n- 교체 전: 해당 개인정보는 처리 목적 달성 또는 보유기간 경과 시 지체 없이 파기하고(전자파일은 복구 불가능하도록 영구 삭제), 법령상 보존이 필요한 항목은 다른 개인정보와 분리하여 저장·관리하였으며, 2023.6.14. 기준 보존 의무가 있는 항목만 분리 보관 중이었다.\n- 교체 후: 해당 개인정보는 2023.6.14. 기준 계속 보관되었다."}, {"aspect": "minimal_change", "issue": "위반조항 배열을 공란으로 변경했습니다.", "fix": "violated_articles를 원본과 동일하게 복원하세요.\n- 교체 전: \"violated_articles\": []\n- 교체 후: \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제48조의2\", \"개인정보 보호법 제39조의4\", \"개인정보 보호법 시행령 제48조의4\"]"}]}}
{"case_id": "2023-006-057", "respondent": "피심인(케이블TV·초고속인터넷·인터넷전화 서비스 제공 사업자)", "case_content": "피심인은 자사 홈페이지를 통해 이름, 아이디, 생년월일, 성별, 휴대전화번호, 이메일주소 등 회원정보를 수집·보관하고, 회원정보 수정 페이지에서 조회되도록 운영한다. 주민등록번호는 회원 가입 단계에서 요구하지 않는다. 수집 목적, 보유기간, 동의 거부권을 알리고, 마케팅 정보 수신 동의는 별도로 분리하여 받는다.\nJEUS 7 Fix4 기반의 웹 애플리케이션을 사용하여 세션 식별자에 따라 열람 권한을 부여하고, 접속·인증 내역은 로그인 기록으로 저장·분석한다. 과거 JEUS Session 관련 공개 취약점 패치가 적용되지 않은 상태에서 세션 오류가 발생하여, 동시간대 접속한 이용자 A의 화면에 이용자 B의 회원정보가 웹페이지 응답을 통해 표시·전송된 사례가 있었고, 관련 정보는 서버의 회원관리 시스템과 로그인 기록에 남아 IT 부서가 해당 기록을 통해 원인을 확인하였다.\n전송 구간은 TLS로 암호화하고, 저장 시 DB·파일 수준 암호화를 적용한다. 비밀번호는 일방향 암호화로 저장한다. 개인정보처리시스템 접근 권한은 최소 권한 원칙에 따라 부여·변경·말소하며, 운영자 계정은 개인별로 발급하고 다단계 인증을 적용한다. 내부관리계획을 수립·시행·점검하고, 방화벽 등 네트워크 접근통제를 운영한다. 서버실 및 업무공간에 대한 출입통제를 실시하고, 문서 및 이동매체는 잠금장치로 보관하는 등 물리적 보호조치를 운영한다.\n회원정보 수정 화면에는 최소 정보만 표시하고, 연락처 등 식별 위험 항목은 마스킹한다. 중요한 정보는 재인증 후에만 열람·변경할 수 있도록 하고, 브라우저 캐시 방지 헤더를 적용한다. 세션은 인증 시 식별자를 재발급하고, 쿠키에 Secure·HttpOnly·SameSite를 설정하며, 유휴 및 최대 만료시간을 운영하고 로그아웃·비정상 종료 시 즉시 무효화한다. 동시 접속 제한 및 세션 고정·하이재킹 방지 통제를 적용한다.\n접속기록·변경 이력은 위조·변조 방지 상태로 보관·점검하고, 이상 징후를 모니터링한다. 악성코드 방지 프로그램을 설치·갱신하고, 취약점 점검과 보안 패치를 정기적으로 수행하며, 웹·애플리케이션 서버와 운영체제·미들웨어 보안 패치는 검증 후 신속 적용한다. 개발·운영 환경을 분리하고, 테스트에는 가명·익명 데이터를 사용하며, 오류 발생 시 디버그·개인정보가 응답에 포함되지 않도록 예외 처리를 적용한다.\n보유기간이 경과하거나 목적 달성 시에는 복구 불가능한 방식으로 파기하고, 법령상 보존이 필요한 경우에는 다른 개인정보와 분리 보관한다. 파기 및 분리 보관 이력을 기록한다. 제3자 제공과 업무 위탁은 필요한 범위에서만 수행하며, 유지보수 등 위탁 시 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 반환·파기 등을 포함한 계약을 체결하고 수탁자 접근 권한 관리와 점검을 수행한다. 위탁 및 수탁자 현황은 공개한다.\n정보주체는 홈페이지에서 열람·정정·삭제·처리정지·동의철회를 요청할 수 있으며, 본인 확인 후 정해진 절차에 따라 처리한다. 사고 대응 체계를 운영하고, 유출 등이 확인되면 영향 최소화 조치를 시행한 뒤 정보주체 통지와 관계기관 신고를 정한 시기와 방법에 따라 진행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "The REWRITTEN record removed the violated_articles list, which alters the original case record beyond handling/controls.", "fix": "Restore the violated_articles field to match the ORIGINAL. Replace the current empty array with: \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제48조의2\"]"}]}}
{"case_id": "2023-006-057", "respondent": "피심인(케이블TV·초고속인터넷·인터넷전화 서비스 제공 사업자)", "case_content": "피심인은 2022년 2월 11일 10:40 콜센터 1:1 채팅상담을 통해 타인 정보 조회 정황을 접수하고 같은 날 18:01 관련 내용을 IT 부서 등에 전달하였다. 유출등을 알게 된 시점은 2022년 2월 14일 22:35로 기록하였으며, 같은 시각 개인정보보호 포털에 유출 의심 사실을 신고하였다. 2022년 2월 15일 18:42에는 유선으로, 2022년 2월 16일 17:08에는 이메일로 이용자 B에게 확인된 항목(이름, 아이디, 생년월일, 성별, 휴대전화번호, 이메일주소 등)을 서면등의 방법으로 통지하였다. 접수된 상담 대화와 로그인·접속 기록 등 내부 로그는 원인 분석과 2022년 2월 23일 신고 내용 정정에 활용되었다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "법 제34조제1항 및 시행령 제39조가 요구하는 통지 필수 항목(발생 시점·경위, 피해 최소화 방법, 대응조치·피해구제 절차, 담당부서 연락처 등)이 case_content에 명시되어 있지 않아, 양 법령 충족 여부가 문면상 불명확함.", "fix": "통지 문장에 필수 항목을 명시적으로 추가. 예: \"동 통지에는 유출등이 된 개인정보의 항목, 발생(또는 의심) 시점과 경위, 정보주체의 피해 최소화 방법, 개인정보처리자의 대응조치 및 피해구제 절차, 신고·문의 접수 담당부서 및 연락처를 포함하였다.\"를 \"...통지하였다.\" 다음 문장으로 삽입."}, {"aspect": "legality", "issue": "유출등을 '알게 된 시점'의 기준이 2022-02-11의 정황 접수와 2022-02-14의 사실 확인 사이에서 어떻게 판단되었는지 명시가 없어, 72시간 기산점 관련 시행령 제39조의 해석상 불명확성이 존재.", "fix": "조사·확인 경과를 간단히 명시하여 기산점을 분명히 함. 예: \"피심인은 2월 11일 접수 건을 조사하여 2월 14일 22:35 유출등 사실을 확인(확정)하였고, 이를 '알게 된 시점'으로 기록하였다. 확인 전 단계에는 사실관계 확인 중으로 분류하였다.\"를 IT 부서 전달 경과 다음에 추가."}]}}
{"case_id": "2023-016-205", "respondent": "피심인(공공기관)", "case_content": "피심인(공공기관)은 학사 운영·관리를 위해 종합정보시스템과 교직원지원통합시스템을 운영한다. 재학생·교직원의 업무 처리에 필요한 최소 항목(성명, 학번/임용번호, 사용자 ID, 휴대전화번호 등)만 수집하며, 관계 법령에 따른 소관 업무 범위에서 이용·보관한다. 개인정보파일은 목적, 항목, 보유기간을 정의해 등록·관리하고, 목적 외 이용·제공이 필요한 경우 합리적 관련성 검토, 내부 승인, 기록 보관 및 통지 기준을 적용한다.\n\n보유·파기는 업무별로 설정한다. 가입자 관리 정보는 재학·재직 중 보관하고 졸업·퇴직 후 5년 내 파기한다. 기숙사 사생관리 정보는 입·퇴사 관리에 필요한 기간 동안 보관하고 퇴사 후 1년 내 파기한다. 법령상 보존이 필요한 자료는 별도 저장소에 분리 보관하며, 보존기간 만료 시 복구 불가능한 방식으로 자동 파기하고 파기 이력을 기록한다.\n\n접근권한은 최소권한 원칙으로 부여·변경·말소하며, 계정은 개인별로 관리하고 다단계 인증을 적용한다. 전송 구간은 암호화 채널을 사용하고, 저장 시 비밀번호·연락처 등 주요 식별정보는 암호화한다. 조회 화면에는 불필요한 전체 목록 노출을 제한하고, 필요한 경우 마스킹을 적용한다. 개인정보처리시스템에는 접근통제, 침입탐지/차단, 악성코드 방지 프로그램을 운영하고 주기적으로 패치 및 취약점 점검을 수행한다. 접속기록(접속일시, 처리내역 등)은 위·변조 방지 조치와 함께 1년 이상 보관·점검한다. 운영·개발·테스트 환경은 분리하고, 백업 데이터는 별도 네트워크 구간에 암호화 보관한다.\n\n산학협력단 홈페이지의 섬네일 이미지 업로드 페이지는 관리자 인증을 거쳐 사용하며, 업로드 시 확장자·MIME·콘텐츠 검증, 파일 크기 제한, 악성코드 검사, 파일명 난수화 및 경로 고정, 업로드 디렉터리 스크립트 실행 차단을 적용한다. 웹 방화벽과 보안 모듈로 업로드 요청을 검사하고, 비정상 요청·과도한 쿼리·권한 상승 시도를 차단한다. 관련 로그는 별도 저장소에 분리 보관하고 정기 점검한다.\n\n시스템 개발·유지보수 또는 클라우드 등 위탁이 필요한 경우, 위탁 범위, 재위탁 제한, 보안 통제, 사고 통지, 접근권한 관리, 점검·감독, 반환·파기 절차를 포함한 계약을 체결하고 정기적으로 이행 여부를 점검한다.\n\n이상 징후 탐지 시에는 원인 분석, 접속경로 차단, 취약점 보완, 로그 보존 등 대응 절차를 즉시 수행하고, 통지·신고 기준에 따라 정보주체 통지 및 관계기관 신고를 지연 없이 진행한다. 개인정보 처리방침을 공개하여 수집·이용 목적, 항목, 보유기간, 제3자 제공·위탁 현황, 안전조치, 권리행사 방법을 안내하며, 기준에 해당하는 개인정보파일은 사전 영향평가를 실시한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 2}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "원문에 있던 침해 사고의 핵심 사실(업로드 페이지의 미검증, 웹셸 업로드, 3,708건 조회·다운로드, 발견·신고·통지 일정)이 삭제되고 일반적 정책 문구로 대체되어 시나리오가 변경됨.", "fix": "case_content에 원문 사실을 복원하여 삽입하세요. 예: 문단에 다음 문장을 추가: \"산학협력단 홈페이지의 섬네일 이미지 업로드 페이지는 관리자 권한 확인과 파일 확장자 검증 없이 업로드를 허용하는 구조였고, 2022.6.25. 업로드된 웹셸에 6.26.~7.19. 기간 접근하여 기숙사·진로추천 관련 테이블과 교직원·재학생 테이블에서 데이터 3,708건이 조회·다운로드되었다. 피심인(공공기관)은 2022.12.13. 시스템 점검 과정에서 관련 보안 조치를 적용하고, 2023.6.15. 경찰 통보로 로그를 인지한 뒤 6.16. 한국인터넷진흥원에 신고하고 6.20. 정보주체에게 문자와 이메일로 통지하였다.\""}, {"aspect": "minimal_change", "issue": "업로드 페이지에 대해 과거에는 인증/검증이 없었는데 REWRITTEN에서는 마치 당시에도 관리자 인증과 각종 검증이 적용된 것으로 변경됨.", "fix": "해당 문장을 과거 사실과 이후 조치를 구분하여 수정하세요. 기존 문장: \"산학협력단 홈페이지의 섬네일 이미지 업로드 페이지는 관리자 인증을 거쳐 사용하며, 업로드 시 확장자·MIME·콘텐츠 검증...\"을 다음으로 교체: \"산학협력단 홈페이지의 섬네일 이미지 업로드 페이지는 당시 관리자 권한 확인과 파일 확장자 검증 없이 업로드가 가능하였다. 이후 보완 조치로 업로드 시 관리자 인증, 확장자·MIME·콘텐츠 검증, 파일 크기 제한, 악성코드 검사, 파일명 난수화 및 경로 고정, 업로드 디렉터리 스크립트 실행 차단을 적용하였다. 웹 방화벽과 보안 모듈로 업로드 요청을 검사하고, 비정상 요청·과도한 쿼리·권한 상승 시도를 차단한다. 관련 로그는 별도 저장소에 분리 보관하고 정기 점검한다.\""}, {"aspect": "minimal_change", "issue": "보유·파기 기간을 새로 설정(졸업·퇴직 후 5년, 퇴사 후 1년 등)하여 원문에 없던 정책을 도입하고 과거 보관 현황(2001년/2011년부터 유지)을 대체함.", "fix": "보유·파기 문단을 원문 사실 중심으로 정정하세요. 다음 문단 전체(\"보유·파기는 업무별로 설정한다...파기 이력을 기록한다.\")를 삭제하고, 아래 문장을 추가: \"가입자 관리 정보는 2001년 8월부터, 기숙사 사생관리 정보는 2011년 7월부터 유지해 왔다. 법령상 보존이 필요한 자료는 별도 저장소에 분리 보관한다.\""}, {"aspect": "minimal_change", "issue": "violated_articles가 비워져 원문의 위반 조항 정보가 제거됨.", "fix": "violated_articles를 원문과 동일하게 복원하세요. 예: \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제30조제1항\"]"}, {"aspect": "legality", "issue": "유출 통지·신고 기준을 '지연 없이'로만 표현하여 시행령의 72시간 기준(제39조, 제40조)이 명확히 반영되지 않음.", "fix": "case_content 내 해당 문구를 72시간 기준을 명시하도록 교체하세요. 기존: \"통지·신고 기준에 따라 정보주체 통지 및 관계기관 신고를 지연 없이 진행한다.\"를 다음으로 교체: \"법 제34조 및 시행령 제39조·제40조에 따라 72시간 이내 통지·신고한다.\""}, {"aspect": "legality", "issue": "공공기관의 개인정보파일 등록 의무(법 제32조)가 암시적으로만 표현되어 법적 요건 충족이 불명확함.", "fix": "개인정보파일 등록 관리 문구를 법 조문 근거와 함께 명시하세요. 기존: \"개인정보파일은 목적, 항목, 보유기간을 정의해 등록·관리하고\"를 다음으로 교체: \"개인정보파일은 목적, 항목, 보유기간을 정의해 법 제32조에 따라 보호위원회에 등록·관리하고\""}]}}
{"case_id": "2023-016-203", "respondent": "피심인(공공기관)", "case_content": "피심인(공공기관)은 학년도 입학사정관 종합평가시스템을 운영한다. 관리자 기능은 기관망 또는 승인된 VPN을 통한 다중인증(기관 인증서와 일회용 비밀번호)으로만 접속할 수 있도록 하며, 접속 IP 허용목록과 단말 보안프로파일 점검을 적용한다. 계정은 개인별로 발급하고, 비밀번호는 일방향 암호화로 저장하며 복잡도·주기·오입력 잠금·휴면잠금·세션 타임아웃 정책을 운영한다. 역할 기반으로 관리자·평가자 권한을 최소 범위로 부여하고, 권한 부여·변경·말소 이력을 관리한다.\n주민등록번호와 성적 등 평가정보는 전송 및 저장 시 암호화한다. 주민등록번호는 별도 영역에 분리 보관하고, 암호키는 키관리시스템에서 분리·권한 통제 하에 관리한다. 화면에서는 주민등록번호를 기본 마스킹하며, 법령상 확인이 필요한 경우에 한해 업무상 승인과 재인증을 거쳐 일시 복호화한다. 복호화·열람·변경·다운로드 등 주요 행위는 모두 로그로 남기고, 위변조 방지 저장소에 보관·점검한다.\n자료 반출은 기본 비활성화되어 있으며, 평가 업무상 필요한 경우 최소 항목만 추출하도록 표준 템플릿을 제공하고 주민등록번호는 제외한다. 예외적으로 고유식별정보가 포함되는 추출은 사전 승인과 사유 기록, 재식별 위험 점검 후 암호화 파일로 제공하며 워터마크와 만료 설정을 적용한다. 반출 자료는 기관 지정 저장소에 보관하고 무단 외부 공유를 제한한다.\n시스템에는 침입 차단·탐지, 최신 보안 패치, 악성코드 대응을 적용한다. 접속기록, 권한 변경, 반출 승인·사용 기록을 주기적으로 모니터링하고 이상 징후에 대응한다. 평가 종료 후에는 정해진 보존기간을 제외하고 개인정보를 지체 없이 파기하며, 전자파일은 복구 불가능한 방식으로 삭제하고 보존 대상은 다른 정보와 분리 보관한다. 위탁이 필요한 경우 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 반환·파기 및 점검을 포함한 계약을 체결하고 정기적으로 이행 현황을 점검한다. 개인정보 보호책임자 주관으로 내부 관리계획을 운영하고 개인정보취급자에 대한 정기 교육을 실시한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "주민등록번호(고유식별정보) 처리의 법적 근거와 범위가 명시되지 않아 법 제24조의2 제1항의 예외 요건 충족 여부가 불분명함.", "fix": "case_content에 주민등록번호 수집·이용의 법적 근거와 범위를 명시하세요. 예시 문구 추가: \"주민등록번호 처리는 관련 법령에 근거하여 입학전형 관리에 불가피한 경우에 한해 수집·이용하며(예: 고등교육법 및 하위 법령 등 구체적 근거), 해당 근거·항목·보유기간을 고지하고 처리방침에 공개한다. 주민등록번호가 불필요한 업무에는 학번 등 대체 식별자를 사용한다.\""}, {"aspect": "legality", "issue": "공공기관으로서 개인정보파일 등록(법 제32조) 및 영향평가(법 제33조, 영 제35조) 적용 가능성에 대한 이행 문구가 없어 법령·시행령 준수 확인이 곤란함.", "fix": "case_content에 다음 문구를 보완하세요: \"해당 개인정보파일은 법 제32조에 따라 등록하고, 처리 규모가 시행령 제35조 기준에 해당하는 경우 개인정보 영향평가를 실시하여 결과를 보호위원회에 제출한다.\""}, {"aspect": "legality", "issue": "유출 등 사고 발생 시 통지·신고 절차(법 제34조, 영 제39조·제40조) 언급 부재로 안전성 확보 의무 체계의 완결성이 다소 미흡함.", "fix": "case_content에 다음 문구를 추가하세요: \"개인정보 유출 등을 알게 된 때에는 72시간 이내 정보주체 통지 및 보호위원회/한국인터넷진흥원 신고 등 관련 절차를 수행하고, 추가 확인사항은 확인 즉시 추가 통지·신고한다.\""}]}}
{"case_id": "2023-016-203", "respondent": "피심인(공공기관)", "case_content": "피심인(공공기관)은 구 인증지원시스템, 기관홈페이지 통합구축시스템, 통합연구행정지원시스템, 입학정보시스템 등을 운영하며, 학사·연구 행정 및 입학업무 수행을 위해 성명, 학번, 연락처, 사진, 연구자 정보 등 필수 항목만 수집·이용한다. 개인정보파일별 처리 목적, 수집 항목, 보유기간을 정의하고 목적별로 분리 저장하며, 보유기간 경과 또는 목적 달성 시 복구 불가능한 방식으로 즉시 파기하고, 법정 보존 사유가 있는 경우에는 다른 정보와 분리 보관한다.\n전송 구간은 TLS로 암호화하고, 저장 시 연락처·사진 등 주요 항목은 암호화하며, 인증 수단은 일방향 암호화로 관리한다. 접근 권한은 직무·역할 기반으로 최소한으로 부여·변경·말소하고, 정기 권한 점검을 수행한다. 조회·수정 요청 시 서버단 인증·인가와 식별자 일치 검증을 적용하여 파라미터 변조로 인한 접근을 차단하고, 모든 입력값은 화이트리스트·바인딩 등으로 검증한다.\n파일 업로드는 지정된 확장자·MIME·시그니처 일치 확인, 악성코드 검사, 허용 크기 제한을 거친 후 웹루트와 분리된 저장소에 보관하며 실행 권한을 부여하지 않는다. 업로드·다운로드 이력은 계정, 시각, 원본·저장 경로 등과 함께 기록한다. DB 접속정보는 비밀관리시스템에 저장하고 정기 교체하며, 서비스 계정은 업무 단위로 분리·최소권한을 부여한다. 개인정보처리시스템은 네트워크 분할과 방화벽·WAF·침입탐지/차단을 적용하고, 관리 영역 접속은 다중인증 및 점프서버를 통해서만 허용한다.\n접속기록은 계정, 시각, 처리내역, IP 등으로 위변조 방지 형태로 최소 1년 이상 보관하고, 월 1회 이상 점검·모니터링하며 이상 징후는 경보·조치한다. 악성코드 방지 프로그램을 설치·상시 업데이트하고, 정기 취약점 점검·모의침투와 패치 관리를 수행한다. 소스코드는 배포 전 보안 점검을 거치며, 레거시 모듈은 일정에 따라 교체·격리한다.\n데이터 내려받기는 업무상 필요한 경우에 한해 승인 절차를 적용하며, 기본적으로 비식별·마스킹 및 워터마킹을 적용한다. 내려받기 파일은 암호화되어 기관 지급·관리 단말에만 저장 가능하고, 개인 소유 단말 저장은 차단한다. 반출 내역은 기록·점검하며, 대량 조회·내려받기에는 추가 인증과 사유 입력을 요구한다.\n위탁(개발·운영·유지보수 등) 시 처리 범위, 안전조치, 재위탁 제한, 사고 통지, 점검·감독, 반환·파기 절차를 포함한 계약을 체결하고, 수탁자에 대한 계정 분리·권한 관리, 정기 교육 및 현장/문서 점검을 수행한다. 공공시스템 운영에 대해 전담 부서와 관리책임자를 지정하고, 이용기관의 권한부여·변경·말소를 통제하며, 접속기록 저장·분석·경보 체계를 운영한다. 개인정보 처리방침을 공개하고, 열람·정정·삭제·처리정지 등 권리행사 창구를 통해 요청을 접수·처리한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 3}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "원문에 포함된 시점/사실(2009·2011·2014년부터 운영/수집, 과거 파라미터 검증 누락, 업로드 검증 부재, 개인 노트북 저장, 구 인증지원시스템의 월 1회 점검 미이행 등)들이 REWRITTEN에서 삭제되어, 동일 시나리오의 연속성이 약화됨.", "fix": "원문의 핵심 사실을 ‘과거에는 ~였으나 현재는 ~로 개선’의 형태로 보강하여 시나리오를 유지하세요. 예시 텍스트 수정안(따옴표 부분을 해당 문단에 삽입 또는 교체):\n- 시스템 운영 시점 보강(첫 문단 시스템 나열 직후 괄호로 삽입): \"피심인(공공기관)은 구 인증지원시스템, 기관홈페이지 통합구축시스템, 통합연구행정지원시스템, 입학정보시스템 등을 운영하며(해당 시스템은 2009년, 2011년, 2014년부터 운영), 학사·연구 행정 및 입학업무 수행을 위해 …\" \n- 파라미터 검증 취약점의 개선 이력 반영(둘째 문단 선두에 접속/검증 문장과 연결): \"과거 일부 화면에서 파라미터 검증이 누락되어 파라미터 변조 위험이 있었으나 이를 개선하여, 조회·수정 요청 시 서버단 인증·인가와 식별자 일치 검증을 적용하고 모든 입력값은 화이트리스트·바인딩 등으로 검증한다.\" \n- 파일 업로드 검증 미흡의 개선 이력 반영(셋째 문단 선두): \"과거 파일 업로드 권한·확장자 검증이 미흡한 페이지가 있었으나 이를 개선하여, 파일 업로드는 지정된 확장자·MIME·시그니처 일치 확인, 악성코드 검사, 허용 크기 제한을 거친 후 웹루트와 분리된 저장소에 보관하며 실행 권한을 부여하지 않는다.\" \n- 접속기록 점검 주기 개선 이력 반영(넷째 문단의 점검 문장 보강): \"접속기록은 계정, 시각, 처리내역, IP 등으로 위변조 방지 형태로 최소 1년 이상 보관하고, 특히 구 인증지원시스템은 과거 월 1회 이상 정기 점검이 미흡하였으나 현재는 월 1회 이상 점검·모니터링하며 이상 징후는 경보·조치한다.\" \n- 개인 노트북 저장 관행 개선 반영(다섯째 문단 선두): \"과거에는 웹 인터페이스를 통해 엑셀·PDF 등 파일을 내려받아 개인 노트북 등에 저장되기도 했으나, 현재는 데이터 내려받기를 업무상 필요한 경우에 한해 승인 절차를 적용하며 기본적으로 비식별·마스킹 및 워터마킹을 적용한다. 내려받기 파일은 암호화되어 기관 지급·관리 단말에만 저장 가능하고, 개인 소유 단말 저장은 차단한다.\""}]}}
{"case_id": "2023-016-203", "respondent": "피심인(공공기관)", "case_content": "피심인(공공기관)은 2022년 11월 5일 유출 사실을 인지하였다. 11월 7일 개인정보보호위원회와 한국인터넷진흥원에 신고하고, 11월 10일 대표 홈페이지에 안내문을 게시하였다. 11월 6일부터 11월 16일까지 접속경로 차단, 취약점 보완, 계정 정리, 유출 정보 회수·삭제 등 긴급 조치를 수행한 뒤 11월 17일 재학생·졸업생·교직원 등 정보주체에게 문자와 이메일로 통지하였다. 12월 12일 추가 유출 사항을 신고하고, 관련 내용을 포함한 추가 통지와 공지를 진행하였다. 통지에는 유출 항목, 시점과 경위, 피해 최소화 방법, 대응 및 문의 연락처 등이 포함되었고, 사용자 비밀번호 강제 변경, 서버 중지 및 계정 삭제, 취약점 제거 등의 후속 조치를 병행하였다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 3}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "New timeline details were added that were not in the original, specifically the inserted date range and pre-notification emergency actions, which alters the scenario sequence.", "fix": "Delete the clause “11월 6일부터 11월 16일까지 접속경로 차단, 취약점 보완, 계정 정리, 유출 정보 회수·삭제 등 긴급 조치를 수행한 뒤” so the timeline matches the original. Suggested replacement case_content: “피심인(공공기관)은 2022년 11월 5일 유출 사실을 인지하였다. 11월 7일 개인정보보호위원회와 한국인터넷진흥원에 신고하고, 11월 10일 대표 홈페이지에 안내문을 게시하였다. 11월 17일 재학생·졸업생·교직원 등 정보주체에게 문자와 이메일로 통지하였다. 12월 12일 추가 유출 사항을 신고하고, 관련 내용을 포함한 추가 통지와 공지를 진행하였다. 통지에는 유출 항목, 시점과 경위, 피해 최소화 방법, 대응 및 문의 연락처 등이 포함되었고, 사용자 비밀번호 강제 변경, 서버 중지 및 계정 삭제, 취약점 제거 등의 후속 조치를 병행하였다.”"}, {"aspect": "minimal_change", "issue": "Changed control terminology from the original (계정 정리 vs 계정 삭제) and added controls not present (유출 정보 회수·삭제, 접속경로 차단).", "fix": "Align wording with the original controls and remove additions. Specifically, replace “계정 정리” with “계정 삭제” and remove “유출 정보 회수·삭제, 접속경로 차단, 취약점 보완” if they were not in the original. Keep only: “사용자 비밀번호 강제 변경, 서버 중지 및 계정 삭제, 취약점 제거.”"}, {"aspect": "minimal_change", "issue": "The violated_articles field was cleared, which changes the original record’s metadata without necessity for objectivity (which applies to case_content).", "fix": "Restore the original violated_articles. Set violated_articles to: [\"개인정보 보호법 제34조제1항\"]."}]}}
{"case_id": "2023-016-206", "respondent": "공공기관", "case_content": "공공기관은 대표 홈페이지 회원정보 파일을 운영한다. 2013년 3월부터 2023년 8월 30일 기준까지 회원정보(서명, 학번·직번(ID), 비밀번호 등)를 데이터베이스에 보관하였고, 비밀번호는 MD5 방식으로 저장하였다. 웹사이트 관리 솔루션의 특정 소스코드에 데이터베이스 접속정보가 포함된 상태로 관리되었고, 해당 소스코드에서 입력 파라미터 검증이 누락된 구조가 유지되었다. 2022년 7월 학생이 파일 업로드 취약점을 이용해 웹셸을 설치한 뒤 네트워크를 통해 회원정보 테이블에 접속하여 34,288건의 데이터를 내려받았다. 공공기관은 2023년 6월 경찰 통보 직후 대응을 개시하여 한국인터넷진흥원에 신고하고 정보주체에게 문자로 통지하였다. 이후 데이터베이스 접속정보를 소스코드에서 분리하여 비밀관리하고, 입력 파라미터 검증과 파일 업로드 보안정책을 적용하여 취약점을 보완하였다. 비밀번호 저장 방식을 솔트를 적용한 강력한 일방향 해시(bcrypt 등)로 전환하고, 접근권한 관리, 접속기록 보관·점검, 악성프로그램 탐지·차단 등 개인정보의 안전한 관리를 위한 기술적·관리적 조치를 시행하였다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 4, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "유출 통지 및 신고의 법정 기한(72시간 이내)과 통지 필수 기재사항(유출 항목, 시점·경위, 피해 최소화 방법, 대응조치, 접수처)이 명시되지 않아 법 및 시행령 충족 여부가 모호합니다.", "fix": "다음 문장을 교체하여 72시간 이내 통지·신고 및 필수 기재사항을 명확히 하세요.\n- 교체 전: \"공공기관은 2023년 6월 경찰 통보 직후 대응을 개시하여 한국인터넷진흥원에 신고하고 정보주체에게 문자로 통지하였다.\"\n- 교체 후: \"공공기관은 2023년 6월 경찰 통보를 받은 즉시, 72시간 이내에 한국인터넷진흥원에 신고하고, 유출된 개인정보의 항목, 유출 시점과 경위, 피해 최소화 방법, 대응조치 및 신고 접수처를 포함하여 정보주체에게 문자로 통지하였다.\""}, {"aspect": "objectivity", "issue": "“강력한”과 같은 평가적 수식어가 포함되어 사실 서술을 넘어서는 어조로 보일 수 있습니다.", "fix": "평가적 표현을 삭제하여 중립적으로 수정하세요.\n- 교체 전: \"비밀번호 저장 방식을 솔트를 적용한 강력한 일방향 해시(bcrypt 등)로 전환하고\"\n- 교체 후: \"비밀번호 저장 방식을 솔트를 적용한 일방향 해시 알고리즘(bcrypt 등)으로 전환하고\""}, {"aspect": "minimal_change", "issue": "원문에 없던 사후 조치가 상세히 열거되어 불필요한 사실 추가로 볼 소지가 있습니다.", "fix": "사후 조치 서술을 간결화하여 불필요한 신규 사실 추가를 최소화하세요.\n- 교체 대상 문장(2개): \"이후 데이터베이스 접속정보를 소스코드에서 분리하여 비밀관리하고, 입력 파라미터 검증과 파일 업로드 보안정책을 적용하여 취약점을 보완하였다. 비밀번호 저장 방식을 솔트를 적용한 강력한 일방향 해시(bcrypt 등)로 전환하고, 접근권한 관리, 접속기록 보관·점검, 악성프로그램 탐지·차단 등 개인정보의 안전한 관리를 위한 기술적·관리적 조치를 시행하였다.\"\n- 교체 후(간결화): \"이후 관련 취약점을 보완하고 개인정보의 안전성 확보를 위한 기술적·관리적 조치를 시행하였다.\""}]}}
{"case_id": "2023-016-208", "respondent": "피심인(공공기관)", "case_content": "피심인(공공기관)은 학사 관리를 위해 대표 홈페이지와 SSO 기반 포털을 운영하였고, 2006년 3월부터 이용자 54,666명의 학번·직번(ID), 생년월일, 성별, 소속학과, 내선번호, 연락처 뒷 4자리, 이메일 주소 앞 4자리 등을 저장·관리하였다. 홈페이지 관리자페이지의 파일 업로드 기능에 관리자 권한 확인 및 파일 확장자 검증이 적용되지 않아, 2022.6.25.~7.21. 사이 제3자가 웹셸을 업로드하고 웹사이트 관리 솔루션의 소스코드를 내려받아 그 안의 데이터베이스 연결정보를 확인한 후, 해당 연결정보로 SSO 뷰 테이블을 직접 조회하여 회원 정보가 다운로드되었다. 피심인은 2023.6.20. 경찰 통보로 이를 인지하였고, 2023.6.22. 정보주체 통지·홈페이지 게시 및 개인정보포털 신고를 실시하였다.\n\n개선 조치:\n- 수집·이용: 과거 수집하던 생년월일·성별 등 불필요 항목은 2023.06.22.부로 수집을 중단하고, 동일 날짜 기준 일괄 파기(전자파일 영구 삭제, 서면 파쇄·소각)하였다. 이후 SSO 계정 발급과 포털 이용 관리에 필요한 최소 항목(학번·직번(ID), 소속(학과/부서), 사용자 유형, 연락수단 1종(학교 이메일 또는 내선))만 수집한다. 동의에 기반하여 수집하는 경우, 화면에 수집·이용 목적, 항목, 보유기간, 동의 거부권 및 거부에 따른 불이익을 알리고, 필수·선택 항목을 구분하여 각각 구분동의를 받는다. 공공업무 수행 등 법적 근거에 따라 처리하는 경우에는 해당 근거와 목적을 함께 안내하고, 법적 근거가 있는 경우에는 별도의 동의 절차를 요구하지 않는다. 제3자로부터 연계 수집 시 정보주체 요청이 있으면 수집 출처와 목적을 즉시 알린다.\n- 저장·분리: SSO 본 데이터베이스와 홈페이지 데이터베이스를 물리·논리적으로 분리한다. ‘뷰 테이블’은 읽기 전용으로 최소 컬럼만 제공하고, 대량 조회·내보내기를 제한한다. 데이터 전송 구간은 TLS로 암호화하고, 저장 시 주요 식별정보는 암호화한다. 인증정보(비밀번호 등)는 일방향 암호화로 저장한다. DB 연결정보는 소스코드에 포함하지 않고 비밀관리 시스템에 분리 보관하며 주기적으로 교체한다.\n- 접근통제·기록: 역할 기반 최소권한을 부여하고, 개인별 계정과 2단계 인증, IP 허용목록을 적용한다. 권한 부여·변경·말소 이력을 기록하고, 개인정보처리시스템 접속기록을 위·변조 방지하여 1년 이상 보관·점검한다. 내부관리계획을 수립·시행하고 정기 교육을 실시한다.\n- 응용·인프라 보안: 관리자페이지에 강력한 인증과 세션관리, 승인 절차를 적용한다. 파일 업로드에는 화이트리스트 기반 확장자·MIME 검증, 콘텐츠 스캔, 크기 제한, 실행권한 제거, 웹루트 외 저장을 적용한다. 웹방화벽·침입차단을 운영하고, 정기 취약점 점검과 패치 관리를 수행한다. 비정상 쿼리·대량 조회·반복 다운로드를 탐지·차단하고, 데이터 반출은 승인 절차와 암호화를 적용한다.\n- 보유·파기: 계정 이용 기간 동안 보유하며, 졸업·퇴직 또는 최종 로그인 후 2년이 지나면 자동 파기한다. 다른 법령에 따른 보존분은 별도 저장소에 분리 보관한다. 전자파일은 복구 불가능한 방식으로 영구 삭제하고, 서면은 파쇄·소각하며, 파기 이력을 기록한다.\n- 위탁: 시스템 개발·운영 등을 위탁할 경우 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 점검·교육, 반환·파기 등 계약조건을 포함하고, 수탁자에 대한 연 1회 이상 점검을 실시한다. 수탁자 계정은 개인별로 발급하고 접속기록을 보관한다. 또한 위탁 현황(위탁 업무 내용과 수탁자 명칭)을 홈페이지에 상시 공개하고, 홈페이지 운영이 불가한 경우 사업장 등 보기 쉬운 장소에 30일 이상 게시한다. 위탁 내용 또는 수탁자 변경 시에는 동일한 방법으로 지체 없이 공개한다.\n- 공공시스템 운영: 공공시스템별 안전조치를 내부관리계획에 반영하고, 전담부서와 관리책임자를 지정한다. 공공시스템 운영협의회를 구성하여 접속기록 저장·분석, 권한관리, 개선조치를 주기적으로 점검한다. 개인정보파일이 일정 기준(예: 100만명 이상, 50만명 이상 연계, 5만명 이상 민감/고유식별정보 등)에 해당하는 경우 사전에 개인정보 영향평가를 실시하여 개선사항을 반영하고, 영향평가서를 제출한다.\n- 권리보장·공개: 열람·정정·삭제·처리정지·수신동의 철회 절차를 동일 채널에서 쉽게 신청할 수 있도록 제공한다. 개인정보 처리방침을 상시 공개하고, 개인정보파일을 등록·관리한다.\n- 침해 대응: 이상 징후 탐지 시 즉시 차단·조사·비밀키/계정 교체·임시 접근제어를 시행하고, 유출등 사실을 인지하면 72시간 이내 정보주체에게 통지한다. 유출 규모가 1천명 이상이거나, 민감정보 또는 고유식별정보가 포함되었거나, 외부 불법접근에 의한 경우에는 72시간 이내 보호위원회 또는 한국인터넷진흥원에 신고한다. 정보주체 연락처를 알 수 없는 경우에는 홈페이지에 30일 이상 게시하여 통지를 갈음한다. 피해 최소화 방법을 안내하고 재발 방지 대책을 이행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 3}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "The violated_articles field was removed. The original listed violations under PIPA and its Decree; clearing them is an unnecessary change unrelated to handling/controls.", "fix": "Restore the original violated_articles. Explicit edit: set \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제30조제1항\"]"}, {"aspect": "minimal_change", "issue": "The business/system description was altered (e.g., \"대표 홈페이지와 SSO 기반 포털\" and omission of the explicit phrase about operating a '홈페이지 사용자 정보' file in the SSO DB view table). This is an unnecessary deviation from the original scenario.", "fix": "Revert the opening sentence of case_content to preserve the original description while keeping the added improvement controls. Replace the first sentence with: \"피심인(공공기관)은 학사 관리를 위해 대표 홈페이지 시스템과 인증시스템(SSO) 데이터베이스의 뷰 테이블에 ‘홈페이지 사용자 정보’ 파일을 운영하며, 2006년 3월부터 수집한 이용자 54,666명의 학번·직번(ID), 생년월일, 성별, 소속학과, 내선번호, 연락처 뒷 4자리, 이메일 주소 앞 4자리 등을 저장·관리하였다.\""}]}}
{"case_id": "2023-016-204", "respondent": "경북대학교 총동창회", "case_content": "경북대학교 총동창회는 대표 홈페이지(alumni.knu.ac.kr)를 통해 동문회원정보를 수집·이용해 왔다. 2011년 5월부터 회원의 아이디, 비밀번호, 이메일, 휴대전화번호 등을 데이터베이스에 저장하였으며, 비밀번호는 관리자와 회원 모두에 대해 일방향 암호화(예: bcrypt 등, 적정 워크팩터 적용)로 저장하였다. 홈페이지 운영 과정에서 디렉터리 인덱싱을 비활성화하고 소스코드 파일 접근을 차단하였으며, 테스트 업로드 페이지는 운영환경에 배포하지 않거나 접근통제(인증, 권한관리)를 적용하였다. 웹서버 루트의 설정 파일에 포함될 수 있는 DB 접속정보는 환경변수 또는 비밀관리시스템으로 분리·관리하고, 원격 DB 접속에는 IP 제한과 다중인증을 적용하였다. 2022년 6월 12일경 외부에서 웹셸 업로드 및 크롤링 시도가 확인되었으며, 접속경로 차단과 취약점 보완을 즉시 실시하고 관련 테이블에 대한 비정상 접근 여부를 점검하였다. 유출 정황을 인지한 즉시 72시간 이내에 정보주체에게 이메일·문자로 안내하고 피해 최소화 방법과 대응조치를 통지하였으며, 홈페이지에도 공지하였다. 또한 72시간 이내 한국인터넷진흥원 또는 개인정보보호위원회에 우선 신고하고, 확인되는 추가 내용은 지체 없이 추가 신고하였다. 개인정보처리시스템에 대한 접근권한 부여·변경·말소 기준을 수립·시행하고, 침입차단/탐지 등 네트워크 보안조치를 운영하였다. 개인정보처리시스템 접속기록(접속일시·처리내역 등)을 안전하게 보관하고 위·변조 방지조치를 적용하였으며, 정기적으로 저장·점검·감독하였다. 2023년 3월 31일에는 기존 홈페이지를 폐쇄하고 개인정보를 수집하지 않는 형태의 홈페이지를 제작·운영하기로 결정하였다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 1}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "원문 핵심 사실이 다수 변경됨. 예: (1) 비밀번호 저장방식이 평문→일방향 암호화로 변경 서술, (2) 디렉터리/소스 접근 가능→차단으로 변경, (3) 테스트 업로드 가능→미배포/접근통제로 변경, (4) 웹서버 루트의 DB접속정보 노출→비밀관리로 변경, (5) 2022-06-12에 실제 DB 텍스트 파일 내려받음→‘시도’로 완화, (6) 통지/신고 시점이 2023-02-10 통지에서 ‘72시간 이내 통지/신고’로 변경, (7) 2022-06-26부터의 웹로그 보관 사실 누락, (8) 사건 이전부터 고도화된 통제(접근권한 기준, IDS/IPS, 접속기록 위변조방지 등) 존재로 서술.", "fix": "다음과 같이 문장을 원문 사실에 맞게 교체/삭제/추가하세요.\n- 교체1: \"2011년 5월부터 회원의 아이디, 비밀번호, 이메일, 휴대전화번호 등을 데이터베이스에 저장하였으며, 비밀번호는 관리자와 회원 모두에 대해 일방향 암호화(예: bcrypt 등, 적정 워크팩터 적용)로 저장하였다.\" → \"2011년 5월부터 회원들의 ID, 비밀번호, 이메일, 휴대전화번호 등을 데이터베이스에 저장해 왔고 비밀번호는 관리자와 회원 모두에 대해 평문 형태로 기록하였다.\"\n- 교체2: \"홈페이지 운영 과정에서 디렉터리 인덱싱을 비활성화하고 소스코드 파일 접근을 차단하였으며, 테스트 업로드 페이지는 운영환경에 배포하지 않거나 접근통제(인증, 권한관리)를 적용하였다.\" → \"홈페이지 운영 과정에서 웹브라우저로 디렉터리 목록과 소스코드 파일을 확인할 수 있는 상태였고, 테스트 업로드 페이지에서 파일 업로드가 가능하였다.\"\n- 교체3: \"웹서버 루트의 설정 파일에 포함될 수 있는 DB 접속정보는 환경변수 또는 비밀관리시스템으로 분리·관리하고, 원격 DB 접속에는 IP 제한과 다중인증을 적용하였다.\" → \"웹서버 루트의 설정 파일에 포함된 DB 접속정보를 통해 동문회원정보 테이블에 접근할 수 있었다.\"\n- 교체4: \"2022년 6월 12일경 외부에서 웹셸 업로드 및 크롤링 시도가 확인되었으며, 접속경로 차단과 취약점 보완을 즉시 실시하고 관련 테이블에 대한 비정상 접근 여부를 점검하였다.\" → \"2022년 6월 12일경 제3자가 웹셸 업로드 후 크롤링 코드를 사용해 해당 데이터베이스에서 개인정보를 텍스트 파일로 내려받았다.\"\n- 교체5: \"유출 정황을 인지한 즉시 72시간 이내에 정보주체에게 이메일·문자로 안내하고 피해 최소화 방법과 대응조치를 통지하였으며, 홈페이지에도 공지하였다.\" → \"피심인은 2023년 2월 10일 이메일과 문자로 통지하고 홈페이지에 관련 사실을 게시하였다.\"\n- 삭제: \"또한 72시간 이내 한국인터넷진흥원 또는 개인정보보호위원회에 우선 신고하고, 확인되는 추가 내용은 지체 없이 추가 신고하였다.\"(원문에 없는 내용이므로 삭제)\n- 추가1(사실 복원): 사건 관련 로그 보관 사실을 반영하기 위해 \"피심인은 2022년 6월 26일부터 관련 웹로그를 보관하였다.\"를 2022년 6월 12일 관련 문장 다음에 삽입\n- 수정(사후조치로 재기술): 사전에 존재한 것으로 서술된 통제들은 사건 이후 조치로 전환: \"개인정보처리시스템에 대한 접근권한 부여·변경·말소 기준을 수립·시행하고, 침입차단/탐지 등 네트워크 보안조치를 운영하였다. 개인정보처리시스템 접속기록(접속일시·처리내역 등)을 안전하게 보관하고 위·변조 방지조치를 적용하였으며, 정기적으로 저장·점검·감독하였다.\" → \"사건 이후 접근권한 부여·변경·말소 기준을 수립·시행하고, 침입차단/탐지 등 네트워크 보안조치를 보완하였다. 개인정보처리시스템 접속기록을 안전하게 보관하고 위·변조 방지조치를 적용하였으며, 정기적으로 점검·감독하였다.\""}, {"aspect": "legality", "issue": "법·시행령상 필수 고지/동의 및 파기 절차의 적시가 없어 전체 처리행위의 적법성이 문면상 불명확함. 법 제15조·제22조·제30조(수집 동의·처리방침 공개) 및 제21조, 시행령 제16조(파기방법) 관련 핵심사항 누락.", "fix": "case_content 말미에 다음 문장을 추가하여 적법성 요소를 명시하세요.\n- 동의·처리방침: \"동문회원정보 수집 시 개인정보 처리방침을 홈페이지에 공개하고, 수집·이용 목적, 항목, 보유 및 이용 기간, 동의 거부권 및 불이익을 고지한 후 동의를 받아 처리하였다.\"\n- 파기: \"보유기간 경과 또는 처리 목적 달성 등 불필요해진 개인정보는 법령에 따라 지체 없이 파기하였으며, 전자파일은 복구 불가능한 방법으로 영구 삭제하고, 서면 등은 파쇄 또는 소각하였다.\""}]}}
{"case_id": "2023-016-207", "respondent": "피심인(공공기관)", "case_content": "피심인(공공기관)은 수시모집 원서 접수와 입학사정관 평가를 위해 입시종합정보시스템과 입학사정관 종합평가시스템을 운영한다. 지원자에 대해서는 전형 진행에 필요한 최소 항목(성명, 수험번호, 연락처, 졸업연도, 지원학과, 출신고교)만 수집하며, 주민등록번호는 원칙적으로 수집하지 않고 법령 근거가 있는 경우에 한해 별도 분리 영역에 암호화해 저장한다. 평가위원은 성명, 소속, 연락처, 위촉 정보 등 최소 항목만 등록한다. 모든 전송 구간은 암호화 통신을 사용하고, 저장 데이터는 식별자 기준으로 암호화하며 암호키는 업무 시스템과 분리해 관리한다. 계정은 개인별로 발급하고 비밀번호는 솔트가 포함된 일방향 암호화로 저장하며, 관리자·평가위원 등 중요 권한은 다단계 인증, 비인가 IP 차단, VPN 내 접속으로 제한한다. 로그인 실패 누적 시 계정 잠금, 세션 타임아웃, 휴면 계정 잠금 및 정기 권한 재검토를 적용한다. 웹·애플리케이션·DB 서버는 분리하고 방화벽 및 침입차단/WAF 정책을 운영하며, 개인정보처리시스템 접근기록과 데이터 반출 이력을 위변조 방지 형태로 2년 이상 보관·점검한다. 주민등록번호 등 고유식별정보는 화면과 파일 반출 시 전량 마스킹되며, 대량 다운로드는 사전 승인 및 사유 기록이 없으면 제한된다. 전형 종료 후 불합격 지원자 정보는 보존 사유가 없는 한 정해진 기간 내 자동 파기하고, 합격자 정보는 학사 시스템으로 이관 후 필요한 항목만 보관한다. 파기는 전자파일 영구 삭제, 서면은 파쇄·소각으로 수행하며, 법정 보존 대상은 분리보관하고 파기 이력을 기록한다. 시스템 유지관리 위탁 시에는 처리 범위, 재위탁 제한, 암호화·접근통제 등 안전조치, 사고 통지, 점검, 반환·파기를 포함한 계약을 체결하고 수탁자 계정·접속기록을 관리한다. 정보주체는 마련된 창구를 통해 열람·정정·처리정지 등을 요청할 수 있으며, 전형 운영상 공개가 어려운 항목은 관련 규정 범위에서 안내한다. 이상행위 탐지와 취약점 점검을 정기 수행하고, 유출 등 사고 인지 시 신속한 차단·조치와 72시간 이내 통지·신고 절차를 운영한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 2}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "원본 사건의 핵심 사실(주민등록번호 수집·보관)이 ‘원칙적으로 수집하지 않음’으로 변경되어 사업 시나리오가 불필요하게 변형됨.", "fix": "다음 문장을 교체하세요: \"지원자에 대해서는 전형 진행에 필요한 최소 항목(성명, 수험번호, 연락처, 졸업연도, 지원학과, 출신고교)만 수집하며, 주민등록번호는 원칙적으로 수집하지 않고 법령 근거가 있는 경우에 한해 별도 분리 영역에 암호화해 저장한다.\" -> \"지원자에 대해서는 전형 진행에 필요한 항목(성명, 수험번호, 연락처, 졸업연도, 지원학과, 출신고교, 주민등록번호(관련 법령 근거가 있는 경우))을 수집·보관하며, 주민등록번호 등 고유식별정보는 별도 분리 영역에 암호화해 저장한다.\""}, {"aspect": "minimal_change", "issue": "원본에 존재한 사고 인지·통지·신고 및 조치 일정(2023-06-21 인지, 06-23 통지, 06-29 공지·KISA 신고)이 삭제되어 사건 전개가 달라짐.", "fix": "다음 문단을 추가하세요(권장 위치: \"전형 종료 후 불합격 지원자 정보...\" 단락 뒤 또는 마지막 전단락 앞): \"2023년 6월 21일 로그와 관리자페이지 확인을 통해 2022년 10월 15일 발생 사실을 인지한 뒤, 유출 정보 백업 후 데이터 삭제와 서비스 중단을 거쳐 6월 30일 보안 강화된 신규 서버를 구성하고 웹·DB 서버 분리 및 방화벽 정책을 적용하였다. 6월 23일 문자·SNS로 통지하고 6월 29일 대표 홈페이지 공지 및 한국인터넷진흥원 신고를 진행하였다.\" 또한 마지막 문장의 \"72시간 이내 통지·신고 절차를 운영한다.\"는 유지하되, 앞서 추가한 과거 사실과 충돌하지 않도록 \"이후 재발 방지를 위해 72시간 이내 통지·신고 절차를 내재화하였다.\"로 보완 기재하세요."}, {"aspect": "minimal_change", "issue": "원본이 담고 있던 초기 취약 구성(비밀번호 SHA-1 저장, 외부 관리자페이지 ID/PW만으로 접속, 오입력 제한 미적용, 주민등록번호 복호화 다운로드 허용) 관련 사실이 삭제되어 사건 맥락이 바뀜.", "fix": "다음 문장을 비밀번호·접근통제 설명 직후에 추가하세요(권장 위치: \"계정은 개인별로 발급하고 비밀번호는 솔트가 포함된 일방향 암호화로 저장하며...\" 다음): \"초기 운영 시에는 개인정보취급자 비밀번호를 SHA-1 방식으로 저장하고 외부에서 관리자페이지에 아이디·비밀번호만으로 접속할 수 있도록 운영하였으며, 비밀번호 오입력 시 접근 제한 기능을 적용하지 않았고, 관리자 권한으로 주민등록번호를 복호화하여 엑셀 파일 형태로 내려받을 수 있도록 설정되어 있었다.\""}, {"aspect": "minimal_change", "issue": "원본의 관리 규모 수치(관련 개인정보 10,255건)가 누락됨.", "fix": "사건 경과 문단 끝에 다음 문장을 추가하세요: \"관리되던 관련 개인정보는 총 10,255건이었다.\""}, {"aspect": "minimal_change", "issue": "원본의 위반 조항 목록이 빈 배열로 변경되어 사건의 동일성이 훼손됨.", "fix": "violated_articles 값을 원본과 동일하게 복원하세요: \"violated_articles\": [\"개인정보 보호법 제24조제3항\", \"개인정보 보호법 시행령 제30조제1항\", \"개인정보 보호법 제34조제3항\"]"}]}}
{"case_id": "2024-219-623", "respondent": "온라인 수학 강의 홈페이지 운영사", "case_content": "온라인 수학 강의 홈페이지 운영사는 회원 가입, 수강 신청, 학습 지원 및 고객 상담을 위해 서비스 제공에 필요한 최소 항목(아이디, 성명, 연락수단(이메일 또는 휴대전화), 비밀번호)을 수집한다. 주소는 교재 배송 등 오프라인 제공이 필요한 경우에만 별도 입력받으며, 결제정보는 PG사를 통해 처리하고 카드번호 등 민감 결제정보는 자체 저장하지 않는다.\n수집 정보는 전송 시 TLS로 암호화하며, 저장 시 비밀번호는 솔트가 포함된 강한 일방향 해시(예: bcrypt/Argon2)로 보관하고, 연락처·주소 등 주요 식별 정보는 컬럼 단위 암호화한다. 암호화 키는 별도 키관리시스템에 분리 보관하고 접근 권한을 최소화한다. 백업 데이터는 암호화하여 분리 저장하고 복구 점검 주기를 운영한다.\n개인정보처리시스템 접근은 개인별 계정과 역할 기반 권한으로 제한하며, 외부 네트워크 접속 시 VPN과 다단계 인증을 적용한다. 권한은 업무 필요 최소 범위로 부여·변경·말소하고 정기적으로 점검한다. 세션 고정 및 탈취 방지를 위한 보안설정을 적용하고, 미사용 시 자동 로그아웃(세션 타임아웃)을 운영한다.\n접속기록에는 접속자 식별자, 접속 일시, 원격지 정보(IP), 수행 메뉴·업무, 처리 대상 정보주체(회원ID 등), 변경 전후 주요 필드, 성공/실패 여부를 포함하여 보관한다. 로그는 위·변조 방지 저장소에 보관하고 주기적으로 점검한다. 시스템 및 단말에는 최신 보안패치와 악성코드 방지 프로그램을 적용하며, 방화벽·침입탐지/차단 및 웹 취약점 점검을 정기 수행한다.\n게시판·자료실에는 개인정보 포함 파일 업로드를 제한하기 위해 패턴 기반(DLP) 검사와 사전 안내를 제공하고, 주민등록번호 등 고유식별정보가 감지되면 업로드를 차단한다. 공개 범위는 기본 비공개 또는 제한 공개로 설정하고, 운영자 검수 후 공개한다. 검색로봇 차단 등 노출 최소화 설정을 적용한다.\n개인정보의 보유기간은 가입 및 수강 관리 목적 달성 시점까지로 설정하며, 기간이 경과하거나 목적이 달성되면 지체 없이 복구 불가능한 방식으로 파기한다. 전자 파일은 안전한 영구 삭제, 종이는 파쇄·소각한다. 다른 법령에 따른 보존이 필요한 경우에는 암호화·접근통제를 적용하여 본 데이터와 분리 보관하고, 보존기간 종료 즉시 파기한다. 파기 및 분리보관 이력은 기록·관리한다.\n마케팅 정보 수신은 서비스 제공과 분리하여 선택 동의로 받으며, 동의하지 않아도 회원가입·수강에는 영향이 없다. 동의·철회, 열람·정정·삭제, 처리정지 요구 창구를 마련하고 온라인에서 간편하게 신청할 수 있도록 운영한다.\n클라우드·발송대행 등 위탁이 필요한 경우 계약서에 처리 범위, 재위탁 제한, 접근통제·암호화 등 안전조치, 사고 통지, 점검·감독, 반환·파기 절차를 포함한다. 수탁사 계정은 개인별로 발급하고 접속기록을 보관·점검한다.\n침해사고 대응 절차를 상시 운영하며, 필요 시 개인정보 노출 차단, 회수·삭제, 취약점 보완을 즉시 수행한다. 통지가 필요한 경우 정보주체에게 72시간 이내 서면·전자우편·문자 등으로 알리고, 연락처 확인이 어려운 경우 홈페이지에 게시하여 고지한다. 신고 대상에 해당하면 관계 기관에 지체 없이 신고하고, 피해 최소화 안내와 지원 절차를 제공한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 2}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "원사례의 사업(회원가입·수강관리 중심)과 핵심 사실(수집 항목, 2023-08-18 게시판 노출, 통지 일정, 2024-02-27 보관 상태)이 대폭 변경·삭제됨. 불필요한 확장(결제 PG 처리, 마케팅 선택동의, 광범위 위탁 관리 등)으로 시나리오 범위가 넓어짐.", "fix": "불필요한 확장 서술을 축소하고 원사례의 사실을 복원하세요. 구체적 수정: 1) 다음 문장을 교체: \"회원 가입, 수강 신청, 학습 지원 및 고객 상담을 위해 서비스 제공에 필요한 최소 항목(아이디, 성명, 연락수단(이메일 또는 휴대전화), 비밀번호)을 수집한다. 주소는 교재 배송 등 오프라인 제공이 필요한 경우에만 별도 입력받으며, 결제정보는 PG사를 통해 처리하고 카드번호 등 민감 결제정보는 자체 저장하지 않는다.\" → \"회원 가입·수강 관리를 위해 아이디, 성명, 전화번호, 주소, 이메일 주소, 비밀번호를 수집·보관한다.\" 2) 다음 문단을 삭제: \"마케팅 정보 수신은 서비스 제공과 분리하여 선택 동의로 받으며, 동의하지 않아도 회원가입·수강에는 영향이 없다. 동의·철회, 열람·정정·삭제, 처리정지 요구 창구를 마련하고 온라인에서 간편하게 신청할 수 있도록 운영한다.\" 3) 다음 문단을 삭제: \"클라우드·발송대행 등 위탁이 필요한 경우 계약서에 처리 범위, 재위탁 제한, 접근통제·암호화 등 안전조치, 사고 통지, 점검·감독, 반환·파기 절차를 포함한다. 수탁사 계정은 개인별로 발급하고 접속기록을 보관·점검한다.\""}, {"aspect": "minimal_change", "issue": "원사례의 침해사고 및 통지 일정(2023-08-18 게시, 당일 팝업 공지, 2024-03-05 이메일 통지)이 삭제되어 사건 맥락이 변조됨.", "fix": "사실관계를 복원하는 문장을 추가하세요. 예: 접속기록 또는 게시판 통제 단락 뒤에 다음 문장 삽입: \"2023년 8월 18일에는 게시판에 이용자 정보가 포함된 파일이 게시되어 화면에 공개되었고, 운영사는 같은 날 홈페이지 팝업으로 공지한 뒤 2024년 3월 5일 이메일을 통해 통지하였다.\""}, {"aspect": "minimal_change", "issue": "원사례의 보관 상태(2024-02-27 자료제출일 기준 계속 보관) 문구가 제거되어 시점 기반 사실이 누락됨.", "fix": "파기·보유 단락 말미에 다음 문장을 추가: \"2024년 2월 27일 자료제출일 기준으로 상기 개인정보를 계속 보관하고 있었다.\""}, {"aspect": "minimal_change", "issue": "원사례 수집 항목(아이디, 이름, 전화번호, 주소, 이메일)이 '연락수단(이메일 또는 휴대전화)'로 변경되어 데이터 모델이 불필요하게 축소됨.", "fix": "첫 번째 단락에서 수집 항목을 원사례에 맞게 명시하세요. 교체 예: \"서비스 제공에 필요한 최소 항목(아이디, 성명, 연락수단(이메일 또는 휴대전화), 비밀번호)을 수집한다.\" → \"회원 가입·수강 관리를 위해 아이디, 성명, 전화번호, 주소, 이메일 주소, 비밀번호를 수집·보관한다.\""}]}}
{"case_id": "2024-219-622", "respondent": "피심인", "case_content": "피심인은 웹과 앱을 통해 여행상품 예약 서비스를 운영하면서, 2024. 4. 12. 기준 이용자의 이름과 휴대전화번호 등 명의 정보를 수집하여 보관하였다. 피심인은 로그인 시 웹 서버에서 세션키를 생성해 이용자 ID와 매칭하는 방식을 사용했으며, 2023. 4. 17. 이벤트 직후 접속 증가 상황에서 동일 세션키가 다수 계정에 매칭되는 현상으로 일부 이용자가 다른 이용자의 이름과 휴대전화번호를 앱 화면에서 열람할 수 있었다. 피심인은 해당 시점에 이벤트를 중단하고 영향을 받은 이용자를 로그아웃 처리한 뒤, 중복 세션키 전달을 막도록 소스코드를 변경하고 같은 날(사고 인지 후 72시간 이내) 한국인터넷진흥원(KISA)에 유출 항목, 시점·경위, 피해 최소화 방법, 대응조치 및 신고 접수처 등의 내용을 포함하여 신고하였다. 아울러 내부관리계획을 보완하고, 세션키에 고유 난수 생성 및 만료·무효화 로직을 적용하여 계정 단위로 토큰을 바인딩하였으며, 개인정보처리시스템 접근권한을 재점검하고 접속기록 보관·위변조 방지, 취약점 점검 및 정기 교육 등 안전성 확보 조치를 이행하였다. 이후 피심인은 2023. 4. 19.까지 전자우편 및 앱 공지를 통해 해당 정보주체에게 유출된 항목, 시점·경위, 피해 최소화 방법, 대응조치 및 신고 접수처를 통지하고, 연락처 미확인 대상에 대해서는 홈페이지에 30일 이상 게시하였다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 2}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "신고 기관과 방식이 원문(개인정보 포털 신고)에서 KISA 신고로 변경되었고, 72시간 준수 문구와 상세 신고 항목 등 새로운 사실관계가 추가됨.", "fix": "문장을 원문대로 복원하세요. 예: “같은 날(사고 인지 후 72시간 이내) 한국인터넷진흥원(KISA)에 유출 항목, 시점·경위, 피해 최소화 방법, 대응조치 및 신고 접수처 등의 내용을 포함하여 신고하였다.”를 “같은 날 개인정보 포털에 신고하였다.”로 교체하고, 괄호 표현 ‘(사고 인지 후 72시간 이내)’ 및 상세 신고 항목 나열은 삭제하세요."}, {"aspect": "minimal_change", "issue": "통지 시기와 방법이 원문(2023. 5. 15. 및 2024. 4. 23. 이메일 통지)에서 2023. 4. 19.까지 이메일·앱 공지 및 홈페이지 30일 게시로 변경됨.", "fix": "마지막 통지 문장을 원문대로 복원하세요. 예: “이후 피심인은 2023. 4. 19.까지 전자우편 및 앱 공지를 통해 … 홈페이지에 30일 이상 게시하였다.”를 “이후 피심인은 2023. 5. 15. 및 2024. 4. 23. 이메일을 통해 이용자에게 관련 사실과 안내를 통지하였다.”로 교체하세요."}, {"aspect": "minimal_change", "issue": "원문에 없는 대규모 추가 통제(내부관리계획 보완, 토큰 바인딩, 권한 재점검, 접속기록 위변조 방지, 취약점 점검, 정기 교육 등)가 상세히 추가되어 불필요한 사실 변경 범위를 확장함.", "fix": "해당 추가 통제 나열을 삭제하여 원문의 최소 사실 범위로 복원하세요. 예: “아울러 내부관리계획을 보완하고, 세션키에 고유 난수 생성 및 만료·무효화 로직을 적용하여 계정 단위로 토큰을 바인딩하였으며, 개인정보처리시스템 접근권한을 재점검하고 접속기록 보관·위변조 방지, 취약점 점검 및 정기 교육 등 안전성 확보 조치를 이행하였다.” 문장 전체를 삭제하세요."}, {"aspect": "minimal_change", "issue": "원문에는 없던 ‘앱 공지’ 및 ‘연락처 미확인 대상 홈페이지 30일 게시’ 조치가 새로 추가됨.", "fix": "관련 표현을 삭제하세요. 예: “전자우편 및 앱 공지를 통해 … 연락처 미확인 대상에 대해서는 홈페이지에 30일 이상 게시하였다.” 중 ‘앱 공지’ 및 ‘홈페이지에 30일 이상 게시’ 부분을 삭제하세요."}, {"aspect": "minimal_change", "issue": "violate_articles 필드가 원문(4개 조항 명시)에서 빈 배열로 변경됨.", "fix": "원문 값을 복원하세요. 예: \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제48조의2\", \"개인정보 보호법 제39조의4\", \"개인정보 보호법 시행령 제48조의4\"] 로 교체하세요."}]}}
{"case_id": "2024-219-621", "respondent": "온라인 카페트 쇼핑몰 운영 사업자", "case_content": "온라인 카페트 쇼핑몰 운영 사업자는 2014-03-01부터 회원제 서비스를 운영한다. 2014-03-01부터 회원 정보를 개인정보처리시스템에 저장·보관하였으며, 휴대폰 번호, 유선번호, 이메일, 회사 이메일 및 비밀번호 등을 저장·보관하였다. 과거에는 비밀번호를 MD5 기반의 일방향 암호화로 데이터베이스에 저장했다고 설명했으나, 다크웹에 게시된 자료에서 평문 비밀번호 값이 확인되었다. 당시 외부 접속은 ID·비밀번호만으로 가능해 추가 인증 수단을 적용하지 않았고, 오픈소스 웹 방화벽을 사용하면서 접근 제한과 유출 탐지 정책을 지속적으로 업데이트하지 않았으며, 불법적 유출 시도를 탐지하기 위한 모니터링과 IP 재분석 기능 운영이 제한적으로 이루어졌다.\n현재는 회원 가입과 주문 처리에 필요한 최소 항목(아이디, 비밀번호, 연락수단[휴대전화 또는 이메일], 배송지 정보[주문 시])만 수집한다. 과거에는 휴대폰 번호, 유선번호, 이메일, 회사 이메일 및 비밀번호 등을 저장·보관하였으며, 현재 유선번호·회사 이메일 등 추가 정보는 선택 항목으로 분리하여 동의를 받는다. 수집 목적, 보유기간 및 동의 거부권 등 주요 사항을 가입 화면에서 안내한다.\n비밀번호는 개별 솔트를 적용한 bcrypt/Argon2 등 일방향 암호화로 저장하고, 연락처·주소·이메일 등 개인정보는 컬럼 단위로 암호화한다. 전송 구간은 TLS를 적용하며, 암호화 키는 별도 키 관리 시스템에 분리 보관하고 접근을 제한한다. 개인정보처리시스템 접근 권한은 직무별 최소권한 원칙에 따라 개인별 계정으로 부여·변경·말소하며, 관리자 및 외부 접속에는 VPN, 지정 IP, 다단계 인증을 적용한다. 비밀번호 정책, 계정 잠금, 세션 타임아웃을 운영한다. 웹 방화벽과 침입탐지 기능을 운영하고 서명·정책을 주기적으로 업데이트한다. 정기 취약점 점검과 패치 관리, 악성코드 방지 프로그램 설치·갱신, 구성 변경 시 보안 검토 절차를 적용한다. 개인정보처리시스템 및 보안장비의 접속기록과 처리내역을 위변조 방지 형태로 보관·점검한다.\n보유기간은 서비스 목적에 필요한 기간으로 설정하고, 회원 탈퇴 또는 기간 만료 시 전자파일은 복구 불가능한 방식으로 영구 삭제하며, 서면은 파쇄 또는 소각한다. 다른 법령에 따른 거래기록 등은 별도 저장소에 분리 보관하고 접근 권한을 제한한다. 클라우드 인프라 운영, 알림 발송, 배송 등 일부 업무는 수탁사에 위탁하며, 계약서에 처리 범위, 재위탁 제한, 보안 통제, 사고 통지, 접속기록 보관, 반환·파기 절차, 점검·감독을 포함하고 이행 여부를 정기적으로 확인한다. 마케팅 정보 수신은 선택 동의로 분리하고, 동의한 경우에 한해 관련 데이터를 별도 저장소에 분리 보관하며 언제든지 철회할 수 있다. 정보주체는 마이페이지와 고객센터를 통해 열람·정정·삭제·처리정지·동의 철회를 요청할 수 있으며, 요청 이력과 처리 결과를 기록한다.\n침해사고 대응체계를 마련하여 이상 징후 탐지 시 즉시 격리, 원인 분석, 비밀번호 초기화 등 조치를 시행하고, 등록된 연락처로 지체 없이, 늦어도 72시간 이내에 통지한다. 또한 1천명 이상 유출, 민감정보·고유식별정보 유출 또는 외부의 불법적 접근에 의한 유출 등에 해당하는 경우에는 보호위원회 또는 한국인터넷진흥원에 72시간 이내에 신고한다. 연락처 확인이 어려운 경우에는 홈페이지 공지로 대체한다. 유출 인지 후에는 2023-02-10 홈페이지 팝업 공지를 게시하고, 2023-02-22 14:08 이메일 통지를 시행하였다. 통지는 다크웹에 게시된 이메일 주소를 기준으로 발송되었으며 일부 주소는 오류나 중복으로 처리되었다.\n개인정보 처리방침과 보호책임자 연락처를 홈페이지에 상시 공개하고, 개인정보취급자에게 정기 보안 교육을 실시한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "유출 통지 관련 72시간 기준 및 통지 수단이 불명확하고, 다크웹에 게시된 이메일 주소를 기준으로 통지했다는 표현은 법·시행령상 ‘연락처를 알 수 없는 경우’에 해당하는지 불명확하여 통지 요건 충족 여부가 모호함.", "fix": "다음 문장을 교체하여 72시간 이내 1차 통지와 통지 수단을 명확히 하십시오.\n- 교체 전: \"유출 인지 후에는 2023-02-10 홈페이지 팝업 공지를 게시하고, 2023-02-22 14:08 이메일 통지를 시행하였다. 통지는 다크웹에 게시된 이메일 주소를 기준으로 발송되었으며 일부 주소는 오류나 중복으로 처리되었다.\"\n- 교체 후(예시): \"유출 인지 즉시(인지 시점부터 72시간 이내) 회원 DB에 등록된 연락처(이메일/SMS)로 1차 통지를 완료하였고, 연락처 확인이 어려운 계정에 대해서는 홈페이지 공지(최소 30일)로 대체하였다. 이후 2023-02-22 14:08에는 추가 확인된 대상자에게 후속 안내 메일을 발송하였다. 다크웹 게시 자료는 유출 범위 확인을 위한 참고 용도로만 사용하였으며, 통지는 회원 DB에 등록된 연락처를 기준으로 진행하였다.\""}, {"aspect": "legality", "issue": "업무 위탁 시 정보주체에 대한 수탁자·위탁업무 공개 의무(시행령 제28조제2항~제3항)가 ‘계약서 기재’만으로는 명시되지 않아 공개 요건 충족이 불명확함.", "fix": "위탁 문단 말미에 공개 방법을 명시하는 문장을 추가하십시오.\n- 추가 문장(예시): \"위탁하는 업무의 내용과 수탁자는 개인정보 처리방침 및 홈페이지에 지속적으로 게재하여 정보주체가 언제든지 확인할 수 있도록 한다.\""}, {"aspect": "legality", "issue": "개인정보 처리방침 공개 항목(시행령 제31조제1항) 중 위탁 현황, 제3자 제공(해당 시), 국외 이전(해당 시), 안전성 확보조치 등 포함 여부가 문면상 명확하지 않음.", "fix": "처리방침 공개 문장에 포함 항목을 구체화하는 문장을 보완하십시오.\n- 추가 문장(예시): \"처리방침에는 처리 목적, 항목, 보유기간, 제3자 제공 현황(해당 시), 국외 이전 여부 및 이전 관련 사항(해당 시), 안전성 확보 조치, 위탁 현황과 수탁자, 쿠키 등 자동수집 장치 운영에 관한 사항을 포함하여 홈페이지에 상시 공개한다.\""}]}}
{"case_id": "2024-220-644", "respondent": "피심인(여행 예약 서비스 제공자)", "case_content": "피심인(여행 예약 서비스 제공자)은 LPOINT 통합인증과 자체 홈페이지 로그인 서버를 표준 OIDC로 연동하여 고객이 동일 계정으로 예약 서비스를 이용하도록 운영한다. 로그인 시 통합인증 서버로부터 최소 범위의 식별자(sub, 고객코드)만 수신하며, 토큰 서명·발급자·대상(aud)·만료를 검증한 후에만 세션을 생성한다. 서버 간 통신은 TLS와 상호 인증서 검증을 사용하고, 인증서 갱신·만료를 중앙에서 동기화·자동화하며 불일치·유효성 오류 발생 시 연결을 차단한다. 고객코드 등 핵심 키는 NULL·중복을 허용하지 않으며 유효성 검사를 통과하지 못하면 저장이나 조회를 수행하지 않는다.\n예약 조회는 토큰의 주체 식별자와 고객계정에 매핑된 키를 기반으로만 수행되며, 저장 프로시저에서 예약 소유 여부를 이중 검증한다. UI/API는 본인 예약만 반환하고, 여권번호·카드번호 등은 화면에 마스킹하여 표시하며 전체 보기 필요 시 추가 본인확인을 거친다.\n수집 항목은 예약 이행에 필요한 최소 항목(성명, 영문이름, 생년월일, 국적, 연락수단, 이메일, 휴대전화번호, 여권번호·만료일·발행국, 예약번호, 현지 연락처, 항공사 마일리지 번호, 운임·결제 관련 정보)으로 한정한다. 카드정보는 결제대행사를 통해 토큰화하여 저장하며, 당사는 마지막 4자리와 승인내역만 보관한다. 여권번호 등 고유식별정보와 연락처는 저장 시 강력한 암호화로 보호하고, 암호화 키는 분리된 KMS에서 관리한다. 전송 데이터는 암호화 채널을 사용한다.\n접근 권한은 역할 기반으로 최소화하고 계정은 개인별로 발급하며, 지원·개발 등 업무별 접근을 분리한다. 서버·애플리케이션 접속기록과 조회·전송 이력을 위변조 방지 기능으로 보관·점검하고, 이상 징후를 모니터링한다. 구성 변경과 배포는 사전 테스트와 승인 절차를 거치며, 복수 로그인 서버 운영 시 인증서·설정 상태를 주기적으로 검증한다.\n예약 및 결제 관련 데이터는 목적 달성 및 정산·분쟁 대응에 필요한 기간 동안만 보관하고, 기간 경과 시 복구 불가능한 방식으로 파기하며, 다른 법령에 따른 보존 대상은 분리 보관한다. 결제 처리·알림 전송 등 필요한 업무는 계약에 처리 범위, 보안 통제, 재위탁 제한, 사고 통지, 반환·파기 절차를 포함하여 위탁하고, 정기 점검으로 이행 상태를 확인한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "여권번호 등 고유식별정보 처리를 하면서 제24조제1항에 따른 별도 동의 및 공개 고지(시행령 제17조 제3항 제2호 나목 등) 절차가 case_content에 명시되어 있지 않음. 또한 위탁 관련하여 정보주체 공개 의무(시행령 제28조 제2항)가 구체적으로 기재되어 있지 않음.", "fix": "case_content에 다음 문장을 추가:\n- \"여권번호 등 고유식별정보는 법 제24조제1항에 따른 별도 동의 항목으로 분리하여 고지·동의를 받으며, 동의서에는 수집·이용 목적, 보유·이용 기간, 항목(여권번호·만료일·발행국), 동의 거부권 및 거부 시 불이익을 명확히 표시한다(시행령 제17조 제3항).\"\n- \"개인정보 수집·이용 시 법 제15조제2항에 따른 목적, 수집 항목, 보유·이용 기간, 동의 거부권 및 불이익을 사전에 알리고 동의를 받는다.\"\n- \"결제대행사 등 수탁자에 대한 위탁 사실과 수탁자명, 위탁업무 범위를 홈페이지에 상시 공개하고 변경 시 30일 이상 게시한다(시행령 제28조 제2항~제5항).\""}, {"aspect": "minimal_change", "issue": "원문 사업 시나리오의 식별자인 \"로그인 서버 #2\" 표기가 제거되어 불필요한 서술 변경이 발생함.", "fix": "case_content의 \"자체 홈페이지 로그인 서버\"를 \"자체 홈페이지 로그인 서버(#2)\"로 수정."}]}}
{"case_id": "2024-220-643", "respondent": "피심인", "case_content": "피심인은 2023년 행사 운영을 수탁사에 위탁하였다. 사전등록 단계에서 행사 진행에 필요한 최소 항목(성명, 휴대전화번호)만 수집하며, 수집 목적, 보관 기간, 권리행사 방법을 고지한다. 마케팅 정보 수신은 별도 선택 항목으로 분리하며, 미동의에 따른 서비스 불이익은 없다.\n\n수탁사에는 위탁 수행에 필요한 데이터만 암호화 채널로 제공하고, 저장 데이터는 암호화한다. 접근 권한은 역할 기반으로 최소화하며, 담당자별 개별 계정과 다중인증, IP 제한을 적용한다. 위탁 계약에는 처리 범위, 재위탁 제한, 사고 통지, 보안 통제, 접속기록 보관, 반환·파기 절차 및 정기 점검·교육을 포함하고, 수행 현황을 정기적으로 점검한다.\n\n사전등록자에게는 2023-02-16부터 알림톡으로 입장티켓 URL을 발송하되, URL에는 예측 불가능한 무작위 기반의 단기 유효 1회용 서명 토큰만 포함한다. 순차번호 등 추정 가능한 식별자는 사용하지 않으며, 토큰은 단말·세션에 연동되어 1회 검증 후 즉시 폐기된다. 상세페이지는 TLS로 제공되고, 접속 시 등록된 휴대전화로 전송되는 1회용 인증번호를 통한 본인확인을 거쳐야 열람된다. 인증 전에는 이름·휴대전화번호를 부분 마스킹으로만 표시하고, 인증 후에도 필요한 범위의 정보만 노출한다. 자동 대량 조회 방지를 위해 속도 제한, 시도 횟수 제한 및 비정상 트래픽 차단을 적용한다.\n\n페이지 및 관리 콘솔의 접속기록(접속일시, IP, 사용자·단말 식별 정보, 처리내역)은 위변조 방지 저장소에 분리 보관하고 정기 점검하며, 필요한 기간 보존 후 삭제한다. 악성코드 방지 프로그램을 주기적으로 갱신하고, 주요 시스템 계정과 암호키는 주기적으로 교체한다.\n\n행사 종료 후에는 정해진 보존기간(예: 종료 후 7일) 내 본문 데이터와 첨부 자료를 복구 불가능한 방식으로 파기하고, 백업본도 주기적으로 영구 삭제한다. 파기 결과와 일시는 기록하며, 다른 법령에 따라 보존이 필요한 경우에는 본문 데이터와 분리 보관한다.\n\n침해사고 대응 절차를 마련하여 토큰 일괄 폐기, 페이지 차단, 노출 항목 추가 마스킹, 비밀번호·키 교체 등 긴급조치를 실시하고, 정보주체 통지와 지정 전문기관 또는 관계 기관 신고를 지체 없이 수행한다. 통지에는 유출 항목, 시점·경위, 피해 최소화 방법, 접수 창구를 포함하며, 사고 대응 기록을 보관한다.\n\n수집 정보는 행사 안내 및 입장 확인 목적에 한해 이용하며, 목적 외 이용·제공은 하지 않는다. 정보주체의 열람, 정정·삭제, 처리정지 및 동의 철회 요구를 위한 연락 창구를 운영하고, 요청 시 정해진 절차에 따라 처리한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 1}, "pass": false, "problems": [{"aspect": "legality", "issue": "유출 통지·신고의 기한과 대상 기관이 모호합니다. 영 제39조·제40조는 72시간 이내 정보주체 통지(법 제34조) 및 보호위원회 또는 한국인터넷진흥원 신고를 요구합니다.", "fix": "현 문장: \"침해사고 대응 절차를 마련하여 ... 정보주체 통지와 지정 전문기관 또는 관계 기관 신고를 지체 없이 수행한다.\"\n수정: \"침해사고 대응 절차를 마련하여 토큰 일괄 폐기, 페이지 차단, 노출 항목 추가 마스킹, 비밀번호·키 교체 등 긴급조치를 실시하고, 법 제34조 및 영 제39조·제40조에 따라 72시간 이내에 정보주체 통지와 보호위원회 또는 한국인터넷진흥원 신고를 수행한다. 통지에는 유출 항목, 시점·경위, 피해 최소화 방법, 접수 창구를 포함하며, 추가로 확인되는 내용은 확인 즉시 추가 통지·신고한다. 사고 대응 기록을 보관한다.\""}, {"aspect": "legality", "issue": "업무위탁 공개 의무(법 제26조제2항, 영 제28조제2항~제5항)가 서술되어 있지 않습니다.", "fix": "아래 문단 끝에 한 문장 추가:\n추가: \"위탁자는 영 제28조에 따라 인터넷 홈페이지 등에 위탁하는 업무의 내용과 수탁자(상호)를 지속적으로 공개하고, 변경 시에도 지체 없이 갱신한다.\""}, {"aspect": "legality", "issue": "동의 고지 항목이 일부 불명확합니다. 법 제15조제2항은 수집·이용 목적, 항목, 보유·이용 기간 외에 동의 거부권 및 불이익 내용을 고지하도록 요구합니다(영 제17조).", "fix": "현 문장: \"사전등록 단계에서 행사 진행에 필요한 최소 항목(성명, 휴대전화번호)만 수집하며, 수집 목적, 보관 기간, 권리행사 방법을 고지한다.\"\n수정: \"사전등록 단계에서 행사 진행에 필요한 최소 항목(성명, 휴대전화번호)만 수집하며, 수집·이용 목적, 보유·이용 기간, 동의 거부권 및 동의 거부에 따른 불이익 유무, 권리행사 방법을 고지한다. (계약 이행을 법적 근거로 처리하는 경우 그 근거(법 제15조제1항제4호)도 함께 명시한다.)\"\n또한 마케팅 동의 문단 뒤에 다음 문장 추가:\n추가: \"마케팅 목적 동의는 선택사항임을 표시하고, 동의 거부에 따른 불이익이 없음을 명확히 알린다.\""}, {"aspect": "minimal_change", "issue": "원사실(순차코드 포함 URL, 추가 인증 미적용, 평문 노출, 상세 로그 미보존, 개별 통지 보류 등)이 대폭 변경·삭제되어 시나리오의 동일성이 훼손되었습니다.", "fix": "원 사실을 복원하고, 개선사항은 '재발 방지' 또는 '향후' 조치로 구분해 적시하세요.\n- 첫 문단 뒤에 다음 문단 추가:\n추가: \"수탁사는 2023-02-16부터 사전등록자에게 숫자 6자리 개인코드(200001부터 순차 부여)가 포함된 입장티켓 URL을 발송하였고, 해당 코드를 통해 상세페이지에 접속하면 이름과 휴대전화번호가 평문으로 표시되었다. 초기에는 로그인 등 추가 인증이나 토큰 검증 절차 없이 열람이 가능하였다. 페이지 열람과 관련한 상세 로그는 별도로 저장·보존되지 않아 외부 조회 건수 집계가 어려웠다.\"\n- 알림톡/URL 단락 교체:\n기존: \"사전등록자에게는 2023-02-16부터 알림톡으로 입장티켓 URL을 발송하되, URL에는 예측 불가능한 ... 1회용 서명 토큰만 포함한다. ... 접속 시 ... 1회용 인증번호를 통한 본인확인을 거쳐야 열람된다.\"\n수정: \"사전등록자에게는 2023-02-16부터 알림톡으로 입장티켓 URL을 발송하였다. 당시 URL에는 숫자 6자리 개인코드(200001부터 순차 부여)가 포함되었고, 추가 인증 없이 열람이 가능하였다. 재발 방지를 위해 향후 발송 URL에는 예측 불가능한 무작위 기반의 단기 유효 1회용 서명 토큰만 포함하고, 순차번호 등 추정 가능한 식별자는 사용하지 않는다. 상세페이지는 TLS로 제공하며, 접속 시 등록된 휴대전화로 전송되는 1회용 인증번호를 통한 본인확인을 거쳐야 열람되도록 개선한다.\"\n- 로그 문단 앞에 한 문장 추가:\n추가: \"당시 페이지 열람 관련 상세 접속기록은 별도로 보존하지 않았다.\"\n- 파기 문단 교체:\n기존: \"행사 종료 후에는 정해진 보존기간(예: 종료 후 7일) 내 ... 파기하고 ...\"\n수정: \"행사 종료에 따라 2023-02-20에 수집한 개인정보를 복구 불가능한 방식으로 파기하였다. 재발 방지를 위해 향후에는 최소 보존기간을 설정(예: 종료 후 7일)하여 업무 확인 후 본문 및 백업본을 영구 삭제하고, 파기 결과와 일시를 기록한다.\"\n- 통지 관련 사실 보존 및 개선 분리:\n현 문장 뒤에 다음 두 문장을 연이어 배치:\n추가(사실): \"유출 인지 후 수탁사는 페이지 내 개인정보 항목을 마스킹 처리하고 한국인터넷진흥원에 신고하였으며, 피심인은 당시 개별 정보주체 통지를 보류하였다.\"\n추가(개선): \"향후에는 법 제34조 및 영 제39조·제40조에 따라 72시간 이내에 정보주체 통지 및 보호위원회 또는 한국인터넷진흥원 신고를 이행한다.\""}]}}
{"case_id": "2024-220-642", "respondent": "피심인", "case_content": "피심인은 주관사의 위탁을 받아 행사 사전등록자의 이름과 휴대전화번호 등 최소 항목을 수집하여 입장 확인과 안내 발송 목적으로만 처리한다. 신청 화면에 수집 목적, 보유기간, 위탁 사실을 명확히 알리고 동의를 받은 후, 정보는 암호화된 전송 구간을 통해 수집되어 데이터베이스와 백업에 암호화된 상태로 저장되며, 암호키는 분리 관리된다. 알림톡에는 개인정보를 포함하지 않고, 무작위 난수 기반의 단일 사용 토큰이 포함된 URL만 전송한다. 토큰은 충분한 길이로 생성되고 유효기간을 짧게 설정하며, 만료 또는 사용 즉시 무효화된다. URL 접속 시 토큰만으로는 정보가 표시되지 않으며, 알림톡·문자 기반 일회용 인증번호(OTP) 또는 휴대전화번호 일부 입력과 추가 인증을 요구하여 본인 여부를 확인한다. 웹 페이지에는 입장에 필요한 최소 정보만 마스킹 형태(예: 이름 일부, 전화번호 일부)로 표시하고, 전체 번호 등 불필요한 정보는 화면에 표시하지 않는다. 토큰과 인증 이력은 본 데이터와 분리된 저장소에 보관하고, 반복 시도 차단, 요청 속도 제한, 이상 징후 탐지 등 접근통제를 적용한다. 개인정보 접근 권한은 업무상 필요한 담당자에게만 개인별 계정으로 부여하며, 권한 부여·변경·말소 기록과 시스템 접속기록을 보관하고 위·변조 방지 조치를 적용한다. 개발·테스트와 운영 환경은 분리하며, 테스트에는 더미 데이터를 사용한다. 악성코드 대비 프로그램을 운영하고, 웹 취약점 점검 및 주요 구성요소 보안 패치를 주기적으로 수행한다. 주관사와의 위탁 계약서에는 처리 범위, 재위탁 제한, 암호화·접근통제 등 안전조치, 사고 통지, 반환·파기 절차, 점검·감독을 포함하고, 정기 점검으로 이행 상태를 확인한다. 보유기간은 행사 종료 후 정산 및 민원 대응을 위한 최소 기간으로 설정하며, 기간 경과 시 전자 파일은 복구 불가능한 방식으로 영구 삭제하고, 로그는 분리 보관 후 파기한다. 파기 내역과 접근·삭제 이력은 기록으로 남긴다. 침해사고 대응 절차를 마련하여 필요 시 신속한 통지 및 신고, 추가 피해 방지 조치를 수행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "원문에는 행사 종료 후 구체적 파기 일자(2023. 2. 20.)가 있었으나, 재작성본은 일반적 보유기간 기술로 대체되어 불필요하게 사실적 맥락이 희석됨.", "fix": "보유·파기 문단에 구체 일자를 복원하여 사실관계를 유지하십시오. 예: \"보유기간은 행사 종료 후 정산 및 민원 대응을 위한 최소 기간으로 설정하며, 기간 경과 시 전자 파일은 복구 불가능한 방식으로 영구 삭제한다. 본 건에서는 행사 종료 후 2023. 2. 20.에 전자 파일을 복구 불가능한 방식으로 영구 삭제하였다.\""}, {"aspect": "minimal_change", "issue": "원문에는 사고 인지 후 내부 보고와 주관사 통지 수행 사실이 명시되어 있으나, 재작성본은 일반적 '침해사고 대응 절차'로만 기술되어 구체 사실이 생략됨.", "fix": "침해사고 대응 문장에 내부 보고 및 주관사 통지의 구체적 수행을 명시하십시오. 예: \"침해사고 대응 절차를 마련하여 필요 시 신속한 통지 및 신고, 추가 피해 방지 조치를 수행하며, 사고 인지 시 내부 보고 및 주관사 통지를 즉시 수행한다.\""}]}}
{"case_id": "2023-011-116", "respondent": "㈜자비스앤빌런즈", "case_content": "㈜자비스앤빌런즈는 삼쩜삼(3o3.co.kr) 서비스를 통해 종합소득세 환급 조회·신청 및 신고 대행을 제공한다. 계정 생성 단계에서는 서비스 운영에 필요한 최소 항목(성명, 연락처, 계정 식별정보)만 수집하며, 홈페이지 회원 가입은 주민등록번호 없이 가능하도록 제공한다. 환급 신고 대행을 요청한 경우에 한해 신고서 작성·제출 등 관련 절차에 필요한 범위에서 주민등록번호, 소득정보, 전자신고 결과, 연말정산 간소화 소득·세액공제 자료, 지급명세서 등을 수집·이용한다. 장애인 여부, 장애인 전용 보장성 보험료, 특수교육비 등 민감정보는 공제 요건 확인에 필요한 경우에 한해 다른 개인정보와 구분하여 별도 동의를 받아 수집하며, 동의하지 않아도 기본 서비스 이용에 제한이 없도록 한다.\n\n추가 검토 또는 신고 대행을 위해 세무대리인에게 업무를 위탁하는 경우, 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 반환·파기 절차를 포함한 계약을 체결한다. 세무대리인에게 제공되는 정보는 업무 수행에 필요한 항목으로 한정하고 암호화된 채널로 전송한다. 세무대리인 및 수탁사에는 개인별 계정을 발급하고 최소권한 원칙과 이중 인증을 적용하며, 접속기록을 보관·점검한다. 위탁 현황은 홈페이지에 공개하고 정기 점검과 교육을 수행한다.\n\n주민등록번호와 신고 관련 증빙은 저장 시 강한 암호화로 보호하고, 암호화 키는 별도 시스템에서 분리 관리한다. 화면 표시·문서 출력 시 주민등록번호 등은 마스킹하며, 파일 업로드 시 주민등록번호 패턴을 자동 탐지해 불필요한 정보가 포함되면 접수를 차단하거나 가림을 안내한다. 개인정보처리시스템에는 접근통제, 전송구간 암호화, 악성코드 예방 조치를 적용하고, 시스템 및 수탁사 접속기록은 위·변조 방지 조치와 함께 1년 이상 보관한다. 접근 권한은 역할 기반으로 부여·변경·말소를 관리한다.\n\n보존 기간은 목적별로 설정한다. 계정 정보는 회원 탈퇴 시까지, 환급 신고 자료는 정산 완료 후 관계 법령상 보존 의무가 있는 기간 동안만 보관한다. 법적 보존으로 즉시 파기할 수 없는 정보는 별도 저장소에 분리 보관하고 접근을 제한한다. 보존 기간이 종료되면 전자파일은 복구 불가능한 방법으로 삭제하고, 그 밖의 매체는 파쇄 또는 소각한다. 장기 미이용자 정보는 내부 기준에 따라 분리 보관 후 파기하며, 분리·파기 이력을 기록한다.\n\n이용자는 홈페이지를 통해 자신의 개인정보에 대한 열람, 전송, 정정·삭제, 처리정지, 동의 철회를 요청할 수 있으며, 본인 확인 후 정해진 절차에 따라 처리한다. 추가 이용 또는 제3자 제공이 필요한 경우에는 목적의 관련성, 정보주체의 합리적 기대, 비식별·암호화 등 안전조치 가능성 등을 고려하여 판단하고, 필요한 경우 별도의 동의를 받아 진행한다.\n\n개인정보 처리방침에는 수집·이용 목적과 항목, 보유 및 이용 기간, 제3자 제공 및 위탁 현황, 파기 절차·방법, 안전성 확보조치, 정보주체 권리행사 방법, 개인정보 보호책임자 및 문의처, 자동 수집 장치 운영 현황 등을 구체적으로 기재하여 홈페이지에 상시 공개한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": [{"aspect": "legality", "issue": "주민등록번호 처리의 법적 근거가 명시되어 있지 않아 법 제24조의2(주민등록번호 처리 제한) 충족 여부가 문면상 불분명함.", "fix": "환급 신고 대행을 위한 주민등록번호 처리가 법령상 요구되는 경우임을 명시하세요. 예: 해당 문단에 다음 문장을 추가: \"주민등록번호 처리는 소득세법, 국세기본법 등 관계 법령에서 구체적으로 요구되는 경우에 한정하며, 해당 법령상 의무 이행 범위 내에서만 처리한다.\""}, {"aspect": "legality", "issue": "세무대리인에 대한 개인정보 제공이 전부 '위탁'으로만 서술되어 있어, 세무대리인이 독립된 개인정보처리자인 경우에 적용될 제3자 제공 절차(법 제17조)가 누락될 소지가 있음.", "fix": "세무대리인의 지위에 따라 위탁 또는 제3자 제공을 구분 처리함을 명시하세요. 예: 위탁 문단 말미에 다음 문장을 추가: \"세무대리인이 독립된 판단으로 업무를 수행하는 경우에는 제3자 제공으로 보아 제17조에 따른 고지사항(제공받는 자, 목적, 항목, 보유·이용 기간, 동의 거부권 및 불이익)을 알리고 동의를 받은 후 제공한다.\""}, {"aspect": "legality", "issue": "개인정보 처리방침 항목에 법 제30조 제1항 제3의2호(법적 보존 시 보존 근거 및 보존 항목)의 명시가 구체 문구로 드러나지 않음.", "fix": "처리방침 서술에 법적 보존의 근거 및 항목 기재를 명시하세요. 예: 마지막 문단에 다음 문구를 보완: \"특히 법령에 따라 보존하여야 하는 경우에는 그 보존 근거와 보존하는 개인정보 항목을 포함하여 기재한다.\""}]}}
{"case_id": "2022-014-104", "respondent": "Google Limited Liability Company", "case_content": "Google Limited Liability Company는 AdSense, AdMob, AdManager, Google 애널리틱스 등을 제3자 웹사이트·앱에 제공한다. 태그/SDK는 로드 전에 이용자에게 다음 항목을 각각 분리하여 선택할 수 있는 화면을 제공한다: 개인 맞춤 광고 및 프로파일링, 측정·분석용 쿠키/식별자 사용, 제3자 쿠키·크로스사이트 추적, 국외 이전. 선택하지 않아도 사이트·앱 이용에는 제한이 없다. 모바일 OS의 광고식별자 제한 및 브라우저의 쿠키 거부 신호를 준수한다.\n수집 항목은 목적에 필요한 최소로 한정하며, 페이지/스크린 URL, 참조 URL, 이벤트 유형(노출·클릭·전환), 수집 시각, 브라우저/OS 유형, 광고 슬롯 식별자, 제한된 수준의 네트워크 정보만 처리한다. IP 주소는 도시 등 대략적 위치 산출 후 즉시 마스킹 또는 삭제한다. 로그인 이용자의 경우에도 이용자가 ‘웹 및 앱 활동’과 ‘광고 개인설정’을 모두 활성화한 때에 한해 계정 정보와 결합하며, 그 외에는 가명 식별자로 분리 저장하고 계정과 결합하지 않는다.\n데이터는 전송·저장 시 암호화하고, 접근 권한은 역할 기반으로 최소 부여한다. 담당자별 계정을 사용하며 다중인증을 적용하고, 접근·처리 내역을 기록·점검한다. 악성코드 방지, 취약점 점검, 물리적 통제 등 내부관리계획에 따른 안전조치를 운영한다.\n보관기간은 목적별로 사전에 고지하며 기본 보유기간을 단기로 설정하고 자동 삭제한다. 이용자가 동의를 철회하거나 활동 기록 삭제를 요청하면 관련 식별자 연계 데이터를 지체 없이 복구 불가능한 방식으로 삭제하고, 법령상 보존이 필요한 경우에는 다른 정보와 분리 보관한다.\n광고주·퍼블리셔에는 개인을 식별할 수 없도록 집계·통계 형태로만 제공하며, 광고 송출·측정 인프라 운영을 위한 수탁사에는 계약으로 처리 범위, 재위탁 제한, 보안조치, 사고 통지, 반환·파기를 규정하고 정기 점검한다.\n국외 이전이 필요한 경우 이전 항목, 이전 국가·시기·방법, 이전받는 자, 이용 목적 및 보유기간, 거부 방법·효과를 동의 화면과 처리방침에 알리고 별도로 동의를 받는다. 변경 시에는 사전 고지 후 재동의를 받는다.\n이용자는 전용 화면에서 광고 개인설정 해제, 쿠키/식별자 설정 변경, 열람·전송·정정·삭제·처리정지 요청을 할 수 있으며, 국내대리인 및 문의 창구를 통해 권리 행사를 지원한다. 만 14세 미만 아동 대상 서비스 환경에서는 개인 맞춤 광고 수집을 하지 않거나 법정대리인 동의 후 처리한다.\n목적 외 추가 이용이 필요한 경우에는 목적 관련성, 이용자의 예측 가능성, 정보주체 이익 침해 여부, 가명처리·암호화 등 안전성 조치를 기준으로 검토하며, 기준에 부합하지 않으면 별도 동의를 받아 처리한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "동의 화면에서 일반 수집·이용(광고 개인화, 측정·분석, 제3자 쿠키/크로스사이트 추적)에 대해 법 제15조제2항 및 시행령 제17조가 요구하는 고지 항목(수집·이용 목적, 수집 항목, 보유·이용 기간, 동의 거부권 및 불이익)을 명시적으로 제시한다는 점이 본문에 분명히 나타나지 않음. 국외 이전에 대해서만 해당 항목들이 명시됨.", "fix": "동의 UI 설명 직후 다음 문구를 추가: \"각 항목별 동의 옆에 다음 사항을 요약 표시하고 상세 보기로 전문을 제공합니다: 수집·이용 목적, 수집 항목, 보유·이용 기간, 동의 거부권 및 거부에 따른 불이익(없음). 동의 사항은 각각 개별 체크박스로 구분하여 이용자가 명확히 표시(체크)하도록 하며, 서면·전자적 방법으로 동의 내역을 보관합니다. 동의 내용 변경 시에는 변경 사항을 사전 고지하고 재동의를 받습니다.\""}, {"aspect": "minimal_change", "issue": "원문에 기재된 구체적 쿠키/식별자 예시(DSID, SID, IDE, ANID, _gads, _gac, ADID/IDFA)가 REWRITTEN에서 누락되어 불필요하게 시나리오의 구체성이 감소함.", "fix": "수집 항목 기술 부분에 다음을 보완: \"쿠키 및 모바일 식별자는 예시적으로 DSID, SID, IDE, ANID, _gads, _gac, ADID/IDFA 등을 사용하며, 웹 픽셀/스크립트 또는 앱 SDK 호출을 통해 전송됩니다.\""}]}}
{"case_id": "2021-0071", "respondent": "00국제개발협력원", "case_content": "00국제개발협력원은 강의에 따른 지원금 제공을 위해 2011.6.21.~2021.9.17. 동안 개발도상국 교수 1,909명의 이름, 아이디, 비밀번호, 전화번호, 성별, 생년월일, 이메일, 직업, 국가, 소속기관, 직책, 전공, 닉네임 등의 정보를 회원가입을 통해 수집하여 홈페이지 데이터베이스에 저장·관리하였다.\n\n비밀번호는 솔트를 포함한 일방향 암호화(bcrypt, PBKDF2 등 검증된 알고리즘)로 저장하고, 인증정보는 분리 보관하였다. 관리자 페이지는 지정 IP/VPN 및 다단계 인증을 적용하여 정당한 권한을 가진 자만 접근하도록 운영하였다. 내부관리계획에는 접속기록 1년 이상 보관, 월 1회 이상 점검, 위·변조 방지 장치 적용 등 개정사항을 반영하여 운영하였다.\n\n2021.9.27. 미상의 공격자가 제3자 라이브러리의 신규 취약점을 악용한 SQL 인젝션 시도를 하여 일부 데이터 조회가 발생하였다. 일부 자료가 외부에 게시되었으나 비밀번호 등 인증정보는 솔트 포함 일방향 암호화되어 원문 노출은 없었고, 탐지 즉시 차단·격리 및 포렌식을 수행하였다.\n\n유출 사실 인지 후 72시간 이내에 정보주체에게 유출된 항목, 유출 시점과 경위, 정보주체가 취할 수 있는 조치, 대응조치 및 피해구제 절차, 담당부서 및 연락처를 서면 등으로 통지하고, 같은 내용으로 한국인터넷진흥원에 72시간 이내 신고하였다. 연락처 확인이 어려운 경우에는 홈페이지에 30일 이상 게시하였다. 보유기간 경과 또는 목적 달성 시 전자파일은 영구 삭제하고, 서면은 파쇄 또는 소각한다.\n\n(사고 이후 개선조치) 웹 애플리케이션 입력값 검증 전수 점검 및 준비된 쿼리 적용, 보안 패치와 정기 취약점 점검 체계를 강화하였다. 비밀번호는 솔트를 포함한 일방향 암호화로 저장하고 인증정보를 분리 보관한다. 관리자 페이지는 지정 IP/VPN과 다단계 인증으로 보호하며, 접근권한을 역할 기반 최소부여로 관리한다. 접속기록을 생성·보관하고 위·변조 방지장치를 적용하여 주기적으로 점검한다. 침입 탐지·차단과 웹 방화벽을 운영한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 2}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "사고 이전 사실을 변경하여 비밀번호를 안전하게 저장했다고 기술(원문은 안전한 암호알고리즘 미적용 보관).", "fix": "다음 문장을 교체하세요: \"비밀번호는 솔트를 포함한 일방향 암호화(bcrypt, PBKDF2 등 검증된 알고리즘)로 저장하고, 인증정보는 분리 보관하였다.\" -> \"피심인은 해당 DB에서 개인정보취급자와 회원의 비밀번호를 안전한 암호알고리즘으로 처리하지 않은 상태로 보관하였다.\" 그리고 '사고 이후 개선조치' 절에 \"비밀번호는 솔트를 포함한 일방향 암호화로 저장하고 인증정보를 분리 보관한다.\"를 유지하거나 명확히 남겨 사후개선으로 구분하십시오."}, {"aspect": "minimal_change", "issue": "사고 이전 관리자 페이지 접근통제 수준을 강화된 상태로 변경 서술(원문은 내부 관리자가 접근 가능하도록 운영).", "fix": "다음 문장을 교체하고 이동하세요: (본문 2단락) \"관리자 페이지는 지정 IP/VPN 및 다단계 인증을 적용하여 정당한 권한을 가진 자만 접근하도록 운영하였다.\" -> \"관리자 페이지를 통해 내부 관리자가 접근할 수 있도록 운영하였다.\" 또한, \"지정 IP/VPN 및 다단계 인증\" 적용 내용은 '사고 이후 개선조치' 절에 포함시키세요."}, {"aspect": "minimal_change", "issue": "내부관리계획 상태를 사고 이전에 이미 개정사항 반영으로 변경(원문은 개정 반영 전, 변경 전 기준 운영).", "fix": "다음 문장을 교체하세요: \"내부관리계획에는 접속기록 1년 이상 보관, 월 1회 이상 점검, 위·변조 방지 장치 적용 등 개정사항을 반영하여 운영하였다.\" -> \"또한 내부관리계획에는 접속기록 보관기간 1년과 월 1회 점검 등 개정 내용을 당시 기준으로 아직 반영 전이어서, 접속기록의 보관·점검은 변경 전 기준에 따라 운영되었다.\""}, {"aspect": "minimal_change", "issue": "공격 경위 및 유출 게시 위치를 변경(원문은 SQL 인젝션을 통한 질의 실행 및 다크웹 게시).", "fix": "다음 문장을 교체하세요: \"2021.9.27. 미상의 공격자가 제3자 라이브러리의 신규 취약점을 악용한 SQL 인젝션 시도를 하여 일부 데이터 조회가 발생하였다.\" -> \"2021.9.27. 미상의 공격자가 SQL 인젝션을 통해 웹 애플리케이션 입력을 DB 질의로 실행시키는 방식으로 회원정보를 외부로 전송하였다.\" 그리고 \"일부 자료가 외부에 게시되었으나\" -> \"일부 자료가 다크웹에 게시되자\"로 수정하세요."}, {"aspect": "minimal_change", "issue": "사고 당시 비밀번호 원문 노출이 없었다는 단정적 문구가 원문 사실과 모순.", "fix": "다음 구절을 삭제하거나 원문에 맞게 수정하세요: \"비밀번호 등 인증정보는 솔트 포함 일방향 암호화되어 원문 노출은 없었고,\" -> 삭제 또는 \"비밀번호는 안전한 암호화가 적용되지 않아 노출 위험이 있었다.\"로 수정."}, {"aspect": "minimal_change", "issue": "REWRITTEN에서 불필요한 사실 변경으로 시간표현을 구체화(72시간 명시 등)하고 보유·파기 절차를 본문에 추가하여 사건서술의 최소변경 원칙을 벗어남.", "fix": "다음 문장의 시간을 중립적으로 완화하는 것을 고려하세요: \"유출 사실 인지 후 72시간 이내에... 통지하고, ... 72시간 이내 신고하였다.\" -> \"유출 사실 인지 후 지체 없이 정보주체에게 통지하고 한국인터넷진흥원에 신고하였다.\" 보유·파기 절차(\"보유기간 경과 또는 목적 달성 시 ...\")는 '사고 이후 개선조치' 절로 이동하거나, 필요시 \"기존에도 운영하던 일반 파기 절차\"임을 덧붙여 시점 혼동을 줄이십시오."}, {"aspect": "legality", "issue": "동의 고지 사항 및 최소수집 원칙의 충족이 본문에 명시되지 않아 법 제15조제2항, 제16조 측면에서의 적법성이 불명확.", "fix": "첫 단락 끝에 다음 문장을 추가하세요: \"회원가입 시 개인정보의 수집·이용 목적, 수집 항목, 보유·이용 기간, 동의 거부권 및 거부에 따른 불이익을 알리고 동의를 받았다.\" 또한, 닉네임 수집의 필요성을 명확히 하세요: \"커뮤니티 기능 제공을 위해 닉네임은 선택항목으로 수집하였다.\""}]}}
{"case_id": "2022-013-096", "respondent": "산업 발전 업무를 수행하는 기타 공공기관(피심인)", "case_content": "산업 발전 업무 수행을 위해 민원 처리와 인사관리에 필요한 최소 항목의 개인정보만 수집·이용하며, 민원인 정보와 임직원 정보는 저장소를 분리하여 보관한다. 개인정보처리시스템은 내부망과 승인된 VPN에서만 접속 가능하며, 개인정보취급자에게는 역할 기반 최소권한을 부여한다. 계정은 개인별로 발급하고, 권한 부여·변경·말소 내역을 전자적으로 기록해 3년간 보관하며, 직무 변경·퇴직 시 즉시 권한을 회수한다. 인증정보는 일방향 암호화로 저장하고, 다단계 인증과 일정 횟수 이상 비밀번호 오입력 시 계정 잠금, 세션 타임아웃을 적용한다. 시스템 접속, 조회·다운로드 등 처리 이력은 위·변조 방지 조치와 함께 1년 이상 보관하고 월 1회 점검한다. 다운로드는 업무상 불가피한 경우에 한해 사전 승인 후 허용하며, 반출 사유·승인자·파일 해시를 기록하고 파일 암호화와 워터마킹을 적용한다. 전송 구간은 암호화 통신(TLS)을 사용하고, 저장 데이터는 데이터베이스 암호화 및 중요 항목(주민등록번호 등)에 대한 추가 암호화를 적용하며, 화면 표시·외부 제공 시 고유식별정보 등은 마스킹 또는 가명처리한다. 접근통제, 침입차단·탐지, 악성코드 방지, 보안 패치 등 기술적 조치를 운영하고, 서버실 출입통제와 잠금장치 등 물리적 보호조치를 유지한다. 보유기간은 목적과 법정 보존 기준에 따라 설정하고, 기간 도래 시 전자파일은 복구 불가능한 방식으로 삭제하며, 보존 필요 시에는 본 데이터와 분리하여 저장·관리한다. 파기 절차·결과는 기록·관리한다. 개인정보취급자 대상 정기 교육(연 1회 이상)과 신규자 교육을 실시하고 이수 내역을 보관한다. 시스템 개발·유지보수 위탁 시 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 접근권한 분리, 반환·파기 절차 등을 포함한 계약을 체결하고, 수탁자에 대한 이행 점검을 정기 실시한다. 내부관리계획에는 권한관리, 접속기록 관리, 점검 주기, 사고 대응 절차를 반영하여 주기적으로 갱신한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "시행령 제16조가 요구하는 비전자(종이 등) 기록물의 파기방법이 명시되지 않아 파기 조치의 완결성이 부족하다.", "fix": "case_content 내 파기 부분에 다음을 추가: \"종이·인쇄물 등 비전자 기록물은 파쇄 또는 소각 등으로 파기한다.\""}, {"aspect": "legality", "issue": "법 제15조·제17조(수집·제공의 법적 근거/동의) 및 법 제30조·시행령 제31조(처리방침 공개) 관련 절차가 명시되지 않았다.", "fix": "초반 수집·이용 문장 직후에 다음을 추가: \"개인정보의 수집·이용 및 제3자 제공 시 법 제15조·제17조에 따른 법적 근거 또는 정보주체 동의를 사전에 고지·획득하고, 동의 사항은 구분하여 받으며 개인정보 처리방침(법 제30조)을 홈페이지에 상시 공개한다.\""}, {"aspect": "legality", "issue": "공공기관으로서 법 제32조(개인정보파일 등록) 및 법 제33조/시행령 제35조(영향평가) 이행 여부가 드러나지 않는다.", "fix": "운영·관리 절 차 부분 말미에 다음을 추가: \"공공기관으로서 개인정보파일을 보호위원회에 등록(법 제32조)하고, 영향평가 대상에 해당하는 경우 사전 영향평가(법 제33조 및 시행령 제35조)를 실시한다.\""}]}}
{"case_id": "2022-013-092", "respondent": "피심인(대학교)", "case_content": "피심인(대학교)은 0000시스템을 통해 가상대학 수강생의 아이디, 이름, 이메일, 휴대전화번호, 학번, 소속, 성적, 출결 정보를 데이터베이스(DB)에 저장·관리하였고, 2018년 1월부터 2021년 6월까지 총 228,733건을 보유하였다. 사고 이전부터 내부관리계획 수립·시행, 접근권한 통제, 인증정보 및 중요정보의 암호화, 접속기록의 보관 및 위·변조 방지 등 안전성 확보 조치를 운영하였다. 2021-02-02 00:00경 시스템 고도화에 따른 DB 이관 과정에서 ID 필드가 이관 대상에서 제외되면서 웹·앱 메시지함 화면에서 일부 이용자의 메시지 제목·본문과 발송자 성명이 다른 이용자에게 무작위로 표시되었고, 같은 시각대 메시지함 클릭자 433명에 대한 열람 로그만 확인되었으며 메시지별 열람자 식별 로그는 기록되지 않았다. 피심인은 05:20경 메시지 관련 API와 메시지함 기능을 중단하고, 2.4. 홈페이지 공지를 게시한 뒤 2.5. 서면, 전자우편, 문자전송 등 서면등의 방법으로 이용자에게 개별 통지하였으며, 필요한 경우 동일 내용을 앱 푸시/SNS 알림으로 보완 통지하였다. 개별 통지는 사고 인지 시점(2.2.)부터 72시간 이내에 완료하였고, 통지에는 유출된 항목, 시점과 경위, 정보주체의 피해 최소화 방법, 대응 조치 및 피해구제 절차, 담당부서 및 연락처를 포함하였다. 2.6. 관련 사실을 보호위원회 또는 한국인터넷진흥원에 72시간 이내 신고하였다. 이후 재발 방지를 위해 메시지 조회 시 서버에서 수신자와 수신함 소유자의 일치 여부를 검증하도록 보완하고, DB 이관 전 스키마 매핑 검증(필수 키 누락 탐지, 참조무결성 점검)을 절차화하였으며, 테스트 환경에서의 사전 검증 및 변경관리 단계를 추가하였다. 또한 메시지 단위 열람기록(메시지ID, 열람자, 일시, IP)을 보관하고 접속기록의 위·변조 방지 및 안전한 보관 조치를 적용했으며, 개인정보처리시스템 접근권한을 재점검하여 최소권한 원칙에 맞게 조정하였다. 모니터링 및 경보 기준을 정비하고, 사고 대응 및 통지 절차를 문서화하고 교육하였다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "REWRITTEN 텍스트가 원문에 없던 사전 안전조치 운영, 72시간 내 통지 완료 단정, 신고기관 표현 변경, 상세한 사후 개선조치 등 여러 내용을 추가하여 원 사업 시나리오를 불필요하게 확장했습니다.", "fix": "다음과 같이 원문 내용 중심으로 간결화/복원하십시오: 1) 문장 전체 삭제: \"사고 이전부터 내부관리계획 수립·시행, 접근권한 통제, 인증정보 및 중요정보의 암호화, 접속기록의 보관 및 위·변조 방지 등 안전성 확보 조치를 운영하였다.\" 2) 문구 복원: \"2.5. 서면, 전자우편, 문자전송 등 서면등의 방법으로 이용자에게 개별 통지하였으며, 필요한 경우 동일 내용을 앱 푸시/SNS 알림으로 보완 통지하였다.\" → \"2.5. 이메일·문자·SNS로 이용자에게 개별 통지하였다.\" 3) 시간 한정 표현 완화: \"개별 통지는 사고 인지 시점(2.2.)부터 72시간 이내에 완료하였고, ... 포함하였다.\" → \"개별 통지는 사고 인지 후 지체 없이 실시하였고, ... 포함하였다.\" 4) 사후 개선조치 축약: 장문의 개선조치 단락 전체를 \"이후 재발 방지를 위해 메시지 조회 검증 강화, DB 이관 전 검증 절차 도입, 열람기록 보관 등 조치를 시행하였다.\"로 교체."}, {"aspect": "legality", "issue": "신고 의무를 단정적으로 표현(“72시간 이내 신고하였다”)하여 시행령 제40조의 신고 요건(유출 규모·유형 등 조건부)을 반영하지 않았습니다.", "fix": "문구를 조건부 신고로 수정하십시오: \"2.6. 관련 사실을 보호위원회 또는 한국인터넷진흥원에 72시간 이내 신고하였다.\" → \"2.6. 제40조제1항의 신고 요건(유출 규모·유형 등)을 확인한 후, 해당하는 경우 72시간 이내에 보호위원회 또는 한국인터넷진흥원에 신고하였다.\""}]}}
{"case_id": "2022-013-098", "respondent": "국토교통부 산하 공기업", "case_content": "국토교통부 산하 공기업은 민원·신고 상담센터를 운영하며, 상담 처리와 사실 확인을 위해 통화 녹취와 신고인 식별 최소 정보(성명, 연락수단, 민원번호)를 수집한다. 통화 시작 시 음성 안내로 수집·이용 목적, 수집 항목, 보유기간, 제3자 제공 가능성, 권리 행사 방법을 알린다. 녹취파일과 민원 메타데이터는 분리 저장하고, 전송·저장 시 암호화하며, 접근 권한은 담당자에게만 개인별·직무기반으로 부여한다. 관리자 계정에는 다단계 인증을 적용하고, 접근권한 변경·말소를 관리한다. 개인정보처리시스템 접속기록을 보관·점검하며 위·변조 방지 조치를 적용한다. 보유기간이 도래하면 자동 파기하고, 법정 보존이 필요한 경우에는 다른 개인정보와 분리 보관하며, 파기 이력을 기록한다. 목적 외 이용·제공은 내부 승인 절차로 제한하고, 당초 목적과 합리적으로 관련된 추가 이용·제공이 필요한 경우 관련성, 예측 가능성, 정보주체 불이익 여부, 암호화 등 안전조치 이행 여부를 사전 검토·기록한다. 제3자 제공 또는 위탁이 필요한 경우 범위·기간·안전조치가 포함된 문서로 처리하고, 제공·위탁 내역을 관리·공개한다.\n\n신고인은 홈페이지, 전자우편, 우편, 방문 등으로 개인정보 열람요구서를 제출할 수 있다. 열람요구는 민원 처리와 분리된 전용 경로에서 관리되며, 중복 접수 여부와 관계없이 건별로 처리한다. 접수일로부터 10일 이내에 열람통지서를 발송하고, 본인 확인 후 다음 사항을 제공한다: 본인 통화 녹취 열람(타인의 개인정보가 포함된 구간은 음성 변조 등으로 마스킹), 개인정보의 수집·이용 목적, 보유 및 이용 기간, 제3자 제공 현황, 처리 동의의 사실 및 내용. 열람 제한 또는 연기 시에는 사유와 이의제기 방법을 함께 안내한다. 제공은 사내 열람실 또는 일회용 토큰 기반의 암호화된 링크로 진행하며, 열람·제공 내역을 기록한다. 정정·삭제·처리정지 등 추가 요구가 있는 경우 동일 채널로 접수·처리하고 결과를 통지한다.\n\n상담 시스템 운영이나 녹취 보관을 외부에 위탁하는 경우, 위탁 계약에 처리 범위, 재위탁 제한, 암호화·접근통제·로그관리 등 안전조치, 사고 통지, 반환·파기 절차를 포함하고, 수탁자 접근 권한을 최소화하며 정기 점검을 수행한다. 개인정보 처리방침과 열람 절차, 보존기간, 제3자 제공 현황, 권리 행사 방법 및 담당부서 연락처는 인터넷 홈페이지와 관련 포털에 상시 공개한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "수집 안내에 동의 기반 처리 시 동의 거부 권리 및 불이익 고지, 동의 없이 처리하는 항목과 법적 근거의 구분 공개에 관한 요건이 명시적으로 나타나지 않음(법 제15조제2항, 제22조제3항; 시행령 제17조).", "fix": "다음 문장을 통화 고지 문장 바로 뒤에 추가: \"동의에 근거하여 처리하는 경우에는 동의 거부 권리 및 거부에 따른 불이익을 함께 고지하고 동의를 받으며, 법령상 소관 업무 수행 등 동의 없이 처리하는 항목과 그 법적 근거는 개인정보처리방침에 동의 처리와 구분하여 공개한다.\""}, {"aspect": "legality", "issue": "제3자 제공 시 정보주체에게 고지·동의 받아야 할 필수 항목(제공받는 자, 목적, 항목, 보유·이용 기간, 동의 거부 권리 및 불이익)이 문구상 불명확함(법 제17조제2항, 제18조제3항; 시행령 제17조).", "fix": "다음으로 문구를 교체: 기존 \"제3자 제공 또는 위탁이 필요한 경우 범위·기간·안전조치가 포함된 문서로 처리하고, 제공·위탁 내역을 관리·공개한다.\"를 \"제3자 제공이 필요한 경우에는 제공받는 자, 이용 목적, 제공 항목, 보유·이용 기간, 동의 거부 권리 및 불이익을 정보주체에게 알리고 동의를 받아 문서로 처리하며, 제공 내역을 관리·공개한다. 위탁이 필요한 경우에는 범위·기간·안전조치, 재위탁 제한, 감독 등 법정 사항을 포함한 계약을 체결하고 위탁 내역을 관리·공개한다.\"로 수정."}]}}
{"case_id": "2022-013-095", "respondent": "국민체육진흥공단", "case_content": "국민체육진흥공단은 체육정보시스템과 체전시스템에서 선수·지도자·임원 등의 식별정보, 참가·경기 이력, 사진 등 업무에 필요한 최소 항목만 처리한다. 외부에서 시스템에 접속하는 경우 전용선 또는 VPN을 사용하고, 단말 인증과 다단계 인증을 병행하며, 허용 IP 및 기기 보안 상태 점검 후 접속을 허용한다. 모든 계정은 개인별로 발급하고 비밀번호는 일방향 암호화하여 저장하며, 권한은 역할 기반으로 최소 권한만 부여한다. 권한 부여·변경·말소 이력을 기록하고, 정기적으로 계정과 권한을 재점검하며, 퇴직·휴면 계정은 즉시 비활성화한다. 무활동 시 자동 로그아웃(세션 타임아웃)과 최대 세션 유지시간을 적용하고, 대량 다운로드·반출 등 중요 행위 전 재인증을 요구한다.\n사진 파일 등 정적 자원은 공개 URL로 노출하지 않고, 애플리케이션의 인증·인가를 통과한 요청에 한해 접근을 허용한다. 저장소 ACL로 파일 접근을 제한하고 저장 시 암호화하며, 전송 시 TLS를 적용한다. 필요한 경우 유효기간이 짧고 범위가 제한된 서명 URL을 발급하고, 디렉터리 인덱싱과 직접 경로 접근은 차단한다.\n개인정보처리시스템에 대한 접속기록은 계정, 접속일시, 원격지 IP, 조회 조건, 조회·다운로드·인쇄·반출 내역까지 포함해 위변조 방지 상태로 보관한다. 로그는 정기적으로 점검·분석하고, 대량 조회·다운로드 등 이상 징후에 대한 탐지·차단 정책과 알림을 운영한다. 데이터베이스와 파일은 저장 시 암호화하고, 암호키는 분리 보관하며 접근을 통제한다. 악성코드 방지, 보안패치, 방화벽·침입차단 등 접근통제 장치를 운영하고, 서버실 등 물리적 접근도 통제한다.\n공공시스템 운영 기준에 따라 시스템별 내부관리계획을 수립·점검하고, 접속기록의 저장·분석 및 관리 책임자를 지정한다. 데이터 반출은 사유 기재 및 승인 절차를 거치며, 대용량 반출은 별도 승인과 DLP 통제를 적용한다. 보존기간이 경과하거나 처리 목적이 달성된 정보는 전자파일은 복구 불가능한 방식으로 영구 삭제하고, 서면은 파쇄·소각하며, 법령에 따른 보존 대상은 분리 보관한다. 운영을 외부에 위탁하는 경우 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 점검·감독, 종료 시 반환·파기 등을 포함한 계약을 체결하고 이행 여부를 정기 점검한다. 사고 발생 시에는 내부 대응 절차에 따라 통지·신고 및 추가 피해 방지 조치를 수행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 5}, "pass": true, "problems": []}}
{"case_id": "2021-0039", "respondent": "한국조폐공사", "case_content": "한국조폐공사는 지역사랑상품권 시스템을 한국조폐공사 통합 데이터센터로 이전하면서 데이터베이스관리시스템을 변경하고 통합센터의 오라클 DB에 회원정보를 저장하였다. 회원정보는 회원번호를 식별키로 관리하였다.\n\n2021.6.8.~6.9. 동안 오라클 DB의 시퀀스 재시작 사이클 설정 미적용으로 서로 다른 가입자에게 동일한 회원번호가 생성되었고, 지역사랑상품권 앱의 ‘내정보 변경’ 화면에서 동일 번호로 연결된 다른 계정의 일부 개인정보가 화면 조회 형태로 노출 가능한 상태가 되었다. 사고 인지 후 DB 설정을 수정하고 회원정보를 복원했으며, 관련 정보주체 124명에게 이메일·문자로 통지하고 개인정보보호 포털에 신고하였다.\n\n재발 방지 및 운영 기준은 다음과 같다. 가입, 상품권 발급·사용, 고객지원 등 목적 달성에 필요한 최소 항목만 수집·이용하며, 선택 항목은 동의하지 않아도 서비스 제공을 제한하지 않는다. 가입 시 수집·이용 목적, 수집 항목, 보유·이용기간, 동의 거부권 및 불이익 등을 서면 또는 전자적 수단으로 명확히 고지하고 동의를 받는다. 외부 위탁이 필요한 경우 위탁 업무 내용과 수탁자를 인터넷 홈페이지에 상시 공개한다.\n\n회원 식별은 회원번호(오라클 시퀀스 기반)와 본인인증 연계 식별자를 사용한다. 회원번호를 기본키(PK)로 설정하고 중복 금지 제약조건과 참조무결성 규칙으로 관리하며, 시퀀스 재시작·캐시 정책은 운영 전 검증 및 배포 후 점검한다. 배포 파이프라인에서 시퀀스 초기화 누락, 캐시 불일치, 키 충돌 가능성을 자동 점검하며, 중복 생성 탐지 테스트와 정합성 검증을 포함한다.\n\n데이터 이전 및 DB 설정 변경은 표준 변경관리 절차(사전 영향분석, 시험환경 검증, 승인, 롤백계획)에 따라 수행한다. 마이그레이션 시 키 충돌 탐지, 데이터 정합성 검증, 전체·증분 백업과 복구 절차를 사전에 준비하며, 시험환경에는 가명·익명 데이터를 사용한다.\n\n앱 ‘내정보 변경’ 기능은 서버 측 본인확인 토큰을 기반으로 해당 이용자 레코드만 조회·수정하도록 설계한다. 클라이언트 입력으로 계정 식별자를 변경할 수 없고, 서버는 행 단위 접근제어와 권한 검사를 이중 적용한다. 다중 테넌트 데이터는 논리적으로 분리하고, API는 필요한 범위 내에서만 데이터 필드를 반환한다.\n\n전송 구간은 TLS로 암호화하고, 저장 데이터는 컬럼 단위 암호화와 키관리시스템으로 관리한다. 관리자·운영자 접근은 개인별 계정과 다단계 인증을 적용하고, 최소권한 원칙에 따라 역할 기반으로 부여·변경·말소하며 승인 이력을 보관한다. DB 및 주요 시스템의 접속기록(접속일시, 처리내역 등)은 위·변조 방지 조치와 함께 1년 이상 보관·점검한다. 악성코드 방지, 취약점 점검, 침입 탐지·차단 및 모니터링을 상시 운영하고, 데이터센터에는 출입통제와 잠금장치 등 물리적 보호조치를 적용한다.\n\n보관기간은 업무 목적과 관련 기준에 따라 설정하고, 기간 만료 또는 목적 달성 시 지체 없이 파기한다. 전자파일은 복구 불가능한 방식으로 삭제하며, 법정 보존 사유가 있는 자료는 본래 자료와 분리하여 별도 저장하고 보존기간 종료 시 파기한다. 백업본에도 동일한 파기·보존 정책을 적용한다.\n\n개인정보 처리방침을 통합센터와 앱에서 상시 공개하고, 열람·정정·삭제·처리정지 등 권리행사 창구를 운영한다. 이상 징후 탐지 시 즉시 차단·원인분석을 수행하고, 필요한 경우 정보주체 통지 및 관계기관 신고를 위한 72시간 내 대응 절차와 연락체계를 마련하여 주기적으로 훈련한다. 외부 위탁 시에는 처리범위, 재위탁 제한, 보안 통제, 사고 통지, 반환·파기 등을 포함한 계약을 체결하고 점검·교육으로 감독한다. 개인정보파일 규모·변경에 따라 사전 영향평가가 필요한 경우 평가를 실시하고 개선사항을 반영한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 4, "minimal_change": 2}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "The REWRITTEN case_content adds extensive, generalized privacy program policies (data minimization, outsourcing disclosure, encryption/KMS, malware defense, physical security, retention/backup rules, rights portal, 72-hour incident playbook, outsourcing contracts, PIA, etc.) that go far beyond the original incident facts and immediate handling/controls. This unnecessarily changes and expands the scenario.", "fix": "Keep the incident description and only the controls directly tied to preventing the duplicate member-number error and the specific screen-access issue. Delete the following full paragraphs from case_content: (1) starting with “재발 방지 및 운영 기준은 다음과 같다. 가입, 상품권 발급·사용…” up to “…수탁자를 인터넷 홈페이지에 상시 공개한다.”; (2) starting with “전송 구간은 TLS로 암호화하고…”; (3) starting with “보관기간은 업무 목적과 관련 기준에 따라 설정하고…”; (4) starting with “개인정보 처리방침을 통합센터와 앱에서 상시 공개하고…”; (5) starting with “외부 위탁 시에는 처리범위, 재위탁 제한…”; (6) starting with “개인정보파일 규모·변경에 따라 사전 영향평가가 필요한 경우…”. Retain only these control paragraphs as they are incident-relevant: “회원 식별은 회원번호(오라클 시퀀스 기반)…”, “데이터 이전 및 DB 설정 변경은 표준 변경관리 절차…”, and “앱 ‘내정보 변경’ 기능은 서버 측 본인확인 토큰…”."}, {"aspect": "minimal_change", "issue": "The violated_articles field was cleared in REWRITTEN, removing the specific provisions cited in the original record.", "fix": "Restore the violated_articles field to match the original: \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제30조\"]."}, {"aspect": "objectivity", "issue": "The control section mixes forward-looking policy commitments (present-tense prescriptions like “설계한다/적용한다/운영한다”) with incident facts, which dilutes factual, executed handling steps.", "fix": "Reframe the control section as actions actually taken after the incident and use past tense. Replace the heading “재발 방지 및 운영 기준은 다음과 같다.” with “사고 후 다음 조치를 시행하였다:”. Then revise remaining controls to past tense, for example: change “회원번호를 기본키(PK)로 설정하고 … 관리하며, 시퀀스 … 점검한다.” to “회원번호를 기본키(PK)로 설정하고 중복 금지 제약조건과 참조무결성 규칙을 적용하였으며, 시퀀스 재시작·캐시 정책을 운영 전 검증하고 배포 후 점검하였다.”; change “앱 ‘내정보 변경’ 기능은 … 설계한다.” to “앱 ‘내정보 변경’ 기능을 … 설계·적용하였다.”"}]}}
{"case_id": "2022-013-097", "respondent": "피심인 지방자치단체", "case_content": "행정복지센터는 자원봉사자 모집·운영이라는 소관 업무를 위해 필요한 최소 항목만 수집한다. 모집 공고 및 신청 단계에서 처리 목적, 수집 항목, 보유·이용 기간, 동의 거부 권리와 불이익 여부를 명확히 알리고, 법령에 근거한 처리가 필요한 항목은 동의 대상과 구분하여 안내한다. 수집 항목은 성명, 생년월일(활동 배정에 필요한 범위), 연락처, 주소(활동지역 배정에 필요한 범위)로 한정하고, 성별 등 선택 항목은 미선택 시 불이익이 없도록 한다. 주민등록번호 등 고유식별정보와 건강 등 민감정보는 수집하지 않으며, 제출 서류에 해당 정보가 포함되지 않도록 사전 안내와 자동 패턴 검사를 통해 접수를 차단한다.\n수집된 정보는 자원봉사자 모집, 배치, 교육 안내, 활동 실적 관리 등 소관 업무 범위에서만 이용하며, 제3자 제공은 법령 근거가 있는 경우 또는 별도 동의를 받은 경우에 한해 최소 항목으로 제한한다. 명단을 대외 공표할 필요가 있는 경우에는 개인 식별이 되지 않도록 가명·마스킹 등으로 최소화한다.\n저장은 전송 구간 암호화 채널을 사용하며, 저장 시 주요 항목을 암호화한다. 접근 권한은 담당자에 한해 역할 기반으로 부여하고 정기 점검·말소한다. 계정은 개인별로 발급하며 이직·전보 시 즉시 회수한다. 개인정보처리시스템 접속기록(접속일시, 처리내역 등)을 보관·점검하고 위·변조 방지 조치를 적용한다. 종이 문서는 잠금장치가 있는 구역에 보관하고, 전산·문서 모두 반출 통제를 실시한다. 악성코드 방지, 취약점 점검 및 보안패치, 내부관리계획 수립·운영, 정기 교육, 개인정보 보호책임자 지정 등 기본 안전조치를 이행한다.\n보유기간은 자원봉사자 관리 목적 달성 또는 마지막 활동 기준으로 2년으로 운영하며, 기간 도래 또는 목적 달성 시 지체 없이 파기한다. 전자파일은 복구 불가능한 방식으로 영구 삭제하고, 서면은 파쇄 또는 소각한다. 다른 법령에 따라 보존이 필요한 경우에는 해당 정보만 별도로 분리 보관한다. 파기 이력은 기록·관리한다.\n정보시스템 유지관리 등 위탁이 필요한 경우에는 처리 범위, 재위탁 제한, 접근통제·암호화 등 안전조치, 점검·감독, 사고 통지, 종료 시 반환·파기 등을 포함한 계약을 체결하고, 수탁자 교육·접속기록 점검 등으로 정기 감독을 실시한다. 위탁 내용과 수탁자는 공개한다.\n정보주체 권리 행사를 위해 열람, 정정·삭제, 처리정지 및 동의 철회 창구를 운영하고, 신청 방법을 온라인·오프라인으로 제공한다. 처리 결과와 사유는 기한 내 통지한다. 추가 이용·제공이 필요한 경우에는 수집 당시 목적과의 관련성, 정보주체 이익 침해 가능성, 안전조치 이행 여부 등을 검토하거나 별도 동의를 받는다.\n공공기관 개인정보파일로 등록하여 명칭, 운영 근거·목적, 항목, 보유기간, 처리방법 등을 공개하고, 변경 시 갱신한다. 2019년 12월 30일에는 주민자치 관련 조례·시행규칙에 따라 동의서 서식을 표준화하고, 필수·선택 항목 분리, 보유기간·권리 고지, 수집·파기 절차 및 책임 체계를 문서화하여 적용한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 3}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "핵심 사실(2018년 10월 수집 시점, 실제 수집 항목, ‘센터 내부 명단으로 관리’, 보유기간 2년)이 현재형 일반 정책 서술로 대체되었고, 원문에 없던 시나리오(대외 공표 시 가명처리, 위탁 일반론, 추가 이용·제공 일반 검토 등)가 다수 추가되어 불필요한 범위까지 확장되었습니다.", "fix": "원문 사실을 앞부분에 복원하고, 불필요한 확장 서술을 축소하세요. 구체적 수정안:\n- case_content 맨 앞에 다음 문장을 추가: \"행정복지센터는 2018년 10월 자원봉사자 모집 과정에서 자원봉사자의 성명, 생년월일, 성별, 주소, 전화번호 등을 수집하였다. 수집된 정보는 자원봉사자 모집·운영을 위한 명단으로 센터 내부에서 관리되었고, 보유기간은 2년으로 설정하였다.\"\n- 2019년 조치와의 연결을 명확히 하도록 다음 문장으로 전환: \"2019년 12월 30일 주민자치 관련 조례·시행규칙 제정 이후에는 모집 공고 및 신청 단계에서 처리 목적, 수집 항목, 보유·이용 기간, 동의 거부 권리와 불이익 여부를 구분 고지하고, 법령 근거 처리 항목과 동의 대상 항목을 분리 안내하며, 성별은 선택항목으로 운영한다.\"\n- 원문에 없는 시나리오/확장 서술은 삭제 또는 축소: 다음 문장은 삭제 권고 \"명단을 대외 공표할 필요가 있는 경우에는 개인 식별이 되지 않도록 가명·마스킹 등으로 최소화한다.\" \n- 위탁 일반론은 실제 위탁이 있는 경우에 한해 축소 서술: 기존 문단을 다음으로 대체 \"정보시스템 유지관리 등 필요한 경우에 한하여 처리 범위, 재위탁 제한, 안전조치, 종료 시 반환·파기 등을 포함한 계약을 체결하고 수탁자를 공개한다(해당 시).\"\n- 보유기간 표현을 원문 사실에 맞추어 경정: \"보유기간은 2년으로 운영하며, 기간 도래 또는 목적 달성 시 지체 없이 파기한다.\""}]}}
{"case_id": "2022-004-013", "respondent": "소개팅앱 운영사(피심인)", "case_content": "소개팅앱 운영사(피심인)는 2018.11.12.부터 서비스를 운영하며, 회원 가입·매칭·부정사용 방지에 필요한 최소 항목만 수집한다. 필수 항목은 성명 또는 닉네임, 생년월일(연령대), 휴대전화번호, 이메일, 프로필 사진이며, 직업·회사·학교는 선택 입력이다. 종교 정보는 별도 화면에서 목적, 항목, 보유기간, 거부권을 알린 후 명시적으로 선택 동의를 받은 경우에만 수집하며, 미동의 시 서비스 이용에 영향이 없다. 선택·민감 항목은 논리적으로 분리된 저장소에 저장하여 접근 권한을 구분한다. 본인·연령 확인은 휴대폰 본인확인 등 인증 대행사를 통해 처리하고, 인증 결과 토큰과 일시만 저장한다. 신분증·가족관계증명서 원본 이미지는 수집하지 않으며, 업로드가 필요한 예외 상황에는 주민등록번호 등 고유식별정보 가림을 안내하고 서버에서 패턴 검출로 해당 정보가 포함된 파일은 접수를 차단한다.\n\n데이터는 AWS 국내 리전의 데이터베이스와 S3에 저장하며, 전송 구간은 TLS로, 저장 데이터는 KMS 기반 서버측 암호화로 보호한다. 개인정보 처리시스템 접근 권한은 업무상 필요한 담당자에게 개인별 최소 권한으로 부여하고, MFA를 적용한다. 접근·조회·다운로드 이력은 위변조 방지 설정으로 1년 이상 보관·점검한다. 운영·개발·위탁사 계정은 분리 발급하고, 공유 계정을 사용하지 않는다. 악성코드 방지, 보안패치 및 취약점 점검을 주기적으로 수행한다.\n\n보유 기간은 계정 유지 및 매칭 제공에 필요한 기간으로 한정하며, 계정 탈퇴 또는 목적 달성 시 지체 없이 파기한다. 인증 토큰은 부정사용 대응을 위해 최대 6개월 보관 후 자동 삭제한다. 법령에 따라 보존이 필요한 경우에는 해당 항목만 분리보관하고, 기간 만료 시 복구가 불가능한 방식으로 삭제하며 삭제 이력을 기록한다. 백업 데이터와 로그도 동일한 암호화·접근통제 기준을 적용하고, 보존기간 도래 시 순차 삭제한다.\n\n클라우드 운영 및 본인확인 업무는 위탁 계약으로 관리한다. 계약서에는 처리 범위, 재위탁 제한, 암호화·접근통제·로그관리 등 안전조치, 사고 통지, 점검·감독, 반환·파기 절차를 포함한다. 수탁자 현황과 위탁 업무는 홈페이지에 공개하고, 정기적으로 이행 점검을 수행한다. 개인정보의 추가 이용·제공은 내부 판단 기준(목적과의 관련성, 수집 경위, 정보주체 영향, 안전조치 적용 여부 등)에 따라 사전 검토 후 필요한 경우 별도 동의를 받아 진행한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "서비스 특성상 프로필 등에서 종교(민감정보)가 표시될 수 있음에도, 법 제23조 제3항의 ‘민감정보 공개 가능성 및 비공개 선택 방법’ 고지 요소가 명시되어 있지 않습니다.", "fix": "다음 문장을 종교 정보 동의 설명 직후에 추가하세요: 프로필에 종교 정보가 표시될 수 있는 경우, 표시 전에 공개 가능성과 비공개 선택 방법을 안내하고, 기본값을 비공개로 설정한다."}, {"aspect": "minimal_change", "issue": "원문 시나리오의 핵심 수집 항목 표현이 불필요하게 변경되었습니다(예: 이름→성명 또는 닉네임, 나이→생년월일, 직업을 선택항목으로 변경). 이는 통제·안전조치의 보강을 넘어 항목 정의 자체를 바꾸는 변경입니다.", "fix": "문구를 원문 시나리오에 맞게 최소 수정으로 환원하세요. 교체 예시: 1) ‘필수 항목은 성명 또는 닉네임, 생년월일(연령대), 휴대전화번호, 이메일, 프로필 사진이며, 직업·회사·학교는 선택 입력이다.’ -> ‘필수 항목은 이름, 나이, 휴대전화번호, 이메일, 프로필 사진이며, 회사·학교는 선택 입력이다. 직업은 필수 항목으로 수집한다.’"}]}}
{"case_id": "2022-004-013", "respondent": "소개팅앱 운영사(피심인)", "case_content": "사실관계: 피심인은 AWS를 통해 개인정보처리시스템을 운영하였다. 2021.9.23. 노출된 루트 Access Key가 외부에서 사용되어 접속이 발생했고, 그 결과 DB 백업 파일이 생성되어 외부로 전송되었다. 2021.9.24.에는 S3 버킷에서 프로필 이미지와 인증서류가 네트워크를 통해 다운로드되었으며, 일부 객체 권한은 공개로 설정되었다. 당시 운영자 계정에는 다중 인증이 적용되지 않았고 IP 기반 접근통제가 없었으며, 접속기록은 시스템 점검용 로그 등에 단기간 보관되어 항목별 접근 이력의 1년 이상 정기 점검·보존 체계가 운영되지 않았다.\n\n사고 이후 개선조치:\n\n1) 수집·이용 및 제공/동의\n- 서비스 제공에 필요한 최소 항목(계정 식별정보, 연락수단, 매칭 설정값, 프로필 이미지)과 본인확인에 필요한 자료만 수집한다.\n- 수집·이용, 제3자 제공, 선택항목 등 각 동의 사항을 구분하여 목적, 항목, 보유기간, 동의 거부권 및 불이익을 명확히 알리고 전자적 방법으로 동의를 받는다.\n- 신분증 등 제출 시 주민등록번호 등 고유식별정보는 제출 전에 가림을 안내하고, 서버 측에서 패턴 검출 시 접수를 차단한다. 불가피하게 고유식별정보를 처리하는 경우 별도 동의를 받고 저장 시 강한 암호화를 적용한다.\n- 만 14세 미만 아동의 개인정보 처리가 필요한 경우 법정대리인 동의 및 확인 절차를 적용한다.\n\n2) 시스템 구성과 접근통제\n- DB 및 핵심 자원은 VPC 사설망에 배치하고 퍼블릭 접근을 차단한다.\n- 운영자 접속은 기업 SSO와 MFA를 필수로 하며, 고정 IP/VPN 기반 허용목록으로 제한한다.\n- 루트 계정은 액세스 키를 비활성화하고 하드웨어 MFA만 허용한다.\n- IAM은 역할 기반 최소권한으로 부여하고, 권한 부여·변경·말소는 승인 절차와 분리된 검토를 거친다.\n- 비밀키·자격증명은 Secrets Manager 등에 저장하고 주기적으로 자동 교체한다.\n\n3) 저장·전송 보호\n- 저장 데이터는 KMS 등으로 암호화하고, 전송 구간은 TLS를 사용한다.\n- S3는 계정·버킷 단위 퍼블릭 액세스 차단을 기본으로 설정하고, 버킷 정책으로 외부 공개를 금지한다. ACL은 비활성화하고 객체 소유권은 버킷 소유로 강제한다.\n- 프로필 이미지·인증자료 열람은 짧은 만료의 프리사인드 URL로 제공한다.\n\n4) 모니터링·기록 및 접근이력\n- CloudTrail(관리/데이터 이벤트), VPC Flow Logs, RDS 감사로그, S3 서버 액세스 로그를 활성화한다.\n- 로그는 별도 계정의 변경불가(불변성) 저장소에 분리 보관하고 1년 이상 보존한다.\n- 개인정보 항목별 접근 이력을 1년 이상 보존하고 월 1회 이상 정기 점검하며, 이상 징후에 대한 실시간 경보를 운영한다.\n\n5) 백업·복구 및 파기\n- 암호화된 스냅샷과 백업을 분리 계정 또는 리전에 보관하고, 정기 복구 테스트를 수행한다.\n- 보존기간 만료 시 복구 불가능한 방식으로 파기하고 파기 이력을 기록한다. 법정 보존 대상은 본래 데이터와 분리 보관한다.\n\n6) 위탁 및 관리\n- 클라우드 제공사 등 수탁사와 처리 범위, 재위탁 제한, 보호조치, 사고 통지, 반환·파기를 포함한 계약을 체결하고, 이행 증적을 관리한다.\n- 수탁자 교육 및 처리 현황 점검 등 감독 절차를 운영한다.\n\n7) 국외 이전\n- 국외 이전이 필요한 경우, 이전되는 항목, 국가·시기·방법, 이전받는 자의 명칭·연락처, 이용 목적 및 보유·이용 기간, 거부 방법·효과를 사전에 알리고 별도의 동의를 받는다.\n- 정보주체와의 계약 이행을 위한 이전 등 예외에 해당하는 경우에는 위 사항을 개인정보 처리방침 공개 또는 전자우편 등으로 알리고, 전송 경로 암호화와 수신자 측 보호조치 등 필요한 조치를 계약에 반영하여 시행한다.\n- 필요한 경우 분쟁해결 및 권리행사 방법을 포함한 절차를 마련한다.\n\n8) 유출 통지·신고 및 사고 대응\n- 유출 등 사실 인지 시 72시간 이내 정보주체에게 유출 항목, 시점·경위, 피해 최소화 방법, 대응조치, 연락처 등을 알린다.\n- 1천명 이상 규모, 민감정보·고유식별정보 포함, 또는 시스템에 대한 불법적 접근으로 인한 유출 등 보고 대상에 해당하는 경우 72시간 이내 관계기관(개인정보보호위원회 또는 한국인터넷진흥원)에 신고한다.\n- 노출 징후 발견 시 즉시 격리·차단하고 포렌식 절차에 따라 원인을 분석·개선한다.\n\n9) 권한관리·인력 및 내부관리\n- 개인정보 취급자는 최소로 지정하고 계정은 개인별로 발급한다. 입·퇴사·직무 변경 시 권한을 즉시 조정·말소한다.\n- 내부관리계획을 수립·운영하고 정기 보안·개인정보 보호 교육을 실시한다.\n\n10) 데이터 위치\n- 데이터는 원칙적으로 국내 리전에 저장·처리한다. 국외 처리가 필요한 경우 위 국외 이전 절차와 보호조치를 적용한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 4, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "legality", "issue": "시행령 제30조의 안전조치 중 일부 필수 조치가 명시적으로 드러나지 않음(악성코드 방지 프로그램 설치·운영, 인증정보의 일방향 암호화 저장 등). 또한 법 제30조(처리방침 공개), 법 제31조(개인정보 보호책임자 지정), 정보주체 권리행사 절차(열람·정정·삭제·처리정지) 안내가 구체적으로 기술되지 않음.", "fix": "다음 문구를 추가하여 법·시행령상의 필수 사항을 명시하세요.\n- 3) 저장·전송 보호 항목에 추가: \"비밀번호 등 인증정보는 일방향 해시(예: bcrypt, scrypt, Argon2)로 저장한다.\"\n- 4) 모니터링·기록 및 접근이력 또는 9) 권한관리·인력 및 내부관리 항목에 추가: \"운영 서버, 개인정보처리시스템 및 취급자 PC에 백신/EDR 등 악성코드 방지 프로그램을 설치·자동 업데이트하고 정기 점검한다.\"\n- 9) 권한관리·인력 및 내부관리 항목에 추가: \"개인정보 보호책임자(DPO)를 지정하고, 내부관리계획에 따라 대표자 또는 이사회에 정기 보고한다.\"\n- 새로운 11) 정보주체 권리·처리방침 항목을 추가: \"정보주체의 열람·전송·정정·삭제·처리정지 및 동의 철회 절차를 마련·운영하고, 방법과 절차를 서비스 화면에 쉽게 확인 가능하도록 공개한다. 개인정보 처리방침을 제정·공개하며, 처리 목적, 항목, 보유기간, 제3자 제공, 위탁, 안전조치, 국외이전 근거 및 방법(해당 시), 자동화된 결정 관련 사항 등을 포함한다. 동의 없이 처리하는 개인정보의 항목과 법적 근거를 동의 기반 처리와 구분하여 처리방침 또는 전자우편 등으로 알린다.\""}, {"aspect": "minimal_change", "issue": "원본에는 위반조항이 명시되어 있으나, REWRITTEN에서 violated_articles가 빈 배열로 변경되어 불필요한 시나리오 변경이 발생함.", "fix": "violated_articles를 원본과 동일하게 복원하세요. 예: \"violated_articles\": [\"개인정보 보호법 제29조\", \"개인정보 보호법 시행령 제48조의2\"]"}]}}
{"case_id": "2022-004-013", "respondent": "소개팅앱 운영사(피심인)", "case_content": "소개팅 앱은 매칭 제공과 본인확인, 고객문의 처리에 필요한 최소 정보(연락수단, 닉네임, 인증 결과값, 결제 이력(해당 시))만 처리한다. 신분증 등 제출 서류는 업로드 단계에서 주민등록번호 등 고유식별정보 가림을 안내하고, 서버 측 패턴 검출로 해당 정보가 포함된 파일은 접수를 차단한다. 검증에 필요한 항목만 추출하여 저장하며 원본 이미지는 즉시 삭제한다.\n회원 탈퇴 시 계정 정보, 프로필, 메시지, 제출 서류 등 전자파일은 자동 배치로 지체 없이 영구 삭제한다. 다만 법령상 보존이 필요한 항목과 분쟁 대응을 위해 필요한 최소 항목은 별도 저장영역으로 분리 보관하며, 목적 달성 또는 보존기간 만료 시 복구 불가능한 방식으로 파기한다. 분리 저장영역은 운영 DB와 논리적으로 분리하고, 접근 권한은 지정된 최소 인원에게만 부여하며 개인별 계정으로 이력(부여/변경/말소)을 관리한다.\n최근 1년 이상 미이용 계정은 운영 DB에서 즉시 분리하여 휴면 저장소로 자동 이전하거나 불필요 항목을 우선 파기한다. 휴면 저장소에는 재이용에 필요한 최소 항목만 보관하고, 마케팅 및 맞춤 추천 처리 대상에서는 제외한다. 휴면 및 분리보관 데이터는 운영 데이터와 테이블/버킷을 분리하고, 식별자 키를 분리 관리하여 목적 외 조회를 통제한다.\n데이터는 전송 시 TLS를 적용하고 저장 시 암호화(AES 등)를 적용하며, 암호키는 업무망과 분리된 키 관리 시스템에서 권한 분리하여 운용한다. 개인정보처리시스템 접근은 다단계 인증과 네트워크 접근통제로 제한하고, 접속기록(접속 일시, 처리 내역)은 위변조 방지 상태로 보관ㆍ점검한다. 악성코드 대응 프로그램을 최신 상태로 유지하고, 제출 파일은 샌드박스 검사 후 저장한다.\n파기는 전자파일은 영구 삭제 방식으로, 비전자매체는 파쇄 또는 소각으로 수행한다. 백업본은 순환보관 정책에 따라 파기 시점 도래 시 자동 덮어쓰거나 암호화 상태로 분리 유지 후 파기하며, 파기 결과와 실패 시 재시도 내역을 로그로 남긴다. 보존 기간, 분리보관 사유, 파기 일정과 결과는 데이터 목록에 기록하고 정기 점검한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "REWRITTEN adds business elements not present in ORIGINAL (e.g., payment history handling, explicit exclusion from marketing/recommendation). These are not necessary to correct the core handling issues (withdrawal deletion and ≥1-year inactivity segregation) and expand the scenario beyond minimal changes.", "fix": "Trim added business details and keep controls focused on withdrawal deletion and inactivity segregation. Text-level edits:\n- Replace: \"소개팅 앱은 매칭 제공과 본인확인, 고객문의 처리에 필요한 최소 정보(연락수단, 닉네임, 인증 결과값, 결제 이력(해당 시))만 처리한다.\" WITH \"소개팅 앱은 매칭 제공과 본인확인, 고객문의 처리에 필요한 최소 정보(연락수단, 닉네임, 인증 결과값)만 처리한다.\"\n- In the dormancy paragraph, delete the sentence: \"마케팅 및 맞춤 추천 처리 대상에서는 제외한다.\" and keep the remainder: \"휴면 저장소에는 재이용에 필요한 최소 항목만 보관하고 ...\""}]}}
{"case_id": "2022-004-013", "respondent": "소개팅앱 운영사(피심인)", "case_content": "피심인은 2021.9.27.~9.28. 사이 서울경찰청 신고, 외부 보안업체 분석 의뢰, 보호나라·개인정보보호포털 신고 등 대응을 진행하였으나, 유출된 개인정보 항목과 발생 시점, 이용자가 취할 수 있는 조치, 담당 부서 연락처 등을 개별 이용자에게 알리는 통지 절차는 별도로 운영하지 않았다. 이용자 통지는 이메일·문자 등 개별 수단으로 발송되지 않았고, 별도의 공지로 갈음하는 방식도 사용되지 않았다. 이후 개선 조치로, 개인정보 침해사건을 인지하면 즉시 전파 차단, 원인 분석, 영향 범위 산정 및 재발 방지 조치를 수행한다. 유출등 사실을 알게 되면 72시간 이내 서면, 전자우편, 문자, 전화 또는 이에 상당하는 방법으로 유출 항목, 시점과 경위, 정보주체가 취할 수 있는 조치, 회사의 대응 및 피해 구제 절차, 담당부서 연락처를 우선 통지한다. 확인되지 않은 사항은 확인되는 즉시 추가 통지한다. 연락처 확인이 곤란한 경우에는 자신의 인터넷 홈페이지에 30일 이상 게시하여 통지를 갈음하고, 인터넷 홈페이지를 운영하지 아니하는 경우에는 사업장 등의 보기 쉬운 장소에 30일 이상 게시하여 통지를 갈음한다. 다음 중 하나에 해당하면 72시간 이내에 보호위원회 또는 한국인터넷진흥원에 신고한다: ① 1천명 이상의 정보주체에 관한 개인정보 유출등, ② 민감정보 또는 고유식별정보의 유출등, ③ 개인정보처리시스템 또는 개인정보취급자가 이용하는 정보기기에 대한 외부로부터의 불법적인 접근으로 인한 유출등. 추가로 확인되는 내용은 확인 즉시 보완 신고한다. 사고 대응·복구 이력과 통지·신고 내역은 내부 대장으로 관리한다. 이메일·문자 발송 등 통지 수행을 위탁하는 경우, 위탁하는 업무의 내용과 수탁자를 홈페이지에 상시 공개하고, 홈페이지에 게재할 수 없는 경우에는 사업장 등의 보기 쉬운 장소에 게시하거나 간행물·소식지·계약서 기재 등 시행령에 따른 방법으로 공개한다. 또한 위탁 시 법 제26조제1항 및 시행령 제28조제1항 각 호 사항을 포함한 문서로 체결하고, 법 제26조제4항에 따라 수탁자를 교육·점검하는 등 개인정보의 안전한 처리를 감독한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 4}, "pass": true, "problems": [{"aspect": "minimal_change", "issue": "The field 'violated_articles' was changed from the original ['개인정보 보호법 제39조의4'] to an empty list, which alters the record beyond adding handling/controls.", "fix": "Restore the original value to preserve the scenario: change \"violated_articles\": [] to \"violated_articles\": [\"개인정보 보호법 제39조의4\"]."}]}}
{"case_id": "2022-008-048", "respondent": "피심인(정보통신서비스 제공자)", "case_content": "정보통신서비스 제공 과정에서 회원 식별 및 계정 관리에 필요한 최소 항목(아이디, 이름, 휴대폰번호, 이메일, 비밀번호)만 수집한다. 수집 목적, 보유기간, 동의 거부 권리 등을 가입 화면과 처리방침에 알린다.\n비밀번호는 솔트 적용 일방향 해시로 저장하고, 연락처·이메일 등 식별정보는 저장 시 암호화하며 암호키는 분리 보관한다. 전송 구간은 TLS로 보호하고, 백업 데이터도 암호화하여 별도 저장소에 보관·주기 검증한다.\n접근 통제는 역할 기반 최소권한으로 운영하고, 개인별 계정과 다중인증을 적용한다. 관리자는 VPN 및 허용 IP를 통해서만 접속하며, 데이터베이스 직접 접속은 점프서버를 통해서만 허용한다. 권한 부여·변경·말소 절차를 운영한다.\n웹·애플리케이션·데이터베이스·보안장비의 접속기록과 처리 내역을 1년 이상 보관·점검하고, 로그는 위·변조 방지를 위해 별도 저장소에 보관하며 시간 동기화를 유지한다.\n침입 탐지·차단 체계를 운영하고, 웹 방화벽을 통해 비정상 요청을 필터링한다. 파일 업로드는 확장자·콘텐츠 이중 검사, 실행 권한 차단, 악성코드 검사를 적용하며, 서버·미들웨어·DB는 정기 패치와 취약점 점검을 실시한다. 서비스망과 관리망을 분리하고 방화벽·보안그룹으로 포트를 최소화한다.\n위탁(클라우드·호스팅 등)이 있는 경우 처리 범위, 재위탁 제한, 보안 통제, 사고 통지, 반환·파기 절차를 포함한 계약을 체결하고, 접속권한·보안이행 점검 등 정기 감독을 수행한다.\n목적 달성 또는 보유기간 만료 시 지체 없이 복구 불가능한 방법으로 파기하며, 다른 법령에 따른 보존이 필요한 경우에는 분리 보관한다. 파기 및 분리 보관 이력은 기록한다.\n상시 모니터링으로 이상 징후를 탐지하고, 징후 확인 시 즉시 차단·격리, 원인 분석, 취약점 보완, 비밀번호 초기화 등 후속 조치를 수행한다. 통지가 필요한 경우 정보주체에게 유출 항목, 시점·경위, 피해 최소화 방법, 대응 조치, 문의처를 72시간 이내 제공하며, 신고 기준에 해당하면 관계 기관에 신고한다.\n내부관리계획을 수립·점검하고 개인정보 보호책임자를 지정하며, 취급자 대상 정기 교육을 실시한다. 정보주체는 열람·정정·삭제·처리정지·동의철회를 전용 창구로 요청할 수 있도록 절차를 운영한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 1}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "The REWRITTEN case_content replaces the original incident narrative with a generic, broad compliance program and alters concrete operational details (e.g., log retention from 3 months/1 week to 1+ year, adds MFA/VPN/WAF/IDS/IPS, segmentation, deletion/outsourcing/DSAR procedures). It also removes the breach timeline and detection/notification sequence. This exceeds minimal changes and does not keep the original business scenario intact.", "fix": "Restore the original scenario and controls as the baseline, then add improvements as post-incident measures. Replace case_content with a text that keeps the original facts and appends remediation steps, for example:\n\"피심인(정보통신서비스 제공자)은 자사 서비스 이용자의 아이디, 이름, 휴대폰번호, 이메일, 비밀번호(암호화)를 회원 데이터베이스에 저장하여 관리하였다. 피심인은 웹서버와 데이터베이스 서버의 접속을 IP 기반으로 제한하고 접속기록은 웹서버 로그 3개월, 데이터베이스 로그 1주일을 보존·관리하였으며, 침입탐지 기능은 구성에 포함되어 있지 않았다. 2018.12.13. 업로드된 웹셸을 매개로 2020.5.31.~6.4. 사이 데이터베이스에 질의가 수행되어 위 항목들이 조회되었고, 이후 2020.6.4.~6.6. 사이 내부 로그 분석과 보고를 통해 이를 인지하였다. 피심인은 해당 사실을 대상자에게 이메일로 통지하고 홈페이지에 공지했으며, 관련 서버를 일시 중지하고 접근 경로를 확인하였다.\n사고 이후 재발 방지 및 안전조치 강화를 위해 다음을 시행하였다: 비밀번호는 솔트 적용 일방향 해시로 저장하고 연락처·이메일 등 식별정보 저장 시 암호화를 적용(암호키 분리 보관)하며, 전송 구간은 TLS로 보호하고 백업 데이터는 암호화·별도 보관·주기 검증한다. 접근 통제는 역할 기반 최소권한으로 운영하고 개인별 계정과 다중인증을 적용하며, 관리자는 VPN 및 허용 IP를 통해서만 접속하고 데이터베이스 직접 접속은 점프서버를 통해서만 허용한다. 권한 부여·변경·말소 절차를 운영한다. 웹·애플리케이션·데이터베이스·보안장비의 접속기록과 처리 내역을 보관·점검하고(보관 기간은 내부 기준에 따라 상향 조정), 로그는 위·변조 방지를 위해 별도 저장소에 보관하며 시간 동기화를 유지한다. 침입 탐지·차단 체계를 운영하고 웹 방화벽을 통해 비정상 요청을 필터링한다. 파일 업로드는 확장자·콘텐츠 이중 검사, 실행 권한 차단, 악성코드 검사를 적용하고 서버·미들웨어·DB는 정기 패치와 취약점 점검을 실시한다. 서비스망과 관리망을 분리하고 방화벽·보안그룹으로 포트를 최소화한다. 위탁(클라우드·호스팅 등)이 있는 경우 처리 범위, 재위탁 제한, 보안 통제, 사고 통지, 반환·파기 절차를 계약에 반영하고 정기 감독을 수행한다. 목적 달성 또는 보유기간 만료 시 지체 없이 복구 불가능한 방법으로 파기하고 다른 법령에 따른 보존이 필요한 경우 분리 보관하며, 파기 및 분리 보관 이력을 기록한다. 이상 징후 탐지 시 즉시 차단·격리, 원인 분석, 취약점 보완, 비밀번호 초기화 등 후속 조치를 수행하고, 통지가 필요한 경우 정보주체에게 유출 항목, 시점·경위, 피해 최소화 방법, 대응 조치, 문의처를 72시간 이내 제공하며, 신고 기준에 해당하면 관계 기관에 신고한다. 내부관리계획을 수립·점검하고 개인정보 보호책임자를 지정하며 취급자 대상 정기 교육을 실시한다. 정보주체는 열람·정정·삭제·처리정지·동의철회를 전용 창구로 요청할 수 있도록 절차를 운영한다.\""}, {"aspect": "minimal_change", "issue": "The REWRITTEN record set violated_articles to an empty list, removing the original field contents.", "fix": "Restore the violated_articles field to match the original record unless there is a justified, minimal-change reason to alter it. Explicitly set:\n\"violated_articles\": [\n  \"정보통신망법 제28조\",\n  \"정보통신망법 시행령 제15조\"\n]"}]}}
{"case_id": "2022-008-049", "respondent": "피심인", "case_content": "피심인은 서비스를 운영하면서 2021년 9월 3일 기준 이용자의 아이디, 이름, 비밀번호(암호화), 생년월일, 이메일, 국적, 휴대폰번호, 주소, 별명 등의 정보를 회원 데이터베이스에 저장·관리한다. 내부 정책에 따라 수집 항목의 필요성을 주기적으로 검토한다.\n개인정보 수집·이용에 대한 동의를 받을 때에는 수집·이용 목적, 수집 항목, 보유·이용 기간, 동의 거부 권리 및 거부에 따른 불이익을 명확히 고지하고, 홈페이지 체크박스, 서면, 전자우편 또는 전화 등의 방법으로 동의를 받는다.\n2006.6.1.~2017.7.19. 동안 회원 비밀번호는 SHA-1 방식으로 일방향 처리하여 저장하였고, 이후 솔트 기반의 강한 일방향 알고리즘(bcrypt/Argon2 등)으로 전환하여 저장한다. 연락처·주소 등 주요 식별 정보는 컬럼 단위로 암호화하여 저장한다.\n과거에는 phpMyAdmin을 통해 외부에서 관리자페이지와 DB에 계정·비밀번호 기반으로 접속할 수 있도록 운영하였고, 접속 권한은 IP 주소로 제한하지 않았다. 파일전송서버(FTP)에 업로드된 웹셸을 통해 데이터베이스 설정파일(database.yml)에서 계정정보가 확인되어 원격 접속이 이루어졌고 회원 테이블이 다운로드되었다. 접속기록은 시스템에 보관되었으나 월 1회 이상의 정기 점검은 수행되지 않았다. 이후 VPN과 다단계 인증 도입, 사전 등록된 IP 허용목록 적용, 관리도구의 내부망 격리 등으로 개선하였다.\n개인정보의 안전한 처리를 위한 내부 관리계획을 수립·시행하고 정기 점검한다. 관리자 및 데이터베이스 접근은 개인별 계정에 역할 기반 최소 권한으로 부여하며, VPN과 다단계 인증, 사전 등록된 IP 허용목록을 통해서만 가능하도록 운영한다. phpMyAdmin 등 관리 도구는 외부에 노출하지 않고 내부망 또는 점프서버에서만 사용하며, 데이터베이스의 원격 직접 접속은 차단한다. 데이터베이스 접속 정보는 소스코드와 분리하여 비밀관리 시스템에 저장·주기적으로 순환(교체)하고, 구성 파일은 웹 경로 밖에 두어 접근 권한을 제한한다.\n개인정보 전송 시 TLS를 적용하고, 파일 전송은 SFTP/HTTPS만 허용한다. 업로드 디렉터리에는 실행 권한을 부여하지 않으며 확장자·콘텐츠 검사를 수행하고, 악성코드 탐지와 웹방화벽/침입차단으로 비정상 트래픽을 차단한다. 서버와 미들웨어는 최신 보안 패치를 적용하고 정기 취약점 점검을 시행한다.\n접속기록은 관리자·DB·시스템 단위로 생성하여 안전하게 보관하고 위·변조 방지 조치를 적용하며, 월 1회 이상 정기 점검한다. 권한 부여·변경·말소 이력과 암호화 키·비밀정보 접근 이력은 별도로 기록·감사한다. 백업 데이터는 암호화하여 분리 저장하고, 복구 테스트를 수행하며, 파기 기준을 운영 환경과 동일하게 적용한다. 물리적 보관구역에는 출입통제와 잠금장치를 적용한다.\n보관 기간은 목적 및 관련 보존 기준에 따라 설정하고, 기간 만료 또는 목적 달성 시 전자 기록은 복구 불가능한 방식으로 삭제하며, 문서는 파쇄·소각한다. 다른 기준에 따른 보존이 필요한 경우에는 해당 정보만 분리 보관하고, 파기 이력을 남긴다.\n개인정보 처리방침에 수집 목적, 항목, 보관·파기 기준, 제3자 제공 및 처리위탁 현황, 안전조치, 이용자 권리행사 방법을 공개한다. 유출 등 사고 대비를 위해 통지·신고, 피해 최소화, 재발 방지 조치를 포함한 대응 절차를 마련하고, 개인정보 유출 인지 시 72시간 이내에 정보주체에게 통지하고 보호위원회 또는 한국인터넷진흥원에 신고한다. 사건 인지 후 홈페이지 팝업과 이메일을 통해 유출된 개인정보 항목, 시점과 경위, 피해 최소화 방법, 대응조치 및 피해 구제 절차, 신고 접수 연락처를 통지하였다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 2}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "The rewritten case_content adds broad, new policies and controls (consent collection procedures, privacy policy disclosures, retention/destruction regimes, transport security, WAF/malware scanning, backup/physical security, general incident response timing) that were not in the original scenario. This exceeds minimal edits needed to address the original handling and breach.", "fix": "Delete the added paragraphs not present in the original scenario:\n- Remove the sentence: \"내부 정책에 따라 수집 항목의 필요성을 주기적으로 검토한다.\"\n- Delete the entire paragraph beginning: \"개인정보 수집·이용에 대한 동의를 받을 때에는 ... 동의를 받는다.\"\n- Delete the paragraphs beginning: \"개인정보의 안전한 처리를 위한 내부 관리계획을 ...\", \"개인정보 전송 시 TLS를 적용하고 ...\", \"접속기록은 관리자·DB·시스템 단위로 ...\" (keep only a short line about 도입된 정기 점검), \"백업 데이터는 암호화하여 ...\", \"보관 기간은 목적 및 관련 보존 기준에 따라 ...\", \"개인정보 처리방침에 ...\", and \"유출 등 사고 대비를 위해 ... 72시간 이내에 ... 신고한다.\" Keep the final sentence about 통지 사실만 남기되, 앞선 72시간 고지는 삭제."}, {"aspect": "minimal_change", "issue": "The narrative tense shifts from past (incident-focused) to present, altering the original scenario framing tied to 2021-09-03.", "fix": "Change present-tense statements back to past tense to match the original incident timing. For example:\n- Replace: \"... 정보를 회원 데이터베이스에 저장·관리한다.\" with \"... 정보를 회원 데이터베이스에 저장·관리하였다.\"\n- Replace: \"... 이후 솔트 기반의 강한 일방향 알고리즘(bcrypt/Argon2 등)으로 전환하여 저장한다.\" with \"... 사건 인지 후 솔트 기반의 일방향 알고리즘(bcrypt 또는 Argon2)으로 전환하였다.\""}, {"aspect": "minimal_change", "issue": "The violated_articles array was cleared, which changes the original case outcome.", "fix": "Restore the original violated articles exactly: set\n\"violated_articles\": [\n  \"개인정보 보호법 제29조\",\n  \"개인정보 보호법 시행령 제48조의2\"\n]"}, {"aspect": "objectivity", "issue": "The phrase \"강한 일방향 알고리즘\" introduces a qualitative descriptor; strictly factual, technology-specific wording is preferred.", "fix": "Replace \"강한 일방향 알고리즘(bcrypt/Argon2 등)\" with \"일방향 알고리즘(bcrypt 또는 Argon2)\". Full replacement:\n- Replace: \"... 이후 솔트 기반의 강한 일방향 알고리즘(bcrypt/Argon2 등)으로 전환하여 저장한다.\" with \"... 사건 인지 후 솔트 기반의 일방향 알고리즘(bcrypt 또는 Argon2)으로 전환하였다.\""}]}}
{"case_id": "2021-013-103", "respondent": "피심인", "case_content": "서비스 가입 절차 1단계(계정 생성)에서는 필수 항목(이메일, 비밀번호)만 입력받는다. ‘다음’ 클릭 시에는 화면 전환을 위한 임시 처리만 하고, 수집·이용 목적·항목·보유기간을 안내한 뒤 ‘계정 생성’에 동의한 경우에 한해 정보를 서버에 저장한다. 비밀번호는 전송 구간을 암호화(TLS)하고, 저장 시 솔트를 적용한 일방향 암호화로 보관한다. 이메일은 인증 링크로 정확성을 확인하며, 24시간 내 미인증 계정은 자동 삭제한다.\n\n자동수집 항목은 접속 보안에 필요한 최소 정보(IP, 브라우저/OS 등 접속기록 및 난수화한 디바이스 식별값)로 한정하며, 보안 모니터링 및 이상 징후 분석 목적에만 이용한다. 서비스 제공과 무관한 프로파일링·마케팅에는 사용하지 않는다. 필수 쿠키만 기본 사용하고, 분석·마케팅 쿠키는 별도 선택 동의로 분리하여 수집하며, 미동의 시에도 가입·이용에 제한이 없다. 세션 쿠키는 세션 종료 시 삭제하고, 선택 쿠키는 최대 12개월 보관하며 설정에서 언제든지 철회할 수 있다.\n\n보관 기간은 다음과 같다. 계정정보(이메일, 인증정보)는 회원 유지 기간 동안 보관하고 탈퇴 시 지체 없이 파기한다. 접속·보안 로그(IP, 난수화된 디바이스 정보, 활동 이벤트)는 최대 6개월 보관 후 자동 삭제한다. 시스템 백업본은 암호화 상태로 90일 이내 순환 삭제한다. 거래·정산 등 법정 보존이 요구되는 항목은 해당 기간 동안 별도 분리 보관한다.\n\n안전조치로서 저장 데이터 암호화, 인증정보의 일방향 암호화, 전송구간 암호화, 최소권한 기반의 접근권한 관리, 개인별 계정 발급 및 정기 점검, 접속기록 보관·점검, 악성코드 방지 및 취약점 관리, 물리적 접근통제를 적용한다. 파기 시에는 복구가 불가능한 방법으로 삭제하고, 파기 이력을 기록한다.\n\n광고성 정보 발송 등 마케팅은 별도 선택 동의가 있는 경우에만 수행하며, 동의 내역과 마케팅용 데이터는 본 서비스 데이터와 분리 보관한다. 동의 철회 또는 수신 거부 시 마케팅 목적 보관분을 즉시 중지·삭제한다.\n\n처리 목적과 합리적으로 관련된 범위 내 추가 이용·제공은 내부 심사 기준에 따라 정보주체의 불이익 가능성, 가명처리 가능성, 안전조치 이행 여부를 검토한 후 최소 범위로 수행하고, 검토·결정 기록을 보관한다. 이메일 발송 등 일부 업무를 외부에 위탁하는 경우 처리 범위, 재위탁 제한, 안전조치, 사고 통지, 반환·파기, 점검·교육을 포함한 계약을 체결하고 이행 여부를 정기 점검한다.", "violated_articles": [], "evaluation": {"scores": {"legality": 5, "objectivity": 5, "minimal_change": 2}, "pass": false, "problems": [{"aspect": "minimal_change", "issue": "수집 트리거가 원문에서는 ‘다음’ 클릭 시 서버 수집이 이루어지는데, 재작성본은 ‘계정 생성’ 동의 이후로 변경되어 핵심 흐름이 바뀌었습니다.", "fix": "다음 문장을 교체하세요.\n- 교체 전: \"‘다음’ 클릭 시에는 화면 전환을 위한 임시 처리만 하고, 수집·이용 목적·항목·보유기간을 안내한 뒤 ‘계정 생성’에 동의한 경우에 한해 정보를 서버에 저장한다.\"\n- 교체 후: \"‘다음’ 클릭 단계에서 수집·이용 목적·항목·보유기간을 안내하고, 동의 체크박스를 통해 명시적 동의를 받은 경우에 한해 이메일 주소와 비밀번호를 서버에 저장한다.\""}, {"aspect": "minimal_change", "issue": "원문에 포함된 자동수집 항목(자사 쿠키 데이터, 서비스 활동·상호작용 내역, 기기·소프트웨어 특성, IP로부터 유추 가능한 국가 정보 등)이 재작성본에서 축소·삭제되어 시나리오의 데이터 범위가 변형되었습니다.", "fix": "자동수집 항목 단락 뒤에 다음 문장을 추가하세요.\n\"보안 목적 필수 항목 외에, 자사 쿠키 데이터, 서비스 활동 및 상호작용 내역, 기기·소프트웨어 특성, IP로부터 유추 가능한 국가 정보는 서비스 제공·관리 및 품질 개선 목적(마케팅은 별도 선택 동의 시)으로 수집하며, 디바이스 식별자는 난수화하여 수집한다.\""}, {"aspect": "minimal_change", "issue": "보관기간 체계가 원문(기본 10개월, 백업 2개월, IP 7~10개월, 디바이스·활동 정보는 계정 삭제 시까지, 쿠키 최대 24개월)에서 재작성본(로그 6개월, 백업 90일, 선택 쿠키 12개월 등)으로 대폭 변경되었습니다.", "fix": "보관기간 단락을 다음과 같이 대체하세요.\n\"보관 기간은 다음과 같다. 기본 시스템 데이터는 10개월 보관, 백업 시스템 데이터는 암호화 상태로 2개월 내 순환 삭제한다. IP 정보는 7~10개월 보관한다. 디바이스·활동 정보는 계정 삭제 시까지 보관한다. 쿠키 데이터는 세션 쿠키는 세션 종료 시 삭제하고, 선택(분석·마케팅) 쿠키는 최대 24개월 보관하되 동의 철회 시 즉시 삭제한다.\""}, {"aspect": "minimal_change", "issue": "원문에는 목적에 ‘법령 준수’가 포함되나 재작성본에는 명시가 누락되어 목적 범주가 축소되었습니다.", "fix": "처리 목적을 서술하는 문단에 다음 문구를 추가하세요.\n\"법령 준수 목적(법정 보존 의무 이행 포함)으로 필요한 범위에서 처리한다.\""}, {"aspect": "minimal_change", "issue": "원문에는 violated_articles에 \"개인정보 보호법 제39조의3\"가 기재되어 있으나, 재작성본에서 빈 배열로 변경되었습니다.", "fix": "REWRITTEN의 violated_articles 값을 다음과 같이 수정하세요.\n\"violated_articles\": [\"개인정보 보호법 제39조의3\"]"}]}}
